{"posts":[{"title":"OOC","text":"Object-oriented design patterns in the kernel 1，多态部分Object-oriented design patterns in the kernel 2，继承部分 下载保存 https://www.cs.princeton.edu/courses/archive/spring21/cos217/https://www.cs.princeton.edu/courses/archive/spring21/cos217/lectures/ 1 封装 参考文件操作 FILE* 使用不完全类型 头文件分成 2 个，一个对外接口，一个用来给子类嵌套继承 2 多态两种实现方式，常用第 2 种，文章对内核种第 2 种使用的特殊情况做了讨论 最简单的方法是结构体包含函数指针，函数第一个参数为结构体指针。bar-&gt;foo(bar, …args)。但在对象很多时由于内存占用比下面的 vtable 多，这种 linux 内核不常用 再复杂是将函数指针组成表，virtual function table (vtable) ，一般命名为 XXX_operations、XXX_ops，对象中包含这个表的指针 vtable 为 NULL 的 2 个原因 新添加了一个方法，但还没实现 该方法对这种情况无意义，临时的或长期的 但作者认为总可避免使用 NULL（个人观点：会掩盖 Bug） NULL 是少数时，实现默认方法，利用 C99 多次初始化，将默认值写在前面 NULL 是多数时，且性能很重要，在调用前判断 flag 的 bit，出现特殊情况才调 vtable 中的函数 vtable 还可包含模块名称和链表 struct list_head，便于上层查找注册的设备 vtable 第一个参数不是结构体指针的情况 结构体指针放在了最后一个参数 只有一个对象，所以不需要指针，这个对象就是全局的 多重继承，Mixin，提供某个功能，但不以这个对象为主，需要多个对象 子类的操作放入父类的 vtable 中，避免数量多的结构体过大，节省内存，以 struct page 举例 3 继承 is 派生类包含基类 基类使用 void *private 指针 基类包含派生类 定义 基类是第一个派生类成员 基类和派生类互相指 基类和派生类定义到一个文件派生成员 union 实现把每个使用 union 的地方看作继承 创建 调派生类 ctor，派生类 ctor 再调基类 ctor 先调基类 ctor，基类 ctor 再调派生类 ctor 先调基类 ctor，再调派生类 ctor 使用 对外提供基类指针，用多态方式调派生类接口派生类接口中用 container_of() 将基类指针转成派生类 / / 优点 多数情况 适用于需要切换子类的类型时 / 缺点 / 两次内存分配性能不好，内存占用和解引用花费时间void * 可读性差，看不出含义 浪费内存 mixin 类型继承，例如链表，提供某种服务 一个对象只有一个引用计数（在最内层基类中）管理生命周期，内核不使用垃圾回收，因此可用是否有引用计数将单继承与 mixin 继承区分开 TODO，下一步看 linux 内核加密部分、openssl 部分代码，复习 ooc 代码，仿写出 modbus 代码 重点在第 6 章，后续章要么太难，要么与主题无关，所以基本没看。此外那个计算器是个有趣、有难度的例子。这本书使用 void* 而没用不完全类型（即前向声明）是个小瑕疵，否则代码会更清晰 添加新函数时，基于 vtable 基类 Class 扩展新的函数，定义好后，new 一个新的 vtable 对象（这其实分两步，见第 6 章 initPoint() 代码），所谓类描述符。添加新成员时，基于 Object 扩展，然后用刚刚的 vtable 对象（即类描述符）创建对象（因为刚刚创建的 vtable 包含了构造函数和对象大小）。因此创建对象要先创建类描述符。因此对于成员和函数要有两个基类，vtable 因为只有一个且储存了对象大小信息所以叫 Class（为避免歧义称 Class 类为 vtable 类，或者叫类描述符类），而包括 vtable 类在内的所有类都继承自 Object 类，Object 类里面只有一个 Class 指针成员，表明所有对象都属于某个类。 还要静态创建 Class 和 Object 类的类描述符，用于子类的 ctor 和 dtor 中调用，初始化基类成员部分。对于 Object 的 ctor 什么都不用做， Class 的 ctor 初始化函数指针。 改进和个人思考：这里静态创建的 Class 和 Object 类的类描述符，用来作为 ctor 调父类 ctor 的终点，完成继承关系即 新类的 vtable -&gt; Class -&gt; Object 。新的类描述符要 new 出来，不如静态定义清晰，因为类不会像对象创建很多（虽然逻辑上确实是用 Class 这个 vtable 基类，创建新的类，相当于 new 新的类描述符对象，但这种对象不会很多）。如静态定义就不必再调 Class 的 ctor，也不必静态创建 Class 的类描述符。而且 Class 不必继承 Object，否则每个对象，成员部分继承 Object 有 Class 指针，函数部分也继承 Object，即 Class 部分还要有 Object，Object 里面又有 Class。Class 不继承 Object（即不包含 Object），自己本身就作为 vtable 形式的基类，与 Object 是平等的关系。新类的 ctor 没必要再调父类 Object 的 ctor，可以仅为了继承逻辑，struct Class Object = {初始化}，新类指向 &amp;Object 12345678910111213141516171819202122232425262728struct Object { const struct Class * class; // 没变化};struct Class { // 这里去掉 Object 继承，const struct Object _; const char * name; const struct Class * super; size_t size; void * (* ctor) (void * self, va_list * app); void * (* dtor) (void * self); int (* differ) (const void * self, const void * b); int (* puto) (const void * self, FILE * fp);};struct Class Object = {.name = &quot;Object&quot;}; // 只定义 Object 的类描述符，不再定义 Class 的类描述符struct Point { const struct Object _; int x, y;};struct PointClass { // 静态初始化类描述符 const struct Class _; void (* draw) (const void * self);} Point = {_.name = &quot;Point&quot;, _.super = &amp;Object, _.size = sizeof(struct Point), _.ctor = Point_ctor, .draw = Point_draw};p = new(Point, 1, 2); // new 里面按照 Point 的大小申请内存和调构造函数 进一步举例如何应用 12345678910111213141516171819struct DeviceClass { struct Class parent; void (* fun1) (const void * self);} DeviceDesc = {这个就是类描述符，创建对象时需要} ;struct Device { struct Object parent; int x, y;};struct SubDeviceClass { struct DeviceClass parent; void (* draw) (const void * self);} SubDeviceDesc = {这里可以先继承父类的函数指针(.parent = DeviceDesc)，然后在后面来覆盖(.parent.parent.ctor = SubDeviceClass_ctor)，因为根据 C99 多次初始化最后那个有效}; struct SubDevice { struct Device parent; int z;}; 4 异常处理用对应的库，用 setjmp 和 longjmp 实现。 还能实现线程切换，已经放入 Dropbox 书 https://www.cs.princeton.edu/courses/archive/spring04/cos217/lectures/Exceptions.pdf 5 单元测试试试 Google Test ？ https://stackoverflow.com/questions/65820/unit-testing-c-code 6 内存管理7 安全cppcheck","link":"/%E4%B8%93%E4%B8%9A/OOC/"},{"title":"体检","text":"","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E4%BD%93%E6%A3%80/"},{"title":"保险","text":"","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E4%BF%9D%E9%99%A9/"},{"title":"应急物品清单","text":"1 急救注意购买接触伤口的物品时是否为无菌，选择京东正规店铺，清单按照 1 人使用准备 清单 —– 个人防护 —– 10X 丁腈手套（乳胶手套可能引起部分人过敏） 10X 医用外科口罩 1X 护目镜 2X 人工呼吸面罩/面膜 —– 清洁与消毒 —– 3X 酒精消毒片 3X 碘伏消毒片 40X 碘伏棉签 —– 止血 —– 10X 医用纱布（10 * 10cm） 3X 医用纱布（20 * 30cm） CELOX 止血粉 15g 1X 急救止血绷带 1X 压缩曲线纱布 1X 旋压式止血带 —– 包扎与固定 —– 2X 三角巾 1X 可塑夹板 2X 医用胶布 —– 急救用具 —– 1X 镊子 2X 冰袋 1X 保温毯 剪刀 体温计 药品 保鲜膜 （包裹烧烫伤部位） 肾上腺素注射笔 EpiPen 2 防火 清单 灭火毯 灭火器。避免底部受潮，检查压力 过滤式呼吸器。不要挪动，避免失效 烟雾报警器。定期测试 缓降器 3 防灾 清单 强光手电 逃生哨 破窗器 手摇收音机 打火石 净水片 4 其它 事先约定好几个汇合的避难地点，参考 沈阳市应急管理局-应急避难场所 每次多购买些食物用作备用食物，并随着日常消耗和补充 应急卡片，疾病、过敏信息、紧急联系人、特殊血型 5 参考清单","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E5%BA%94%E6%80%A5%E7%89%A9%E5%93%81%E6%B8%85%E5%8D%95/"},{"title":"冥想","text":"卡巴金的正念解释 正念让我们更幸福 不如意的事就是会发生 关注身体多于精神，精神也会受伤，也需要保持健康，否则认知被扭曲，伤害被加重，因此须对情绪和思维高度关注，尤其是失败、孤独、拒绝 冥想技巧 自悯 关注得到和好的方面，人更容易陷入坏的部分中 我在生物上该怎样解释？ 台湾人介绍正念 密码:ish7 专注现在，不迷失在小事中 相信自己做得到 书籍《正念的奇迹》 书籍《第七感》 1. 正念是有意图的、对当下的、不评判的觉察 正念带给个人的转化力量，用于处理每个人都会遇到的心理压力和情绪问题 1 - 5 基础，6 - 11 进阶， 12 - 16 应用， 17 - 21 拓展 练习：吃 要练习。身体 活动会将情绪有关的激素释放掉，首先要培养对身体的感知，身心连接，身体好就有了锚点，情绪不容易失控。奖励尝试，保持好奇与开放才能学到新知识。 练习：躯体扫描。不论任何感觉，不要尝试变化它 情绪、思维、行动的自驾模式，自动触发，容易失控，因此要观察自驾模式，遇到问题也要不评判 练习：正念呼吸 情绪管理的核心，事实 -&gt; 思维 -&gt; 情绪，意识到负面情绪，重新审视事实，寻找自己情绪或对方情绪出现的原因，采取新的思维 练习：3分钟呼吸空间 两个困难，昏沉昏昏欲睡的状态，掉举思绪纷飞，控制不住自己的情绪、思维。如果一直从事没什么营养的活动，其实是转移注意力。发现自己走神的速度越快越好，意识到评判、假设、推理升起，情绪不会脱缰。完美主义自驾模式，纠缠于概念、方法，无法投入到眼前的任务中去。将默认模式设定为关注于当下。 练习：正念行走 进入实操阶段，成为情绪的主人，不被控制。训马不能硬来，耐心共处，打乱固有模式，甚至反过来做（原来跑现在停，原来停现在跑），提前预防。识别，反向微微施力，利用好惯性原理，坏习惯就打乱，好习惯就固定。体验困难情绪，与不适共处的能力。 练习：进阶版3分钟呼吸空间 与情绪的关系也如同驯马，耐心了解马的习性，形成合作、驾驭的关系，不逃避也不沉溺于情绪。观声音练习可以不让我们那么沉溺于自己的想法。如果太沉溺就练习正念去打断它。 练习：正念观声音 直接观察负面情绪，是更有难度的练习，8-10 3节是重点，自驾模式 3 类：贪（渴求）、嗔 主观上感觉对方弱，就会愤怒，强就会恐惧、最后忽视模式，无意识。通过观察与实践，次数足够多，像刷剧一样观念头，心才能相信，才能产生自驾模式的改变。 练习：正念观念头 培养出更多的觉察与容纳能力，不用上面 3 种模式，而采用接纳。疼痛 X 抵抗 = 痛苦，完全的接纳就没有痛苦，这样不用多花精力在管理情绪上了。注意不是对行为接纳，对行为仍要采取行动，是对自己的情绪接纳。面对困难时的自我慈悲心，自悯 自我友善，理解而不评判 普遍人性，每个人都会经历 正念，不远离不沉溺，不夸大不忽视 练习：NO&amp;YES 练习 不跟自己作对，情绪不要当成是自己的，而是看作一种现象，就像是一点就着的火，外界稍微激发，就进入自驾模式。要使自己不易燃。观察负面情绪，并练习接纳，而不被情绪控制。还可以通过情绪去寻找产生的原因。 练习：正念观情绪 对于不懂的不要想太深，不封闭的头脑才能习得新的模式，时不时 check 一下，就会不断创造出新的空间。两个困难，一是正念的能力不足，除了多练外可以尝试先稳定下来。如果觉察不到情绪，那说明你压抑了，需要先觉察压抑。二是理念不对，接纳就是改变，就解决了情绪问题。山的冥想不是正念练习，但可以稳定情绪。 练习：山的冥想 思维、身体、决策行动三方面中情绪的影响和正念的应对办法。行动状态，设定目标，对比与目标的差距，然后去做。但对于最优解不明确的问题，或者情绪问题，则不停的对比和简单的目标是行不通的。存在状态，让我们不去对比，达到宠辱不惊，体验没有好坏，只是一个可以去探索、了解的目标。存在状态的感受非常直接，不需要推理，无具体任务时都可以处在这种状态。 体验存在状态，随时随地可以练，无具体觉察目标，完全接纳 练习：开放觉察练习 先谈三方面中的思维，事实 -&gt; 自驾模式思维 -&gt; 情绪，但情绪也会反过来影响思维，差的情绪导致都是负面的想法，想不起来好事，恶性循环，造成持续的心理打击。洗脑，通过占用认知资源，使自己无法接触真实，使思维固化（注：这说明想法要反应客观事实才有意义）。想法不一定是事实，只是客观现象，观察想法，不可能观察不到想法，因为大脑时刻在运作。 视觉训练比身体和听觉稍困难，因为更吸引人，但与观念头接近。 练习：正念视觉 身体觉察能力分 3 个等级，严重的情况适合做正念的动态练习，并且找心理咨询师。 正念伸展提高身体的觉察和接纳能力 练习：正念伸展 正念帮我们看清楚事实，看清事实才能做明智的决定，搞清楚外部环境与自己内在。思维依赖于语言与概念，对无法描述的事情就只会有感觉。 聚焦探索练习，需要对躯体扫描和观情绪有一定的经验 练习：聚焦探索 正念退失，震荡上扬，暂时的退步，允许一时看不到成果。通过日常正念来保持兴趣，可以选择经常失念的事来练习。除以下情况都可正念，复杂思考、人身安全、高度集中。 练习：3首诗 进入拓展阶段 自悯：匮乏、失败、任何痛苦时，对自身保有爱意 自我友善，理解而不评判，成为自己一生相伴的忠实伙伴，减少不满与焦虑 普遍人性，每个人都会经历，练习接纳 正念，不远离不沉溺，不夸大不忽视，尊重事实 祝愿自己的句子进行练习 练习：自悯练习 自悯是善意、宁静的，无我的状态，没有贪求与嫌恶的升起。孤单感越强痛苦的情绪越强，应对情绪就越有挑战，成几何增长，相反，体验到与他人的连接感，心里就会觉得踏实。自悯解决孤独感，理解普遍人性，每个生命都会体验到的痛苦感受，来找到连接感和共鸣。从这个层面看，我们永不孤独。 练习：共感慈心禅 自悯也可以解决童年创伤。情绪管理要靠自己，但别人的情绪也会影响我们。群体中会有情绪管理者，负责消化负面情绪，不论是管理者还是情绪外包给别人的人，都不是健康的。分辨情绪是别人的还是自己的，通过平时对自己情绪产生的身体感觉来辨别，如果是别人的就不用去处理。寻找友善、觉察的朋友作为支持，撑过最难的几个小时。 关系觉察来发现具有支持性的关系，与躯体扫描近似 练习：关系觉察 宗教上学正念之前会有戒律，正念中著名的生活方式理念是由越南的一行禅师提出的五项正念修习 尊重生命，增加可连接的对象 通过觉察帮助找到真正的幸福 慈心禅练习，给予自己和他人关爱 减少不实言论，言语攻击 戒除容易失念的事物 不要盲从，需要以自己清明的心做出独立判断 练习：湖的冥想 改变需要个人付出，正念的变化是潜移默化的。只要有练习，就没有失败，就是在培养觉察能力，积累对自己和周围的智慧。最后一节课，而你的余生才刚刚开始。 坐得住的选择基础正念练习 40-60分，躯体扫描、正念呼吸 坐不住的练习行走或伸展 思绪乱的练习开放觉察、观念头、观声音、正念视觉 都不适用的可以练正念呼吸、三分钟呼吸空间 不论哪个练习都保持有意图、不评判、对当下的觉察 将正念观情绪融入生活，随时都可以做。每天记录练习情况。 将觉察的各个方面整合起来，当成心理体检。以初心练习，每一次正念都是崭新的。 练习：觉知之轮","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E5%86%A5%E6%83%B3/"},{"title":"急救","text":"1 内容结构graph TD 急救 --> 基础 & 短时致命 & 内科 & 外科 & 其它 & 平时准备 基础 --> 为什么学 & 学习渠道 & 法律问题 & 施救流程 & 环境安全和个人防护 & 无反应有呼吸 & 打120 & 取急救箱和AED 短时致命 --> 心脏骤停 & 气道梗阻 & 大出血 内科 --> 心脏病发作 & 脑中风 & 过敏 & 癫痫 & 中暑 外科 --> 扭伤/骨折 & 烧烫伤 & 动物伤 其它 --> 1[\"哮喘 糖尿病和低血糖 口腔出血 眼外伤 电击伤 冻伤 （食物）中毒煤气中毒溺水……\"] 平时准备 --> 急救物品 & 理论测试 & 经常练习 & 预防 2 基础2.1 为什么学 心脏骤停、大出血、过敏、气道梗阻、溺水等，只有几分钟的抢救时间，无法等急救车，学会后给自己和身边的人用 2.2 学习渠道2.2.1 线下 中国红十字总会训练中心 北京市红十字会应急救护培训基地 北京急救中心 AHA 培训机构急救中心、第一反应、急诊夜鹰 课程 急救员 和总会内容一样 初级急救 导师学员比1：6，器材学员比1：3 开课周期 暂不对个人开课，1 - 3 个月 每个月都有 每个季度，公众号 / 费用 / 425 16学时 heartsaver 1200 8学时，设备按照 1:3 配备，24人560 16学时，设备按照 1:6 配备，90 人 600-1200 报名方式 网站 公众号 电话：66098042，66098044微博：北京急救医疗培训中心 / 衡量标准 老师有急救经验，经得住问 模拟假人有电子反馈系统，可以评估 CPR 的质量 后续有群，群里有急救医生可以咨询 后续能否免费复训 参考 国际急救相关组织 如何拿到急救资格证？ 2.3 法律问题 因自愿实施紧急救助行为造成受助人损害的，救助人不承担民事责任—— 2017年10月1日 《中华人民共和国民法总则》第184条 2.4 施救流程graph LR c1{\"现场环境是否安全?\"} -- 是 --> c5{\"大出血/气道梗阻？\"} -- 否 --> c2{\"是否有反应？\"} -- 否 --> c3{\"是否有呼吸？（濒死呼吸除外）\"} -- 否 --> c4{\"叫人帮忙，有人？\"} -- 是 --> o3[\"指定一人打 120，另一人取 AED\"] --> o5[\"确认做好个人防护\"] c1 -- 否 --> o1[\"移动患者到安全处\"] -->c5 c2 -- 是 --> 征得同意后再帮忙 c3 -- 是 --> o2[\"无反应有呼吸\"] c4 -- 否 --> o4[\"自己打 120，取 AED\"] --> o5 c5 -- 是 --> o6[\"做个人防护止血气道梗阻急救\"] --> c2 o5 --> 开始急救 2.5 环境安全和个人防护 伤者可能是因为当前危险的环境而受伤，所以首先要保证自己的安全，然后判断是否需要将伤者转移到安全环境，以及移动是否会加重伤害 抓住肩部衣服移动患者。对怀疑脊椎、骨盆受伤的患者，除非环境威胁到生命，否则不要移动 固定在坚硬板上，移动时保证头颈胸腰腹骨盆在同一水平线上，避免发生弯曲、扭转 做个人防护，有血液、体液（唾液、尿液）带手套、护目镜、口罩 使用后正确脱除和处理手套，认真洗手，见 AHA 书上对应方法 2.6 无反应有呼吸（晕厥、昏迷、休克） 原因：低血糖、喝醉酒、脑中风等等 确保现场环境安全，做好个人防护 气道 压额抬颏、开放气道，清理口鼻异物，拿掉假牙 不要喂药、喂食，防止呕吐导致窒息 侧卧，侧卧演示见 “急诊夜鹰视频 12”。怀疑中毒用左侧卧，减缓食物吸收。不要仰卧、头下垫枕头，会导致舌根后坠 是否需要保暖，如失血休克 打 120 2.7 打120 患者，年龄、性别 病情，找描述疾病的牌子、信息 地址 找人接应急救车 现场情况，人数，严重程度 等调度员先挂电话，可能通过电话指导急救 准备医保卡、身份证、病历、钱 清理影响搬运的楼道杂物 2.8 取急救箱和AED 随身准备急救物品，手套、面罩 AED 在地铁、机场、体育场 微信小程序 AED 地图，百度地图搜索 “AED” 3 心脏骤停 背景：每过 1 分钟，存活率下降 10%，等急救车来不及，身边人的 CPR 和 AED 是存活的关键。我国每年 54万心脏骤停，存活率仅 1-2% 现象：没有反应、没有呼吸、濒死呼吸 原因：冠心病、触电、溺水、窒息 3.1 步骤graph LR 胸外按压 -- X30 --> 人工呼吸 -- X2 --> change{\"达到 5 组？\"} -- 否 --> AED{\"AED 就绪？\"} -- 否 --> 胸外按压 change -- 是 --> 换人 --> AED AED -- 是 --> 除颤 --> 胸外按压 判断反应，轻拍重唤、拍肩膀 判断呼吸，肘关节着地支撑，压额抬颏，感知气流，侧看数到 1007 找人帮忙，打 120，拿 AED，急救箱。CPR 很累，所以需要换人 一直循环 胸外按压：让血液产生被动流动 躺在坚实的平面，不要在软的床上 薄衣服可以直接按，厚衣服要打开，女士则去掉钢圈胸罩，再盖回衣服 乳头连线的中点，剑突上两横指 用上身的力量，掌根、肘、肩一条直线，垂直按压 每分钟 100-120 次，数数 01、02 成人 5-6 cm，实际根据人的体型，咔咔响、有突破感说明按深了 充分回弹 减少按压中断时间，不超过 10 秒、5 秒 人工呼吸：给患者氧气 按压、呼吸 30:2 个人防护，面膜（仅用来教学）、便携面罩、球囊面罩 压额抬颏（骨性部位）、捏鼻子、包嘴，看到胸部隆起，持续 1 秒钟，正常呼吸吹气（不需要深呼吸吹气） 清理口腔异物，避免将呕吐物吹到气管 胸部隆起来判断是否开放气道成功，失败可多次开放，两个施救人且怀疑颈椎伤时使用 Jaw Thrust 一般 5 个循环换人 AED 除颤。80% 的心脏骤停为室颤（心电图为直线时不需要电击）。突然打击导致心肌无法协调的收缩泵血，电击重新恢复节律 到来后立刻使用，尽早除颤 贴贴片时不中断按压 开始分析到除颤完成期间，提醒周围人不要接触病人 使用注意 水里不能用 有汗擦干 有药贴揭下 挂掉影响贴片的胸毛 对女性不能贴在衣服上，一定贴在皮肤上，但可以贴完盖好 起搏器（手表大小硬块），贴片要避开起搏器 除颤后恢复按压 3.2 何时停止 有呼吸、有反应 急救人员达到 累了，无法继续 3.3 何时不需要做 对非创伤性的心脏骤停效果好，因此这些情况不要做 胸口塌陷 大出血 3.4 儿童（1岁-青春期体征前） 按压：单掌，实际根据体型，深度胸部厚度 1/3、5cm 两人可以 15:2 3.5 婴儿 （28 天-1岁） 判断反应：拍脚底 观察呼吸前：微微后仰开放气道，避免过度 按压：2-3 根手指，深度胸部厚度 1/3、4 cm 人工呼吸：包住嘴和鼻子 两人可以 15:2 3.6 相关问题 先按压还是先人工呼吸？ 心源性，先按压，5 分钟内体内还有氧气 窒息性，溺水、一氧化碳中毒先人工呼吸，人工呼吸前先压额抬颏、清理口腔异物 评估呼吸前是否需要开放气道？ 可以不开放气道，讨论见 在评估呼吸之前，我难道不应该先开放气道吗？ 人工呼吸呼出的气体有足够的氧气吗？ 有，氧浓度 16% 有心脏支架、起搏器，能否做心肺复苏？ 能 可否不做人工呼吸？ 对心源性的骤停，5 min内体内还有氧气，可不做人工呼吸，但 15min 以上抢救必须做 对窒息性的骤停，常见于儿童和婴儿，必须做 AED 是否会对心跳正常的人电击？ 不会，同时对直线的心电图 AED 也不会电击 4 气道梗阻graph LR 1{\"能否咳嗽/说话?\"} -- 否 --> 告知对方自己来帮忙 --> 海姆立克/上腹部冲击法 --> 2{\"孕妇/胖子？\"} -- 否 --> 3[\"一腿伸到两腿间让对方俯下身一手拳眼对准肚脐上方两指另一手握住，快速冲击后上方\"] 1 -- 是 --> 咳嗽/去医院 2 -- 是 --> 冲击胸部/CPR按压位置 自己卡住 --> 4{\"周围有人？\"} -- 是 --> 使用手势表达需要帮助 4 -- 否 --> 桌角/椅背/扶手上腹部冲击 背景：不能呼吸数分钟内心跳停止，等急救车来不及 口诀：剪刀、石头、布 注意要用冲击力，短暂快速，冲击可能导致脏器损伤 不要用手抠异物，可能把异物推到更深 重在预防：老人、儿童进食要小心，醉酒注意呕吐物引起窒息 4.1 婴儿 （28 天-1岁）graph LR 1{\"突然安静，无法哭闹脸色发红、紫？\"} -- 是 --> 2{\"能咳嗽？\"} -- 否 --> 背部拍击 -- X5 --> 胸部冲击 -- X5 --> 3{\"异物出来？\"} -- 否 --> 背部拍击 2 -- 是 --> 翻身放腿上拍背 背部拍击：抓住下巴（不要捂脸、掐脖子），躯干放在前臂上，胳膊用大腿做支撑。背部肩胛骨之间，掌根，快速拍击，5次，每次 1 秒 胸部冲击：换胳膊换腿，婴儿翻身抓头，胸部按压，5次 要点：背部是拍不是按压，胸部是按压不是戳 婴儿太重，胳膊可以用床或沙发的边缘支撑 4.2 鱼刺 鱼刺不要吞饭团，弄下去时可能砸到动脉 仰头用水漱口 他人用镊子夹出 去医院 5 出血 背景：人体的血量 4-5L，动脉和大面积静脉出血可致命 大出血的现象：肢体离断、难以止血、休克 接触血液要做个人防护，感染风险 flowchart TD 出血 --> 非致命出血 & 大出血 大出血 --> 内出血 & 外出血 内出血 --> 12[\"面色苍白，四肢冰凉脉搏微弱，按压疼痛\"] --> 5[[\"躺下下肢抬高保暖打120\"]] 外出血 --> 先尝试 & 再尝试 & 伤口深/如大腿 & 四肢/肢体离断 & 异物刺入 & 内脏溢出 & 脑脊液耳鼻漏 先尝试 --> 1[[\"压迫止血\"]] 再尝试 --> 指压动脉搏动点 & 止血粉 伤口深/如大腿 --> 2[[\"填塞止血\"]] 四肢/肢体离断 --> 3[[\"止血带\"]] & 断肢 断肢 --> 8[[\"清洗断肢敷料包裹放入密封塑料袋放入有冰/冰水容器标记时间不要直接放在冰上\"]] 异物刺入 --> 6[[\"不要拔周围压迫止血\"]] 异物刺入 --> 11[[\"开放性胸部伤口不要封闭避免气胸\"]] 内脏溢出 --> 9[[\"干净敷料覆盖溢出物不要将溢出物塞回\"]] 脑脊液耳鼻漏 --> 10[[\"让它流出不要堵塞耳鼻\"]] 非致命出血 --> 鼻出血 & 皮外伤 鼻出血 --> 7[[\"身体前倾手指压迫 5-10 分钟可塞棉球_等自动滑落\"]] 皮外伤 --> 饮用水冲洗/碘伏 --> 4[[\"压迫止血\"]] 止血方式 应对步骤 压迫止血 用干净敷料或衣物压住伤口，并包扎第二块敷料压在第一块上，不要揭开看情况 填塞止血 将敷料塞进，然后在外面加压 止血带 伤口近心端 5-7cm 上止血带，避开关节，记录止血带时间疼痛是正常的，两个小时之内安全替代品：宽布条、木棍（筷子、笔） 止血粉 Celox，止血粉对比 指压动脉搏动点 适用于没有止血带，或动脉出血在头颈时，搏动点见陈志视频 12 内出血 伤及头部、心脏时即使暂时没任何现象，也要立刻送医院检查 6 内科6.1 心脏病发作 背景：与心脏骤停不同，心脏骤停是心率问题，心脏病是血栓阻止血流，可能引发心脏骤停 现象：石头压榨样胸痛，15 分钟不能缓解，头晕、呼吸困难、出冷汗 容易被忽视的特殊现象：咽喉部、颈部、上腹部疼痛，女性糖尿病可能没有疼痛，只有头晕、呼吸困难 坐下、躺下，减少活动，急救车抬去医院。千万不要自己下楼、开车去医院。还有一部人老人不愿意打 120，拖延了治疗 硝酸甘油（青光眼、低血压、心率过快过慢、48小时伟哥，不能吃）舌下含服，阿司匹林（脑中风、胃肠出血、近期做过手术、过敏史，不能吃）嚼服 去医院挂急诊科，不要挂内科 6.2 脑中风graph LR 1{\"微笑，是否嘴角倾斜僵尸，是否一侧下垂说话，是否清晰\"} --> 去有溶栓/神经外科资质的医院 --> 2{\"头颅 CT，脑出血？\"} -- 是 --> 手术 2 -- 否/血栓 --> 药物溶栓治疗 背景：脑细胞没有再生能力，不及时治疗会有后遗症。关键抢救时间，3.5-4.5 小时 中风时血压升高，不要服用降压药 昏迷时，进行侧卧，不能塞药、喂水 6.3 过敏 严重过敏反应危害：喉头水肿导致的呼吸困难，血量不足导致低血压休克 现象：接触了过敏原，皮疹，舌头肿胀，呼吸困难，面色苍白，心跳加快 肾上腺素自动注射笔，让对方自己打，或征得对方同意帮他打，在大腿中部外侧（可隔衣物）注射，保持 10 秒后拔出，按揉 6.4 癫痫 现象：意识丧失，双眼上翻，牙关紧闭，口吐白沫，全身抽搐 不要塞东西，不用 CPR，让他抽，保证身体周围安全，头下垫垫子，一般 5 分钟左右自动停止 小儿发烧时的热性惊厥，现象和处理方法相同，常见于 3个月-6岁 抽搐停止后，按正常急救流程，检查呼吸和反应 6.5 中暑 背景：通风不好的车内、室内也会引发中暑 热痉挛、热衰竭：头晕、恶心、肌肉痉挛、体温增高、血压下降 转移到阴凉处，喷冷水、扇风 痉挛处按摩、冷敷 少量多次补充盐水/电解质饮料 热射病：神志不清，体温高于 40 度，有生命危险 打 120 立即浸入水中 清醒停止浸泡，避免低体温 7 外科7.1 扭伤、骨折 扭伤：RICE，冰敷 20分钟，加压包扎，抬高，必要时去医院检查是否骨折。3 天后再考虑是否用热敷促进血液循环 骨折：有出血先止血，禁止复位 这部分可交给医务人员做：夹板固定（上肢超过两个关节，下肢超过三个关节），可用卷起的杂志、另一侧的肢体充当夹板，固定后判断血液循环情况。最后上肢悬吊（大手挂、小手挂） 脊椎骨折：颈部疼痛，肢体麻木，除非现场不安全，否则不要移动伤者，推颌法开放气道 7.2 烧烫伤 冲：流水冲洗降温至少十分钟或疼痛减轻 脱：衣服可能与皮肤粘连，剪刀剪开或去医院处理 泡：冷水浸泡，不能用冰 盖：使用不粘的烧伤敷料覆盖，或保鲜膜替代 送：严重去医院 注意 取下首饰，避免肿胀后无法取下 不要挑破水泡 不要冰块 7.3 动物伤 猫、狗、蝙蝠、浣熊、臭鼬等哺乳动物 冲洗伤口、压迫止血 越早打越好，二级暴露：有爪痕，接种狂犬疫苗；三级暴露：还要加上狂犬病免疫球蛋白 啮齿类动物不用打疫苗，松鼠、兔子 蛇、蜘蛛、蜜蜂、蝎子、昆虫叮咬 肥皂水冲洗伤口、压迫止血 对蜜蜂，用银行卡刮出蜜蜂的刺 可能有中毒反应，呼吸困难、视物模糊 拍动物照片 静卧，避免跑动，受伤部位低于心脏，减缓毒素传播 取下首饰，避免肿胀后无法取下 弹性绷带缠绕局限蛇毒，不要用止血带、绳子扎住 去医院处理 蜱虫，壁虱 镊子夹住蜱虫的嘴或头向上提起 肥皂水冲洗伤口 海蜇或其它海洋生物蛰伤 卡片、镊子、戴手套刮除触须 用海水或醋冲洗至少 30 秒 蛰伤部位浸入 45度热水至少 20 分钟或疼痛消失 不要揉搓伤口 8 其它 问题 处理 哮喘 端坐位，不要躺下，给予吸入器 糖尿病和低血糖 能吞咽时吃含糖食物 口腔出血 咬住棉球，压迫止血牙齿脱落时- 拿牙冠不要碰牙根- 清洗牙齿后放入牛奶/蛋清/唾液中，不要放在口中 眼外伤 清水冲洗，受伤那只眼处于冲洗的低位 电击伤 关闭电源后，保证自身安全，走正常急救流程 冻伤 - 移到温暖处- 脱掉潮湿衣服，换上干衣服，保暖注意- 不要揉搓冻伤部位- 可能再次冻伤时，不要解冻 （食物）中毒 避免接触毒物，优先保证自身安全拍照等方式收集毒物信息冲洗自己和患者身上毒物昏倒时走正常急救流程，考虑左侧卧减缓食物吸收 煤气中毒（一氧化碳中毒） 口唇樱桃红色，走正常急救流程 溺水 救人方法见 陈志视频 06抛掷漂浮物（放满空矿泉水瓶的书包，加负重来抛得更远）、绳索，救上岸后正常急救心脏骤停时，先压额抬颏、清理口腔异物、人工呼吸，再按压 阿片类药物过量 给予纳洛酮，走正常急救流程 艾滋病 接触到艾滋病人的血液，精液，乳汁时，越早服用阻断药物越好 腹痛 考虑阑尾炎等，去医院 发热 高于 39 度先物理降温，不要用酒精，1-2 小时不行，使用药物降温，两种降温不能同时使用 挤压伤 如 地震，重物挤压很久，除非现场环境危险，否则不要盲目移开重物，高钾血症 气胸 气胸针急救，网址中针刺减压的部分 气道梗阻（海姆立克法无效时） 环甲膜切开 9 平时准备9.1 急救物品见 应急物品清单-急救 9.2 理论测试9.2.1 基础 实施救人的第一步是什么？ 如何照顾喝醉酒没有反应的人？ 何时应当移动伤者到安全处，移动时应当注意什么？ 哪几种情况是短时致命的，无法等到救护车的到来？ 给家人急救是否需要佩带个人防护用品？ 9.2.2 心脏骤停 进行 CPR 的条件是什么？ 心脏骤停的按压速度是多少？成人和婴儿的速度一样吗？ 能否不做人工呼吸，只进行按压？ 先进行人工呼吸还是先进行按压？ 对于女性进行 CPR 需要解开上衣吗？ 胸外按压的间隔不应该超过多久？ 如何给婴儿做人工呼吸？ 如何找到附近的 AED？ 患者胸部有汗时，能否使用 AED？ 溺水如何急救？ 一氧化碳中毒如何急救？ 9.2.3 气道梗阻 鱼刺卡住能否使用海姆立克法？ 对于双臂抱不住的胖子，应该如何用海姆立克法？ 自己卡住，无法呼吸时，如何自救？ 9.2.4 出血 止血带多久之内是安全的？ 鼻出血应如何处理？ 身边没有止血带可用什么替代？ 9.2.5 内科 心脏病发作有哪些特殊现象？ 如何判断脑中风？ 癫痫发作时如何施救？ 应对严重过敏的有效药物是什么？ 9.2.6 外科 对怀疑颈椎骨折的患者如何处理？ 骨折时没有固定用的夹板，可以用什么替代？ 烧烫伤应该如何处理？ 被蛇咬伤如何处理？ 9.3 经常练习 练习时间 谁练习 练习内容 9.4 预防 老年人跌倒，目前 Apple Watch、三星、华为有跌倒检测，期待更低价的产品，如小米 儿童和老人的气道梗阻 儿童溺水、烧烫伤 独居老人准备病历信息、子女联系方式在家里显著位置，供急救人员使用 import mermaid from 'https://cdn.jsdelivr.net/npm/mermaid/dist/mermaid.esm.min.mjs'; mermaid.initialize({startOnLoad: true, flowchart: {curve: 'linear'}});","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E6%80%A5%E6%95%91/"},{"title":"物品选购","text":"更多选购要查以前的为知笔记了 1 手机 爱电子产品推荐，安兔兔性价比排行，什么值得买测评 手机选择较大运存，去实体店体验，目前选 2k 价位。后期去维修点换官方电池 2 电脑 笔记本电脑 不玩游戏选集显版本，续航长，同时省下 PCIE 可以给固态硬盘用 电脑看拆机图考虑后期硬件扩展（硬盘和内存）和清灰是否方便 看这个型号的测评都有哪些要注意的地方 组装台式 不考虑便携移动，台式性价比更高 办公电脑，不玩游戏不要独显，中高配置在 3k-4k 这样 为了好看，换成白色小机箱、玻璃侧板、ARGB 风扇 固态硬盘用之前买的 显示器用旧的 参考知乎 哪些配置可以压缩、3000元电脑配置清单、2022年2月装机电脑配置推荐 和 B 站视频 2022年最新各价位CPU主板性价比、2022年二月电脑配置推荐 板U 散片多核性价比对应生产力，单核性价比对应游戏。生产力买 AMD，游戏买 Intel 部分配件谨慎的选择淘宝来降低价格，同时淘宝的选择更多，如白色版本。但注意运输时效 从 CPU保姆级超频教程（AMD篇） 看，加上 CinebenchR23 开启 PBO 测试，提升不明显。对多数来说开启 XMP 和 PBO，分配显存就够了 配件 型号 价格 备注 主板 + CPU 微星 B550M MORTAR WIFIR5 5600G 散片利民 AMD 防脱支架 1908 为了性价比选散片为了 ARGB 没选更便宜的 B450为了白色选择 WIFI 版 内存 镁光英睿达 8G * 2 3200 459 白色高频内存，搭配 MSI 主板方便超频从淘宝买保证颗粒型号可超频 内存 镁光英睿达 16G 3200 430 16G 除去 2G 用于集显，剩下内存明显不够用以后要参考主力电脑的内存容量 X2 来买 电源 振华铜皇450W 271 京东，电源选品牌好的 机箱 先马趣造 279 白色送玻璃侧板 散热器 利民 AX120 R SE 90 多数装机配置都不推荐用盒装散热，白色 ARGB 版本 机箱风扇 利民 TL-C12015W-S 83 白色 ARGB，超薄，PWM，主要是装饰 装机服务 京东 118 考虑机箱小不好装且之前没装过机 合计 3638 3 牙膏 摩擦剂，不要碳酸钙，选二氧化硅去污能力强，其次磷酸氢钙 高露洁系列按价格排序，碳酸钙（普通） &lt; 磷酸氢钙（防蛀） &lt; 二氧化硅/水合硅石（360度） 含氟量表格，选 0.14 的，不要囤，时间越久氟量下降。能有实际测评值更好 SLS 没有致癌性，有刺激性，SLES 刺激性比 SLS 低。国内牙膏一般都有 高露洁的研发似乎不错（对 Paraben 防腐剂的态度），价格也可以，其次考虑中华魔丽迅白，最后 低性价比但安全的国外牙膏 考虑德国Elmex 4 储热热水器 品牌排名，海尔、美的 功率和容量 单管，双管，3D 速热管 一级能效，热水输出率 80% 预约，遥控，WIFI 5 配眼镜5.1 验光及镜架尺寸 验光渠道 一般眼镜店，眼镜批发市场。普遍水准不高，个别良心店能保证较好水平。 同仁验光。验光粗糙，态度对付，虽然医师专业，但最后的数据只能算勉强看得过去。 宝岛验光。态度最好，人少，专业程度一般。 爱尔眼科。比较专业，检查全面，要过年时人少。最终基本上使用了爱尔的数据。 镜架尺寸 去眼镜店试戴，记下尺寸，比如 jins 门店 使用胶水和硬纸按照尺寸制作进行试戴 参考之前的镜架 淘宝购买后邮寄试戴 5.2 镜片的品牌 国产国外 依视路，蔡司，尼康，豪雅 凯米，明月 折射率。经过尝试发现1.6的就可以，1.67的国内镜片在厚度、感受的重量上没有明显差异 5.3 镜架的材质及品牌 钛，金属，tr90，板材 5.4 眼镜店的专业程度 镜片真伪的保证，镜片的加工技术，另外后续眼镜的维护，所以要考虑眼镜店的专业程度 jins，宝岛，爱尔，同仁，网上店铺 5.5 价格 jins 的价格便宜，质量中等。 依视路A4 1.6 定制片，网店至少1000，宝岛门店1400，可以自带镜架。 6 洗护用品 参考书，《化妆品好坏知多少》 表面活性剂 氨基酸界面成分标前边有“N-XXX酰-L-xxx酸钠/钾/TEA”。 皂基是“脂肪酸+碱剂”，成分表里同时出现肉豆蔻酸、月桂酸、棕榈酸、硬脂酸和 碱剂比如氢氧化钠、氢氧化钾，就是皂基，或者出现他们的产物如肉豆蔻酸氢氧化钾，也是皂基。 两性表面活性剂有甜菜碱、氧化胺和咪唑啉。其中我们在清洁产品中最常见的是甜菜碱类，就是“xx甜菜碱”，譬如烷基二甲基甜菜碱、烷基二甲基磺乙基甜菜碱等等，旁氏米粹就是氨基酸复配两性的洁面。 成分查询","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E7%89%A9%E5%93%81%E9%80%89%E8%B4%AD/"},{"title":"物理环境框架","text":"flowchart TD 物理环境 --> 人 & 周围环境 人 --> 身体健康 & 心理健康 身体健康 --> 意外 & 疾病 意外 --> 防火 & 急救 & 防灾 & 保险 & 应急物品清单 防火 & 急救 & 防灾 --> 疾病 疾病 --> 锻炼 & 食物 & 体检 & 保险 心理健康 --> 冥想 & 朋友 周围环境 --> 理财 & 朋友 理财 --> 物品选购 import mermaid from 'https://cdn.jsdelivr.net/npm/mermaid/dist/mermaid.esm.min.mjs'; mermaid.initialize({startOnLoad: true, flowchart: {curve: 'linear'}});","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83%E6%A1%86%E6%9E%B6/"},{"title":"防火","text":"1 背景1.1 火灾数据统计 中国 美国 2019 年接报火灾 23.3 万，亡 1335 人，伤 837 人 2019 年接报火灾 130 万，亡 3700 人，伤 16600 人 居民住宅火灾 10.4万 44.8%，1045 人死亡，占总死亡数 78.3% 居民住宅火灾 33.8 万 26%，构成了 75% 的伤亡 52% 电气引起（家用电器、老化线路、电动车） 2018 年，51% 做饭引起，电器故障 6.8%，供暖设备 9.4% 夜间火灾 4.9万，占总数的20.8%，亡人占总数的 48.1% 超过半数的居民住宅死亡发生在夜间，62 % 由于没有烟感 老龄人口占总人口 16.2%，占火灾死亡人数 36.2% 5 岁以下儿童和 65 岁以上老人面临的风险较大 家庭灭火器比例 0.1% 2012年商家：没见什么人买来放家里用（中山市 2019年12月） 至少 75% 家庭有灭火器 烟感比例查不到 2012-2016 消防局，74% 有烟感，53% 火灾时报警了 1.2 火灾案例1.2.1 2009 央视大火案 6寸礼花弹在160米高空绽放，而央视配楼高度是159米。高温星体落入北配楼主体建筑顶部擦窗机检修孔内，引燃检修通道内壁裸露的易燃材料从而引发火灾 到达14层后，消防员带的水已经用光，按照消防惯例，应寻找楼内水源。消防员当时通过呼叫器与楼下联络，得知25楼有水，消防员跑上去放水，水却放不出来。跑了好几个楼层，都是同样的结果 央视的这座大楼尚在施工过程中，内部的灭火体系未能投入使用 张建勇在自己没有任何保障的情况下，毅然将自己的空气呼吸器给被困人员戴上，自己则因吸入大量有毒气体于2月10日1时30分抢救无效殉职 使用大量不合格保温板 新中国成立以来建筑物燃烧最快的一例 1.2.2 2017 西伦敦格伦费尔塔大火伦敦高层公寓楼大火 我们知道什么？ 政府福利房，24 层 67米，火势蔓延快 曾因警告过安全隐患，只有一个出口，楼道垃圾，灭火器过期，4 年没检查消防设备 00:50 冰箱起火，烟雾报警器叫醒，00:54 报警，01:00 到达现场 在 2 楼连接水管，设立指挥花费 7 分钟，01:07 01:08 火焰越过窗框，点燃保温板，01:30 火焰达到楼顶 01:30 - 01:40 25 辆消防车。烟进入楼梯间，尽管有烟，但至少仍有 30 分钟逃生时间 通信不好导致，营救人员的信息要写纸上交给室内指挥官。一名 12 岁女孩从 20 层逃到 23 层，结果没被消防员发现而死亡 02:20 楼梯间的烟达到致命级别 02:47 宣布放弃原地留守措施（火没烧到的居民原地留守） 逃生人数 By 01:18, 34 of 293 residents had escaped 01:18 and 01:38, 110 escaped Evacuation rates slowed, with 20 escaping between 01:38 and 01:58 More than half of those still trapped at 01:58 were killed, while 48 were rescued between 01:58 and 03:58 最高层只有两人获救 1.2.3 2020 沈阳浑南区SR国际新城 SR国际新城102号楼A座509号房间东侧屋内，起火原因系住户刘某某使用的插排电源线发生故障引燃周围可燃物引发火灾 犯罪嫌疑人刘某某因涉嫌失火罪已被公安机关依法予以刑事拘留 短短数分钟，火苗就从5层顺着外墙保温材料蔓延至25层 2018年修订的《建筑设计防火规范》规定，建筑的内、外保温系统，宜采用燃烧性能为A级(不燃)的保温材料，不宜采用B2级(普通可燃)保温材料，严禁采用B3级(易燃)保温材料 1.3 为何要防火 估计成年人一年内遭遇火灾概率 0.1% - 2% 参考 What are the chances that my house burns down? 成年人一年内遭遇火灾 1.2 % （澳大利亚 Mean Annual Probability Of Having A Residential Fire） 1.4 相关法律 失火罪是指由于行为人的过失引起火灾，造成严重后果，危害公共安全的行为，处三年以上七年以下有期徒刑；情节较轻的，处三年以下有期徒刑或者拘役 2014年1月11号凌晨，一场大火将云南香格里拉县独克宗古城建筑烧毁了一大半，火灾烧损房屋直接财产损失达人民币8980多万元。后来经过调查取证，起火的部位是一家客栈经营者唐某的卧室，是唐某在卧室内使用取暖器不当引发了火灾。最终，唐某犯失火罪被判处有期徒刑5年 2 起火应对2.1 火灾种类中国、欧洲、澳大利亚分类 A型：燃烧固体燃料的火，包括木头、布料、橡胶、纸张和某些塑料。 B型：燃烧液体或可液化燃料的火，包括石油、汽油、油、油漆、一些蜡和塑料，但不包括烹调用的脂肪和油。 C型：燃烧气体燃料的火，包括天然气、氢气、丙烷、丁烷。 D型：燃烧可燃烧金属的火，包括钠、镁、钾。 E型：任何A型或B型的火若发生在电器、电线或任何带电体旁边皆属此类。控制火势时不能使用任何导电物体，否则有可能被电击。 F型：燃烧烹调用脂肪和油的火。由于其温度常常远高于其他B型火，因此一般灭火器都无效。 2.2 工具使用 注意：灭火工具只能用于初期灭火（火焰高度小于 25cm），无法灭火时立刻选择逃生 2.2.1 灭火器 适用 干粉可灭 ABCE，5 年有效期 水基，一般 3 年，个别 6 年有效期 泡沫水基 AB，不可灭电器火 水雾水基 ABE 或 ABEF，即可灭电器火，不一定灭油锅火 不适用 干粉灭火器不能用在油锅起火 水基灭火器不能用在天然气起火，一部分水基灭火器不能用在电器火、油锅火、零下温度 上千度高温（火场中心温度）会爆炸 看期限，压力，稍微进入黄色可用，完全进入黄色有爆炸危险 上下颠倒几次，否则无效。目前的干粉灭火器已经不需要用前摇晃 去掉钥匙，拉保险 握住金属环部分，避免喷到自己。4KG以下没有管子 处在上风处。室内无风 压握把，对准火焰根部，左右摆动，让干粉覆盖着火区域 2KG 干粉 8 秒喷完，用完仍无法灭火选择逃离 2.2.2 灭火毯 适用 人起火 油类起火。有争议，中国油锅两边的手把导致灭火毯盖不严 角落起火不方便用灭火器时 不适用 不能用来穿越火场，不隔热 2.2.3 过滤式呼吸器 适用：只有烟无明火时 不适用：不能用来穿越火场，有高温气体 打开包装 去掉前后两个塞子 带上 拉紧带子，避免进烟 只能用 30 分钟 2.2.4 油锅起火graph LR 关油烟机 --> 1{燃气管道还是钢瓶} -- 管道 --> 2[\"慢慢把阀门关到最小火焰变小后关闭阀门\"] 1 -- 钢瓶 --> 3[\"直接关闭阀门\"] 2 & 3 --> 盖锅盖等油温冷却 -- 不行 --> 灭火棒/水基灭火器 -- 不行 -->灭火毯 --> 逃 不能用水、干粉灭火器 参考 先灭火还是先关阀门 2.2.5 插排起火 可不关电，使用防火毯 可不关电，使用干粉灭火器（一部分水基灭火器可灭电火） 2.2.6 身上起火 停下，双手捂脸，滚动 灭火毯 2.3 逃生路线参考台湾 防灾宣导教学手册-火灾预防及应变 graph LR 大叫通知他人/打119 --> 1{\"火在门外还是身旁？\"} -- 门外 --> 2{\"门把手是否烫？\"} -- 是 --> 10[\"塞门缝/向门泼水\"] --> 找出灭火相关设备 --> 开窗前一定关门 --> 躲到有窗户的房间求救 & 从窗逃生 躲到有窗户的房间求救 --> 手电 & 哨子 从窗逃生 --> 缓降器/绳子 & 手套 1 -- 身旁 --> 9{\"着火初期火焰在 25cm 以下？\"} -- 否 --> 楼梯逃生 9 -- 是 --> 11{\"尝试灭火？\"} -- 无法灭火 --> 楼梯逃生 11 -- 火熄灭 --> 安全 2 -- 否 --> 3{\"门外是否有烟？\"} -- 否 --> 6[\"带呼吸器、灭火毯、手电\"] --> 楼梯逃生 3 -- 是 --> 5{\"窗外外墙是否有火？建筑、室内装潢是否易燃？门不防火？\"} -- 任意问题为是时 --> 不适合躲在室内 --> 6 5 -- 全否 --> 10 楼梯逃生 --> 随手关门 --> 平常楼梯 & 消防通道 --> 7{\"有黑色浓烟/有火无法逃生？\"} -- 是 --> 8{\"楼顶未锁且带了呼吸器？\"} -- 否 --> 返回室内 7 -- 否 --> 顺利逃到室外 8 -- 是 --> 楼顶逃生 原则：小火快逃，浓烟关门 不要做 躲到浴室 找湿毛巾，湿棉被 烟上升速度大于人跑的速度，不要轻易选择楼顶逃生。顶楼如锁门，浓烟因为烟囱效应会聚集在这里 遇到高温黑烟和火时要返回，不要强行穿越火场，有呼吸器也无法防护高温气体 用电梯 爬行逃生，容易被踩 楼梯逃生时 小心光亮，可能是火 放低身体 注意 踩踏事故 ，了解如何逃生 3 防火3.1 守则 10A 插座最大承受 2200瓦功率，插排串插排时要算总功率 10 年以上老家电有隐患 取暖器，远离可燃易燃物品 易燃杂物堆积 燃气忘关，或被浇灭 吸烟 烧香 电动车充电放室外专用充电桩，避免过充，最快 6 秒爆炸 灶台前用报纸包上的墙壁 保证逃生通道畅通，否则投诉物业 3.2 防火设备和定期检查见 应急物品清单 3.3 设计逃生路线 火势蔓延迅速，因此要装烟雾报警器，提前设计和演练逃生路线 家庭烟雾警报器是如何救命的？ 起火仅 5 分钟左右，浓烟即达到最大，家庭火灾 黄金逃生时间仅 3-5 分钟 报警声响起只有 2 分左右的时间可以安全地逃生，71%的美国人制定了在发生火灾时的逃生计划，但是，仅有47%的人演练了该计划。（波特兰市消防局） 3.4 理论测试 哪两类人群在火灾中面临的风险大？ 烟雾报警器是否有必要安装？为什么？ 烟雾报警器响起后有多久的逃生时间？ 干粉灭火器不能灭什么火？ 水基灭火器不能灭什么火？ 油锅起火第一步是？ 油锅起火如何关阀门？ 液化气着火时应该使用哪种灭火器灭火？ 使用灭火器的第一步是？ 发现着火后要做的第一步是？ 火场逃生的原则是？ 开门后发现有烟但没有火，是否要穿越过去逃生？ 哪些情况下适合关门室内避难？哪些情况不适合？ 身上着火如何灭火？ 火灾逃生时发生了踩踏，如何应对？ import mermaid from 'https://cdn.jsdelivr.net/npm/mermaid/dist/mermaid.esm.min.mjs'; mermaid.initialize({startOnLoad: true, flowchart: {curve: 'linear'}});","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E9%98%B2%E7%81%AB/"},{"title":"朋友","text":"对应的思维导图在 asset 中","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E6%9C%8B%E5%8F%8B/"},{"title":"理财","text":"1 入场准备回答下面 3 个问题，并给出 数据证明 搞懂底层逻辑，投进去的钱用来干嘛了？为啥能赚钱？ 最多损失多少？ 我能否承受这些损失？ 只要收益超过 10，至少要读几本书回答前 3 个问题后，再开始少量配置 跑路征兆 鼓励购买 1. 提高收益 2. 产品要下架威胁 管理层变动 负面新闻增多 跑路后期 客服响应慢 提现困难 2 如何财务自由 不乱花钱，记账，理性消费，拿来购买资产，比如：裁剪或降级可选消费，必需品囤积一个季度 不浪费时间，投入到有前途的事业中，比如：住的离公司近些 心理转变，勤奋、耐心，贫富差距是思维、心理上的不耐、懒惰 最终有大量钱生钱的资产，就可以有时间和钱做想做的事，即财务自由 3 指数基金巴菲特遗产 90% 购买指数基金，主动基金是辅助，以指数基金为主，最大 30% 的亏损 3.1 宽基指数市值加权 上证50、沪深300，大盘 中证500，中盘 创业板 恒生，香港大盘 H股，香港上市的内地公司 香港中小指数 纳斯达克 100 标普 500 3.2 策略加权 红利，股息率，4 种红利指数 基本面，营业收入、现金流、净资产、分红 价值，市盈率、市净率、市现率、股息率 低波动 3.3 行业指数 风险高，辅助投资 10 个一级行业 (GICS)，投资两类，天生容易赚钱，强周期性行业 容易赚钱：必须消费、医药行业、可选消费等，市场需求高、利润高（有护城河）、再投入需求小 周期行业：金融、地产、能源 4 估值 估值指标 计算 适用 应用公式 净利润 静态/滚动/中位数市盈率 PE = P / E盈利收益率为 E / P 盈利稳定增长大于 10% PEG 1-2，同时 PE 历史低位为低估PEG &gt; 2 且 PE 历史高位为高估美联储 FED: 盈利收益率/十年期国债利率年复合收益率 = 初始股息率 + PE 变化率 + 盈利增长率 净资产（资产-负债） 市净率 PB = P / B 无形资产不适用用于盈利周期性行业，经济危机 年复合收益率 = PB 变化率 + 净资产变化率 净资产收益率，ROE (Return on Equity) = E / B = PB / PE 分红 股息率 = D / P，分红率 = D / EDP = DE * EP，分红率往往不变，因此 DP 和 EP 正相关 盈利保持不变，与债券相同评估方法，现金流收益率盈利大起大落、盈利衰退的不评估 5 交易5.1 资金分配 股票基金（指数为主、极少量主动） = 工资 - 保险预留 - 备用金预留（债券基金、银行理财） - 生活消费（短期理财 = 信用卡账单 + 余量） 3 年内不用的钱 5.2 选择基金 宽基、策略指数为主，优秀行业为辅，排除衰退行业 国内为主，海外为辅，海外通过经济增速判断 优先选择场内，注意套利差价，没有再选择场外 选择，规模大、追踪误差小、费用低 5.3 买入 参考估值表，低估买入 已持有的低估指数，越下跌买的越多 避免指数过于相关，即避免投资重合 待完善，首先，长期收益率越高买入比例越多（国家 GDP），其次越低估买入比例越多(PE 在历史的比例) 5.4 卖出 基本面恶化，国家经济不好 梯度止盈，越高估卖出越多，10% ×（24/20）^2=14.4% 类似的基金更便宜（低估） 股息率大于 4% 可以长期持有不卖出，享受分红 6 执行与心理 少量投资指数基金，可以作为保本理财 计划落实到文档，并不断优化 掌握的三个等级，学习、实践、传授 不遵守计划，人性的贪婪和恐惧将让自己吃亏 涨跌对心理的考验，即使低估值也会短期下跌，因为受到供求关系影响 7 短期理财 货币基金与互联网银行理财对比，选择收益高的 注意服务费，B 类货币基金没有 8 中期固收理财8.1 债券基金 利率上升，债券价格下降，收益变差 中短期（1~3年）资金，买银行理财、债券基金 牛市中后期，没有低估指数基金可投，投资债券 长期看，国内所有的货币基金平均收益率在 2%3%，债券基金在 6%7%，股票基金在 14% 左右 十年期国债利率的中位数 3%~3.5%，小于 3 利率低位选短期债券，大于 3.5 利率高位选长期债券 随时可以投资，出现浮亏可以加仓拉低成本 8.2 银行理财9 人物 巴菲特 彼得·林奇 约翰·博格的博格公式法 格雷厄姆的价值投资理念，盈利收益率法 西格尔教授的著作《股市长线法宝》、《投资者的未来》 10 参考书 指数基金投资指南 定投十年财务自由 11 工具11.1 估值表 螺丝钉 且慢 蛋卷基金 天天基金 支付宝 11.2 定投计算器 蛋卷 东方财富网 11.3 种计算收益的方式如何计算年化收益率？ 11.4 评估风险 负相关，且慢计算相关系数 波动即风险，夏普比率 11.5 基金投资数据回测11.6 应避免的回测误区","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E7%90%86%E8%B4%A2/"},{"title":"防灾","text":"1 地震 发生前 与家人约定集合地点，避难点，公园、学校 准备 食物 发生时，What should I do DURING an earthquake? 室内/室外，跪下、掩护、抓牢，DROP, COVER, AND HOLD ON! 跪下，不要往室外跑 掩护头颈，桌子、枕头、书包、双手。爬，远离窗户、非承重墙、阳台、重家具、会掉落物品的地方 抓牢遮挡物，抓桌腿 开车，待在车里，同样远离坠落物避险 地震可能造成海啸和泥石流，要尽快远离海边、山脚，前往高处 发生后 被困时 用东西支撑住身边可能掉落的重物 节省体力，寻找水和食物 以规律性敲击或光亮求救，确定有人再大声呼救 防范挤压综合征，急救-挤压伤 没被困，需要避难时 关闭家中水电煤 电话通知（打不通时发短信）或给家人留下字条 不要乘电梯 去约定的避难点 小心余震，避开悬挂物、电线、玻璃 2 洪水/泥石流/台风 准备 注意极端天气，橙、红色预警 泥石流前兆，传来火车般的响声 沙袋挡水 台风，窗户贴成米字 发生时 电话求救 高处转移，与泥石流垂直的两边高处爬 把身体绑在固定物上 做简易救生筏 远离电线 3 踩踏事故 发生条件，原理介绍视频、回形针视频 人群密度大 成拱现象：存在一个狭窄的口，人群想尽快从这个口逃离 异向集群：两种人群从这个口反向通过 发生前 去人多的地方时留意有几个出口 死因：摔倒、胸部压迫 发生时，参考1、参考2 双臂交叉撑开胸前（向打拳击一样），留出呼吸空间 顺着人群 避开人多出口、狭窄通道 慢慢对角移到侧边 从不显眼的出口离开 如果摔倒且无法起来 两手十指交叉相扣，护住后脑和颈部 两肘向前，护住头部 双膝尽量前屈，护住胸腔和腹腔重要脏器 侧躺在地 尝试站起 4 理论测试 与家人约定的地震避难场所是哪里？ 地震发生时，低楼层（如一楼）是否应该跑到室外？ 地震发生时的避难原则是什么？ 地震发生后，被困时如何求救？ 压迫肢体很久的重物被移走时会有什么风险？ 发生踩踏时，如何应对脱险？","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E9%98%B2%E7%81%BE/"},{"title":"Flourish","text":"1 A NEW POSITIVE PSYCHOLOGY幸福 (well-being 不是 happiness) 包含 5 部分 积极情绪 投入 与情绪的区别，心流状态当时没感觉，回忆觉得好 情绪是当时就觉得好，比如自慰 意义 成就 有的人是捐赠类型，前半生挣钱，后半生做慈善 有的人是一直激励，认为钱越多越好，服务社会仅仅是追求道路上的副作用 积极的关系 虽然关系总是和其它部分一起出现，但关系导致的合作有进化意义 有一个可以随时倾诉的对象，可以活得更久每部分都需要 对幸福有用 追求其本身就是原因，而非追求其是为了其它内容 定义和测量都独立于其它部分，即排他 这些部分并非表示要求或建议这样做而是描述事实 当帮助或感激他人时，自己会感觉更好 原谅敌人（在课程清单中） 写下今天的 3 件好事 因为进化导致人们会关注不好的事 每件事问 3 个问题 为何这件好事发生了？ 这件事对我意味着什么？ 如何让更多这种事发生？ 找到自己擅长 (signature strength) 的事，并去做，网站 www.authentichappiness.org ，测试结果在 asset 中 只为赚钱的是 job，为了升职的是 career，不给钱、不升职也做的是 calling 召唤 对于伴侣分享的喜悦给予真诚的回应（不是敷衍的） 提到婚姻咨询中的建议都是教如何更好处理矛盾的，但没有告诉如何应对分享的喜悦 使用积极的词汇，positive / negative 词汇的比例用来衡量关系 ABC model，不是灾难，而是持有的信念、对其的解读导致相应的感受 通过理性思考问题，最好、最坏、最可能的情况，消除不好的念头 作者指出自己的方法是可以自我维持的，而药物和谈话在停止后，效果就逐渐没有了 药物除了对最严重抑郁的病人有用，中度和轻度抑郁效果几乎没有 药物分为治疗和掩饰两种，精神类药物都是掩饰类型的 作者建议心理治疗不应只是药物或谈话缓解，而是让患者学会如何与负面情绪相处，更进一步是找到幸福与意义，即前面提到的 5 部分 作者谈到自己的经历，早期误入了脱离实际只研究理论的歧途，后期作为 APA 主席时，里面的人又不重视科学证明 2 THE WAYS TO FLOURISH 目前社会将学习的过错归因于过去的成长环境，而积极心理学则着眼于未来，计划、目标、改变个人性格而改变未来 智力是 achievement = skill X effort skill 执行速度：更快完成任务，别人需要思考的事，用自动化的直觉就能完成，从而省下时间 慢：（个人认为是快思慢想中的慢思考），确定方向、集中精力、自我管理，创造、做计划、检查错误、抑制冲动 学习速度 effort：自律、坚韧不拔 GRIT 比 IQ 更能预测成绩，建议学校培养自律的性格（这也解释了女生 IQ 比男生低，但成绩好的原因），同时也会积累更多的技能 领域内做到杰出的只有少数几个人，他们与普通人的成就并不是正态分布的平缓曲线，而是陡峭的对数曲线，符合二八定律 财富也一样，少数人掌握比普通人多很多的财富 这是因为成就是多个因素的乘积关系（而非累加），杰出的人各个因素比普通人多一点，结果就差好几倍 因此建议 多刻意练习 培养慢思考的功能 人类的合作，利他是物种的优势 多数人听过 PTSD，但却不知道创伤后很多人是可以恢复的，存在负面情绪就自认为得了 PTSD 反而没病变得患病 (self-fulfilling) 经受过磨难的人心理更强大 用白鼠做实验，植入 50% 致死率的肿瘤，分 3 组 分别是可以控制电击停止组、无法控制电击停止组、对照组 可控组存活率比对照组高，不可控组比对照组低，说明无助会削弱身体、可控会增强身体 但作者也说白鼠的结论不能直接放到人上，因为有 external validity 的问题 不可控组中会产生习得性无助，但有 1/3 的人或动物永远不会产生习得性无助 乐观、积极情绪更少患病、更容易痊愈，因为 健康的生活方式，自律、饮食、锻炼身体 有朋友 好的心态，免疫系统强 关于锻炼，建议每天一万步，保证五千步 财富和幸福 well-being 不能划等号 只有在事后评价时财富才是幸福的一个要素，财富无法影响某一瞬间的心情 社会越富有财富越难影响幸福 作者建议从以 GDP 评价改为以 well-being 来评价国家 作者认为金融危机的原因不是某些人缺少道德感，而是他们 value 的事情太狭窄了。金融行业只关心赚钱、军人只关心服务国家，而没考虑更广泛的 well-being 作者认为存在两种现实，一种是乐观也无法改变的客观现实，另一种是可被情绪改变的现实 作者提倡的对后者的乐观，对前者认清现实 可被情绪改变的现实包括，婚姻状况、健康状况，这里婚姻状况作者举例的是，促进婚姻的良性幻觉（更善良、好看、有趣）","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/Flourish/"},{"title":"Politics","text":"左右新旧含义搭配 激进 保守 社会主义，公平 左倾，大跃进 右倾，投降，陈独秀机会主义 资本主义，自由 左翼，主张社会公平 右翼 中国与西方激进和保守含义不同，默认即保守，西方默认在右，主张平等即左为激进，中国默认在左，主张自由即右为激进个人理解：资本主义和社会主义决定大方向，激进与保守决定小方向 民主党-左：个人自由，经济控制，实现公平共和党-右：个人保守，经济放开，资本主义 1 结构 政治的背景知识 政治与经济、文化、社会的互动 国际政治 总结 2 What is Politics 政治的核心是冲突解决，但并不是所有冲突都能解决。不同的观点所以有冲突，同时又需要合作完成目标 人们认为政治是一个 dirty word，政客被当作伪君子 政治两种定义，一种狭义的，指在政府内部发生的事件、政客，将大众排除在外 然而普遍共识是仍然需要政府管理，只是要保证权力不被滥用 政治另一种广义定义，指的是公共事务 公民社会指那些 private 的机构 女性传统上被认为与政治无关，属于 private 领域，因此性别平等不属于政治 政治指不通过武力而是协商，即通过共识和妥协解决问题 power 通过 3种方式施加影响 影响决策，棒子、交易、忠诚 3 种 影响议题，阻止某个议题 思想控制，意识形态 研究政治的方法 哲学传统，不符合科学，normative approach 实证传统，用自然科学的方法，descriptive approach 行为主义，研究可观察的行为、可量化的数据 理性选择理论，借鉴经济理论，一套追求自我利益的个体的规则。弗吉尼亚学派，game theory 博弈论。批评者认为忽略历史和社会背景 新制度主义，新在政策制定由不成文的传统而非正式协议来决定 批判方法，批判体现在两点，一是质疑现有制度，关注受压迫群体，二是不同意主流观点，同时怀疑现有方法存在偏见。后结构与后现代主义不同意普遍真理，但认为可通过解构来理解概念呢、理论 模型、概念可以帮助理解世界，但应用时要注意被忽略的部分 某个 term 可能表示不同的含义，不存在唯一的真理。战争中的两方都说为自由而战，而自由在他们眼中显然有不同的含义，虽然都用了自由这个词 仅仅获得事实还不够，被解释、被组织后才有了意义，模型完成了这一功能 有一个政治课程是否应该中性（即是否与从政不同）的讨论 全球化导致国家边界模糊，政治学与国际关系两个学科融合，国家的边界从 hard shell 变为 soft shell，政治学将国家视为大的 actor，IR 看作小的 actor 3 Political Ideas and Ideologies “意识形态”这个词被污名化，但在现代政治学中是中性的 马克思认为自己使用科学的方法揭露剥削和压迫 自由主义，提倡个人主义和个人自由，比平等和权威更重要，前提是不侵犯他人自由 平等，指的法律和投票平等，不是收入平等，但有机会平等，支持精英社会（天分 + 努力） 传统自由主义，认为国家确保安全和秩序，保证合同的履行，不应该过多干涉，应充当守夜人的角色 现代自由主义，应当保障一些基本权益，这样个体才能做出适合自己的选择。去除 five evils 贫穷、无知、懒惰、肮脏、疾病 家长式保守主义，尊重传统价值观，重实用主义，轻意识形态。认为人的理性有限，因此需要法律约束。认为社会由各种团体构成（而非个体集合），重视共同的文化和价值观 社会主义者分成两种，一种传统保守，列宁，一种改革，社会民主 历史唯物主义，革命先进入无产阶级专政的临时状态，最后形成没有阶级和国界的共产社会 社会民主主义，既接受资本主义又以道德来分配财富 新社会民主主义，帮助人们自救，提供教育，提高国际竞争力 无政府主义者，分资本主义无政府和社会主义无政府（资本主义和社会主义的两个极端），资本主义无政府指没有政府监管的市场，社会主义无政府指全部共同所有 法西斯，没有个人，个人绝对服从上级 女权主义，自由女权主义，法律和政治上平等，社会女权主义，取得经济实力前平等是无意义的，激进女权主义，在家庭和个人上的平等 sex 和 gender，sex 只生理性别，gender 指社会角色中的男性和女性。区分这个是用来反对用生理性别决定社会角色（个人观点：反对刻板印象形成歧视） 女权内部分歧，一部分人认为男性与女性存在生理和心理的本质不同，女性应在承认不同的基础上寻求解放，而非去掉性别的个体 绿色意识形态，以生态为中心的世界观，而非人类中心，人类只是自然的一部分 浅生态主义（也叫 environmentalism）服务于人类，为了可持续发展，不影响人类后代的繁荣。深生态主义（也叫 ecologism）维护自然，主张生物平等 绿色意识形态，通常批评物质和消费，主张存在 being 来自体验和分享的满足而非拥有 having 宗教原教旨主义源于世俗化，导致身份危机和道德结构的缺失 民粹主义，分成纯粹的人和腐败的精英。左翼民粹关注不平等、失业、贫穷，右翼民粹分成关注国家利益的 national populism，强调社会与道德秩序，不满个人权利 authoritarian populism 4 Politics and the State 国家存在的意义，可以参与战争，可以整合意识形态、经济、军事、政治 4 种方式理解国家 意识形态，提倡利他主义 功能主义，维持社会秩序 组织上，政府的公共机构，与公民社会（个人机构）相对 国际上，国际政治的单元 国家的理论 多元国家，通过法律、国家保障秩序，通过宪政和代议政府避免侵犯个人权利。两个假设，state 服从 government，党派竞争和利益活动保证 government 对公众意见的响应 社会契约论 3 要素，无约束的自由是贫穷、野蛮的（state of nature），通过社会契约确立一个维持秩序的政权，公民服从并感谢其带来的稳定和安全 资本主义国家，两种理解国家，共同点是都有不平等的阶级权利 1. 用来管理资本阶级的公共事务，一种压迫工具 2. 一个缓和阶级冲突的机制 新马克思主义将国家视为一个不同利益集团斗争的地带 利维坦国家，通过不断扩张追求自身利益，与马克思认为的服务于阶级利益不同 父权制国家，自由女权主义认为可以通过改革实现性别平等，激进女权认为是国家体现了父权的压迫 国家的角色 最小政府，最小干涉。3 个功能，维护国内秩序：警察，确保合同效力：法院，抵御外敌：军队。经济上 2 个功能，维持低通胀，控制垄断以鼓励竞争 增长政府，用于推动工业和经济发展的政府 社会民主国家，促进社会公平，消除贫穷，提供社会福利 集体化国家，苏联、东欧 集权国家，斯大林时期的苏联，个人观点：毛时期的中国 宗教国家，现代国家都世俗化，宗教被视为私人领域 全球化让国家在框架和国际组织中行事，以英国脱欧举例 5 Democracy and Legitimacy 3 种权威，传统、个人魅力、基于法律。第 3 种，通过选举体现人民的同意，通过法律体现人民希望怎样被管理 公平、福利与个人利益、责任、竞争，新马克思认为两者的矛盾会导致资本主义民主无法维持，而 new right 使用小政府的方式，支持后者，即 pro-individual，pro-market 民主的合法性体现在，允许投票和加入党派，通过协商解决分歧，而非暴力，通过人民的反馈调整政府的输出，维持了政治稳定（个人观点：负反馈的意思） 然而也有质疑，认为并非民主维持了政治稳定，而是资本主义带来的繁荣经济和给予个人平等的机会和自由表达导致的 民粹主义反对多元，像法西斯。民主可以逆转资本主义的不平等倾向，然而 1980 以后的新自由主义不重视平等，因此导致民粹 非民主如何确立合法性，除压迫外，通过 3 种方式，仪式性选举、经济繁荣、意识形态 民主中，人民指的是整体的、个人的、多数的？投票选出代他们做决定的政府，还是为了人们利益的独裁领袖。管理的范围，只是政治领域，还是生活其它方面，包括家庭 直接民主与代议民主，直接民主：每个人都能参与政治的、雅典的，现代中的公投，代议民主：选出代为管理的人 民主利弊，利：多元，解决分歧，参与政治是基本权利，抵御暴政，弊：混乱，加深分歧，强迫的西方民主是文化霸权，多数未必正确，受教育的少数意见被多数意见淹没 4 种民主 经典的雅典民主，弊端，女人与奴隶不参与政治，让男人有时间参与政治 有限民主，New Right 推崇的，放任的资本主义，个人为自己的经济和社会状态负责 发展民主，每个人无私的遵从公共意志，然而可以以公共意志的名义进行独裁。还有另一种不同阶层不同票数的方案，多数不一定正确 社会主义民主，问题是党派替代工人，领袖替代党派 自由民主的不同解释 多元：麦迪逊民主，分散的政治力量，领袖向成员负责，缺点是导致政府过载 精英：多个精英团体在政治市场参与竞争，投票者如同消费者 社团：商界领袖与政府官员协商 新右派：减少政府干预经济，政客竞选许诺提高福利，从而高纳税，不利于经济 马克思：精英认为权利来自于教育、财富、社会地位等，马克思认为来自于生产手段，两者都认为权利在少数人手中 6 REGIMES OF THE MODERN WORLD 政治系统：政府的输出响应人民的输入的这种关系 政权：政府可以变，但政权只能通过内部或外部的军事干涉改变 Aristotle 对政府分 6 种，Who rule，一人、几个人、多数，Who benefits， 统治者，所有人，3 X 2 = 6，Montesquieu 提出三分权 冷战时分 3 种，资本主义、共产主义、发展中国家，本书按照政治、经济、文化来分 5 种 西方自由民主，允许反对，可参与政治，崇尚个人主义（可能高于责任），认为政府是自由的威胁 不自由民主，民主与集权的中间，反对声音弱，媒体管控，少数服从多数。集权国家的中产富裕后会支持集权而不像以前会支持民主 东亚，东方国家的民主受到孔子思想的影响，与个人主义不同。3 个特征，比起个人自由更重经济，支持父亲类型的强政府，强调社会和谐。中国和北韩属威权政府，与其它有选举的亚洲国家也有区别 伊斯兰，包含个人生活的规范 军事，分成集体领导和个人独裁。军事政变发生在经济不发达的国家 7 NATIONS AND NATIONALISM 国家分成政治上和文化上两种，传统的文化上，共同种族、语言，是神秘浪漫的；政治上强调公民忠诚，共同的价值观，更容易接纳外来人。文化不同的国家通常是政治国家，如 4 文化联合的英国、移民国家的美国 发展中国家是政治国家，仅仅因为共同反殖民，争取独立，而文化和种族上是不同的。因此经常有冲突，这是殖民时期的产物 4 种国家主义 自由国家主义。人类自然按照国家分类，每个国家是平等、自决的 保守国家主义。排外 扩张国家主义，服从某个领导人，团结内部、把外部当替罪羊 反殖民国家主义，通常采用马克思列宁的社会主义。国家主义可能只是弱化的社会主义，都基于合作和社区 全球化的环保、经济、文化威胁到了国家主义 8 POLITICAL ECONOMY AND GLOBALIZATION 政治与经济相互作用，政治经济学使用经济学方法分析政治 政治经济学包含 3 种 国家中心的政治经济，保护主义，限制进口，扩大出口 经典政治经济，正和游戏，对交易双方有利，看不见的手达到平衡。完全竞争假设 1. 市场无限制 2. 没有生产者一家独大 3. 消费者充分知情 马克思政治经济，资产阶级通过剩余价值剥削无产阶级，这种阶级矛盾导致资本主义不稳定 实际上没有纯粹的社会主义和资本主义形态，3 种资本主义（资本主义这里指经济形式，非意识形态）形态 企业资本主义，美国为代表，国家只提供基本的 safety net，最小化公有制和工会，利益驱动。弊端是不平等的物质和社会分裂 社会资本主义。欧洲，以社会团结、长期发展为目的。弊端高赋税 国家资本主义，国家调节市场，中国和亚洲国家 凯恩斯和新自由主义，代表管理和不管理的资本主义。新自由主义，从鼓励消费转为鼓励生产。现代经济介于两者之间 全球化伴随着本土化、也可能激起当地的反感。经济、文化全球化外，政治全球化落后于前两者 讨论了金融危机反应了的内在问题还是自然波动，发生的原因缘于通过借贷来实现经济增长，如果减少政府开支或加税反而会让经济停滞 30 年代大萧条导致凯恩斯主义，70 年代滞涨导致新自由主义，金融危机并没导致新自由主义被抛弃 金融危机对中国影响很小，作者认为标志着经济从西方向东方的转移 出现反全球化的原因，USA 中产 30 年没有增长，穷人的福利下降，制造业导致失业 9 POLITICS，SOCIETY AND IDENTITY 工业社会，按照经济划分社会阶级，而非传统社会中的地位 后工业化社会，个人主义、工具主义，弱化社会连接。劳动密集型重工业减弱，服务业兴起 信息和知识是竞争力和生产力，政府的责任是改善教育，扩大个人机会 弊端，散播极端主义，损害个人思考 公平是否正义，让本来不同的人得到同样的结果就是不公平。经济还是社会稳定 个人主义赋予个人人权和独特个体，弊端是忽视公共利益，以及消费主义提倡的立刻满足 身份政治：反对被边缘化的政治，种族、性别、文化，批评者认为多样性导致了国家分裂 10 POLITICAL CULTURE AND THE MEDIA 马克思的方式认为文化、价值是用来骗被统治阶级的 个人主义、流动性增强导致公民参与减少，与人连接减少 媒体对政治的影响有多个不同观点 可以表达意见，体现民主。监督政府 也有认为是被政府控制、被大媒体机构控制、少数精英控制，只体现了他们的价值观 也有认为媒体市场化，为了吸引关注，变得娱乐化，而非教育公民 社交平台促进民主，发起线下活动 弊端是网络上极端言论带来关注，关注带来收益 民粹中的反智，认为大众比少数专家更聪明 11 REPRESENTATION, ELECTIONS AND VOTING政府应该如何代表人们，政府是指导、被指导、还是与人们相似 Trustee 模式，根据知识程度一人代表不同的票数，政府有更大自主权 Delegate 模式，不偏离选民的要求 Mandate 模式，代表政党，忠于自己的政党 Resemblance 模式，政府人员按照不同群体的比例安排以体现公平 选举作用 非竞争的选举也可提供执政合法性，象征意义 选举系统大致分两类，一种比例代表，强调公平，一种是多数当选，强调效率 选举结果的意义是不明确的，受到理性和非理性，私利和无私，无意识等复杂因素影响，可能无法弄懂人们为何这样投票 一种解读是把投票当作出于自身利益购买商品，但也观点认为人们买这个商品是因为广告，即政治宣传，多数人并不真的了解政治问题 投票理论 政党认同，一种心理学偏好，但这种趋势下降了，人们的偏好较以前容易变化 社会学模型，中产右翼，工人左翼，同政党认同，偏好也不固定了 理性选择，基于自身利益的选择，弊端是忽视整体 意识形态，被教育和媒体影响，弊端是忽视个人 12 PARTIES AND PARTY SYSTEMS政党划分 干部型和大众型，干部型由精英组成，大众型去意识形态，以吸引更多选票 被动承受意见，还是主动教育大众。还分主流和民粹 左右划分 政党作用 代表人民，达成目标 培养精英 一党类型分两种，共产主义政党，反殖民类型国家 另外三种：两党派，主导党派，多党派 13 GROUPS, INTERESTS AND MOVEMENTS群体分 3 种 取决于出生所属种族、地位的团体，政府内部团体，一般社会团体 团体可以按照，服务于团体内成员还是公共利益划分，按照政府内部还是外部划分 14 Preface 本书提供一个思考框架和工具，即 interests, interactions, institutions 由 5 部分组成 1-2 历史背景和分析框架 3-6 战争 7-10 经济 11-13 全球治理 14 总结和未来挑战 以问题为导向 15 Introduction 通过了解和努力让世界变得更好 每章提出问题，如何建立理论来解释它 但严格来说，理论、概括性的解释永远无法准确描述现实，会过度简化。因此用概率的方式，指出哪些因素会增加或降低可能性 一些假设无法判断是否正确，只能判断是否解释了现象。如：政客为了维持执政，商人追求利益，这些假设都是过度简化用来分析问题 interaction 两种，bargain 一方获利，另一方就少获利（个观：零和博弈），cooperation 至少让一方获利，而不损失任何一方 interaction 3 个分析层面，国际、国内、跨国（国际 + 国内） 。应用分析时有从国际到国内分析，也有反过来的 realism, liberalism, constructivism 现实主义认为合作很难，各自为自己国家利益，是无政府状态，悲观 自由主义，通过 democratic institutions 可以避免战争，促成合作，乐观 构成主义，强调非物质的，即文化和规范的影响。冲突不仅是军事和经济导致，还是文化的冲突 现代世界很难这样划分，3 种思想都有，本书以问题导向，不用这种分法，而是传授批评、分析思考问题方法 16 Understanding Interests, Interactions, and Institutions inerests 分 3 种，权利与安全，经济财富，意识形态目标，这 3 种并不互斥，如追求财富和权利可服务与意识形态 国家可只两种内容，一种作为追求权利的国家整体，另一种指代国家领导人 分析时选取多少历史背景是个人主观决定的，总体上，倾向于选择简单的解释 合作是正和游戏，bargain 是零和游戏。合作和 bargain 可能同时进行，比如商量 bargain 谁在合作中付出多少 协调，类似右侧驾驶，没有背叛的动机，而合作有背叛动机，囚徒困境中的美苏核弹竞赛 public goods，会出现白嫖的 free ride，即不贡献力量来享受公共资源，比如国防、水资源，因此通常通过政府征税来解决 哪些因素影响合作 actor 的人数越多越难合作 重复交流产生合作（战争时双方战壕互不攻击），合作的方向越多，为了防止新方向不合作会影响已有合作，所以更容易导致合作 信息越容易检验对方是否合作没有背叛，越容易合作 谁赢得 bargin 取决于 power，谁更能承受不合作的后果 强迫，军事和经济制裁 有其它选择时 制度影响合作，如囚徒困境中，囚犯属于某犯罪团伙，团伙会惩罚背叛的人 由权威机构（可施加惩罚）来解决困境，公共利益中谁都不愿意贡献，就由政府来收税 国际上无政府，靠自助，由参与者惩罚不遵守的人，但机构对促进合作也是有作用的 设立标准 核查是否遵守，自我报告，国际原子能机构核查 制定决策，解决分歧 规则从来不是中立的，体现了制度制定时 actor 的 bargin 能力 为何 actor 会遵守对自己不利的规则，1. 为了以后长期利益，比如 WTO 2. 创立新的规则需要投入商量的成本 。然而当利益很大时，actor 也会不遵守规则，如同在国内违法一样 战争是 bargain 失败的结果 17 Why Are There Wars 不只要清楚为何而战，同时因为战争的高成本，还有知道为何选择用战争解决 原因：无政府状态，阻止强大邻国的威胁，因为缺少信息而乐观估计形势（胜率、代价），国内政策也会导致战争 为何而战，有战略价值、资源、文化意义的领土 因为战争导致双方都损失，所以理论上存在协商空间 然而获取不到足够的信息，对自己和对手水平的错误估计导致战争 有时是故意隐藏自己最好、最差的牌，为了将虚张声势和真实意愿区分开来，即提高可信度，可通过边缘政策（将危险政策推到极限）、去掉退路（如公开声明）、调用军队等付出代价的事 矛盾的是为了表决心，让对手相信，反而要去掉退路、冒着引发战争的风险 同时如协议达成，如何确保双方履行，如美国攻击之前协商放弃发展武器的利比亚 preventive war: 阻碍对手壮大，preemptive war: 先发制人，如先发与后发的结果相差很大，即两种情况 bargain range 不重叠，双发就会抢先开战，谈判只是拖住对手 由于信息不足导致的战争，在开打后信息获取到就结束了，然而如果是 preventive war 则持续很久 战争更容易发生的情况 有战略价值的领土 对手军事实力增强 先发对结果影响很大 无法分割导致无法妥协，如圣地耶路撒冷，并非物理无法分割，而是分割后价值消失。但同时注意不可分割有可能是国家的借口 无法分割可通过共享使用、金钱补偿来解决 战争呈现减少趋势 核弹导致成本增加 科技的提高导致对领土的争夺不那么重要 经济互相依赖也使成本增加（反对者认为也可能因果相反，和平导致经济互相依赖） 民主制度也可能导致战争减少 国际组织提高信息透明度，促进国家遵守约定 18 Domestic Politics and War 不把国家当一个整体时，战争是否仅服务于少数利益集团。团体的影响力取决于成员合作能力，因此一个小的利益集团可以以公众利益为代价来推行自己的政策，这部分代价平摊到每个人的损失很少，因此松散的公众会 free ride，不会花精力维权。但民主制度提供了低成本维权的一种方式 双方政客都能从战争中获得很大的收益时（超过战争成本），会利用“聚旗”效应，转移国内的不满，但同时也包含了失败的风险 女性为了对抗柔弱的刻板印象，反而要表现的更强硬，不论在国内还是与对手谈判时 军事利益集团可能推动战争（如日本）也可能因为知道战争的局限，而反对战争 不同利益团体会改变（增加或减少）战争几率，政府和利益集团间会形成互利关系 军队对决策有很大影响，如直接的军事独裁，间接的给出决策建议 然而并非利益集团就完全控制了政府，利益集团只是影响了战争成本的计算，从而改变战争几率，而且存在多个集团观点相反的情况 作者给出民主国家没有战争的原因，1. 双方只有成功几率很高时才会发动战争，因为民主制度让领导者对人们负责 2. 做出的承诺对对手来说更可信，同样因为要对国内人们负责 对民主导致和平的质疑？1. 第 3 个因素导致的和平和民主，如经济发展、共同利益（反德国、苏联） 2. 只是巧合 3. 因果相反，和平导致民主 民主中需要小心的地方。1. 民主制度可以摧毁民主，希特勒掌权为例 2. 公众被国家主义煽动反而导致战争 对于反美的民主政权，美国为自身利益，反而支持亲美的独裁政权 19 International Institutions and War 结盟是因为共同利益、互补需求、联合抵挡共同敌人，少数是瓜分战利品 结盟是为了告诉其他国家，提高结盟的可信度，可通过减少战争成本、增加收益、提高抛弃盟友的成本，在盟国驻扎军队、联合军演、公开结盟仪式、过去的联姻 但当自己的战争成本比盟友高时，维持现状比起战争更有利时，要防止被盟友利用而拖入战争。以美国对中国与台湾的模糊政策为例，要在结盟可信度和限制盟友上做出平衡 英国是否参战的不确定性、结盟的松散、害怕盟友背叛导致两次世界大战，但冷战中只有两个强国，结盟更紧密，因此稳定没爆发战争 UN 不同于同盟，用来维护和平，也会干预种族灭绝等人权问题。当双方承诺停火，但害怕对方先发制人时，维和部队在双方领土中间监督，如戈兰高地 UN 也会有搭便车问题 UN 设立五常，好处：人数少决策好形成，可以得到大国的资源援助，坏处：与大国利益冲突时会被否决 有两种军事行动，阻止战争和停战后维护和平，前者一般涉及自身利益才会有国家愿意出兵，后者则更容易实现，因为代价小 20 Violence by Nonstate Actors: Civil War and Terrorism 如何招人，获得资源 非对称战争（两方军事实力不对等），游击战的方式 原因不满当前政策，或寻求特权，通过领土独立、改变政策、推翻政权，可能会有其它国家资助 独立未必更好，因为独立后，不想独立的人也会导致冲突 如何招人 种族 意识形态 钱、物质 强迫 什么样的容易爆发内战 非极权、非民主国家，民主有和平方式、极权可以镇压 贫穷的国家，人民不满，政府缺少资金消灭叛乱 地形复杂，不容易平定叛乱 外国资助 内战比国家间战争时间长，因为 协议中政府会要求叛乱解除武装， 而叛乱不信任政府。而国家间战争，停火后可以各自保留军队 叛乱内部极端派系，阻碍协商 叛乱派系众多，导致政府不敢向其中任何一派妥协，怕引发连锁反应 叛乱人员会隐藏在群众中，不正面对抗，只是增加政府开销。政府可以在人民中树立信心，同时停止误伤平民 如何减少内战 维和部队可以帮助解决政府遵守承诺的问题 经济上不与反叛组织交易，如毒品、矿石 转型为民主国家，但转型过程中可能因政府太弱而无法对抗反叛力量 恐怖组织的信仰极端（即利益只属于小众群体），但行为是理性的（即服务于自身利益） 恐怖组织无法通过政府机制实现诉求，因此要袭击平民。松散的组织结构使政府难以消灭 恐怖组织与杀人犯不同在于，目的是政治诉求，与反叛组织不同在于袭击平民 恐怖组织与国家战争一样属于 bargain failure，从 3 个原因考虑 信息问题，恐怖组织不会公开袭击计划、实力 commit problem，恐怖组织松散，无法保证所有成员履行承诺。同时政府妥协，可能导致出现更多恐怖组织提出诉求 恐怖分子通过强迫、引导对手打击以使温和派加入自己、破坏和平协议、行动上比同类组织积极 防范手段：先发制人、防御、定罪、协商 21 International Trade 通过比较优势，每个国家做自己最擅长的让所有国家获益。这种优势来源于土地、资产（钱和设备）、劳动力的不同 然而除了比较优势，交易还来源于品牌、国家间外交关系 贸易保护的手段关税、限定进口量。经济学家多数赞成自由贸易，然而 60% 的美国人支持贸易保护 支持与赞成贸易保护由利益决定，三种维度的范围不断缩小 一种观点从阶级的角度考虑，那种资源稀少，与之利益相关的人就会赞同保护主义，如工人少，则工人赞同贸易保护，资本家赞同自由贸易。穷国工人多，富国工人少 另一种观点从产业的角度考虑，这个产业的人不论资本家还是工人都持有同一观点（反对或赞成贸易保护） 第 3 种是从产业中的大公司考虑 促成合作的要素仍然和之前类似，人数少、信息公开、重复互动、与其它利益关联，人数少的极端形式是存在一个强大的霸权（英国、美国）来维持稳定 22 International Financial Relations IMF 支持者认为其维持了金融秩序，反对者认为它是服务于债主的收债人 对待移民的态度也是同样，当国家低技能劳动力少时，本国的劳动力就会使用保护政策，反对移民 23 International Monetary Relations 固定汇率的问题是，国家当经济不好时，没有调整的工具，如想降低利率刺激经济时。货币贬值时政府提高利率，吸引投资者 浮动汇率问题是，变化太大会阻碍国际贸易 强汇率时有利于国内消费者和国外生产者，弱汇率反之 货币危机会从一个国家传染给其他国家 金标准 布雷顿森林体系 浮动汇率，但小国通常与大国汇率绑定；贸易频繁的欧洲，也形成了欧元区 24 Development: Cause of the Wealth and Poverty of Nations 国家的发展速度并不相同，世界上多数人是贫穷的 国家要发展经济既要解决国内的利益和制度阻碍，又要解决国际的利益冲突 对国内来说，小部分人为了自身利益会损害整体利益。这种特点在自然资源丰富的国家更突出，国家只需服务于掌握了资源的小部分人就可以 这一点作者以美国南部和南美国家的经济为例 殖民对被殖民地的好坏取决于地区是否适宜居住 - 热带疾病肆虐的地区，政策为掠夺资源 - 适宜居住的地区，殖民者定居并指定促进经济的政策 - 虽然殖民者与被殖民者有共同利益，但当利益冲突时殖民者优先 发展中国家 发展中国家出口的都是粗加工产品，因此竞争激烈，价格低，不如发达国家的产品利润高 国际贸易规则偏向于发达国家，发达国家也会补贴本国农民 发展中国家影响国际规则的例子是 OPEC 发展中国家由二战后的自给自足转向出口和开放，然而对外开放会受到金融危机的影响，因此近年来出现发对者 是否应该给予发展中国家援助 支持者认为，尤其在医疗方面已经有了改善 反对者认为，只有改变国家政策才行，否则都让当权者挥霍了 25 International Law and Norms 国家主权原则，国际法需国家自愿同意 国际法分为首要规则和次要规则，次要规则类似于宪法，首要规则需要与次要规则一致 国际法来源于 习俗、已采纳的实践 国际条约 国际法分成硬性规定和软性建议两种 对国际法作用怀疑的人认为国家只不过选择了符合自己利益的法律，法律并不会改变国家的行为 国际法是自助的形式，但确实让国家间协商更容易了 国际道德准则同样制约国家，如不使用核武器，尽管对手无能力反击，国家也不会首先考虑用核武器解决争端 作者讨论了发达国家抵制童工商品，但同时并没有给予这些家庭金钱援助，从而使这些人过得更不好，比如转入底下工厂或卖淫 TAN（跨国宣传网络）通过让新的标准与普世的道德联系起来从而获得更多人支持。少量道德标准最后会成为人们习以为常的事，比如不吃人肉 本国政府禁止 NGO 参与政治时，NGO 可以联系其它民主国家 NGO，通过民主国家的政府或国际组织像本国政府施压 26 Human Rights 西方主导的 ICCPR ，提倡言论自由、法律面前平等、宗教自由 共产国家主导的 ICESCR，提倡同工同酬、免费教育、版权保护、机会平等 国家会提倡自己施行的制度或者对于对手难以施行的制度，人权与道德不同还没有被普遍认同 亚洲价值观从新加坡、马来西亚提出到最近的中国，都与西方人权内容中的优先级不同 国家为何违反人权 政府无能力阻止侵犯人权 为了国家安全 为了维持统治 为何有的国家签署人权协议 新建立的民主政权巩固国内的政治改革 获得其它民主国家的援助 既有同情、价值观的利他原因，又有稳定其他国家避免影响到自身的利己原因 有要求贸易伙伴符合人权为了保护国内市场，因为协议更难达成了 统计上看人权从 1980 年后有了改善 人权协议短期影响有限，国际难以惩罚政府，但能带来长期影响 能让其它国家惩罚人权违反者的因素包括 国内民众压力 与其它国家利益相关联，比如是敌对国家 不会被人指责干涉他国主权 27 The Global Environment 按照商品能否排他（让别人无法获得）、获得后是否竞争（我获得了你就没有了）分成 4 种商品 为了避免囚徒困境，有两种方式，转为私有财产，或使用法律监管 促成公共商品的合作有 5 种因素 角色少 问题不复杂，清晰定义 角色间有互惠利益关联 公共商品与私有商品绑定 解决公共商品问题对一少部分角色有很大好处 通过拍卖碳排放点数的方式，让最难减排的购买，让容易减排的选择替代方案 外部性 externality 导致一方的受益会让另一方损失，即损失和受益不是同一方承担 发达国家想让发展中国家承担同样的减排量，发展中国家认为应以国家发展情况制定目标 为了是代表未来的自己和现在的自己协商，因此经常是现在的自己赢也就不奇怪了 国际环保组织的作用：设立要达成的目标、提供最新科研结果。TAN 帮助监督其它国家的合规情况 28 Challenges to the Global Order 二战后美国的主导地位接受中国的挑战，一些国家如朝鲜和伊朗对美国抱有敌意 全球化的进口和移民导致一些人的利益受损，或一些人讨厌外来文化 达到互相的核威慑需要 二次核打击，即在对方先用核武器后仍然有反击能力 领导人是理性的，顾及自己国民的性命 遭受打击后能确定核武器的使用者 既然有核威慑，为何还要阻止核武器扩散呢 新拥有核武的国家会改变利益格局 国内政局动荡，无法保护核武不被偷或意外发射 可能卖给恐怖分子，或者被恐怖分子偷 如何阻止核扩散 阻止恐怖分子接触核武 有核国家（如美国）承诺保护无核国家 核不扩散条约（在没有五常国家反对制裁的情况下有效） 最后手段是武力胁迫，但要让对方相信解除核武后不会被更快消灭 新兴国家中国挑战旧的领导国美国时，旧国会想将对手消灭在萌芽中，新国会不断要求改变现有利益分配。然而从历史看这种情况未必一定导致战争 新旧两国是否有战争取决于战争好处相对于战争成本的大小 当战争成本高时，在新兴国家的发展前与发展后两者的 bargain range 有重叠，即旧国家不会挑起预防性（防止新兴国家崛起）战争，具体见书 P612 发展起来的德国和日本没有与美国产生冲突，因为冷战中共同的威胁、经济往来、民主价值观 认为中美会开战的原因 美国阻止中国获得领土，如台湾和领海 中国的经济和政治与美国主导的国际体系不兼容 认为中美不会开战的原因 中美之间的经济往来 新兴的中产会推动政治民主 美国 遏制方式，经济制裁，军事与中国邻国结盟 鼓励方式，增加中国在现有国际框架中的好处，让其不愿放弃现有制度 全球化 跨国公司、资本家推动全球化 全球化让国家中丰富的生产要素（资本、劳动力、徒弟）获益，让稀有的生产要素损失 因此发达国家尤其是低技能工人受损，要与发展中国家的工人竞争，而这些国家的工资低、劳动保障不全面 但如果重新分布收益，补偿受损的群体，总体来看自由贸易是获益的","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/Politics/"},{"title":"锻炼","text":"","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E9%94%BB%E7%82%BC/"},{"title":"食物","text":"各国居民膳食营养素参考摄入量查询 asset 中 “美国居民膳食指南（2020-2025）”的中英文 pdf","link":"/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/%E9%A3%9F%E7%89%A9/"},{"title":"Socical Psychology","text":"Introducing Social Psychology 人所处环境如何影响自身 我们看到的现实都是经过自身的解读的 提到了快思慢想，行为多数是自动化的 通过后见之明解释社会心理学的结论其实并不是显而易见的常识 两种研究方法 相关性研究 优点是来源于现实 缺点是不能得出因果，X、Y 相关有 3 种可能，X-&gt;Y, Y-&gt;X, Z-&gt;X/Y，即因果反向和第 3 个变量导致了 X、Y 实验研究 优点是能得出因果结论 缺点是有些情况无法做实验，如道德问题 The Self in a Social World 我们会夸大人们对自己的关注程度 通过和别人比较以及别人的评价来形成自己的身份 identity 集体主义文化下，自我是随着相处的人而不同的，个人主义则将自我看作独立不变的个体 高自尊未必有好处，作者认为自控力更重要。自恋则是高自尊同时不关心他人，负面的性格 人习惯将好的结果归于自己，将不好的结果归于别人。因此预测别人比预测自己更客观 Social Beliefs and Judgments 思考分成自动化和控制的，自动化的部分人是无法意识到的 将随机当因果的错误，如快思慢想中的均值回归 在归因时会夸大个人的影响而忽略环境影响 当观察他人时，他人在中心，所以会归因于个人，当观察自己时，环境在中心 人持有的信念会作用于现实，变成 self- fulfilling 自我实现。比如爱情中的幻想，会让感情更好 Behavior and Attitudes 系统 2 对应口头阐述，系统 1 对应直觉判断，两者结合能准确预测人的行为 何时能说到做到 环境影响少 阐述具体（目标具体） 形成习惯 当我们处于某个环境，扮演某个角色时，会反过来影响我们自身的态度（假戏真做？） 当破例一次，突破道德底线一次，就会越来越多 适当的限制，同时给个人保留选择能力，会将其归因于自我选择 外部激励，如金钱，反而降低了内在动力 两种解释 当态度与行为冲突时，人会改变态度 当态度较弱时，人会作为第三方观察者，来通过行为推断出态度 最后作者建议，当没有思路时，不妨先做一下，用行为促进思考 Genes, Culture, and Gender 从生物进化角度 寻找配偶时，男人考虑繁殖力相关的身体特点，女人考虑资源。共同点是都会考虑善良、爱、互相吸引 同伴对青少年比家庭影响大很多 男女大部分是相同的，差异部分与社会普遍印象类似 男人对性更随意，因此通常是男性付钱给女性换取性 基因与环境共同决定表现 Conformity and Obedience 服从分为自愿和强迫两种 Milgram 电击实验，造成服从的原因 从小的错误逐渐扩大 做法符合社会规范 可不为结果负责 时间有限 何种情况下会容易服从 与受害者距离远，受害者被去人性化 权威人物在场 但如果有人挑战权威，则可能会引起其他人跟随 权威机构 小的错误逐渐积累，作者举例，比如写论文时，每一次分心最终累积成大的错误 服从的人数多时 做出过公开承诺 为何会服从 normative influence. 为了被人喜欢 informational influence. 为了选择正确，自己不确定，参考其他人的意见 用自己的话阐述反对者的观点，来帮助自己换位思考 聪明的家长不会命令孩子，而是给出有限的选择 Persuasion 说服分两种，一种是经过思考的，另一种是通过暗示触发自动模式 经过思考的说服，持续时间更久 说服的构成要素 谁说了什么，通过何种方式，说给谁 怎样更容易说服别人 人的选择 用被说服者信赖、喜欢、与其相似的人 隐藏说服的目的 内容的选择 诉诸情感还是说理，取决于被说服对象喜欢哪种 利用对后果的恐惧，如吸烟的后果图片 循序渐进，从小要求开始 先要求高，然后再提出低要求容易被接受 提供两面观点从而让论点更可信 第一个说还是最后一个说 如果消息是连续的，那么第一个呈现效果好 如果消息间隔时间长，那么前面的都忘得差不多了，最后一个效果好 呈现方式 有互动的比被动的号 媒体通过间接方式影响公众，媒体到专家、意见领袖再到公众 视频生动的方式更容易被接受，但不适合表达复杂内容，且受众无法像文字一样控制速度和进度 通过不断的挑战已有观点来强化它 Group Influence 他人在场时，简单任务会做得更好，复杂任务更差，因为唤醒 aroused 为何会唤醒 在意他人的评价 在意评价引起分心 如个体的表现无法在集体中体现，那么反而不如单独做表现好，如拔河（个人认为是吃大锅饭的意思，free riders） 加入群体会更多加剧群体已有的倾向，失去自我 成员多样的群体更有创造力，尽管不同观点会造成成员的不适 Prejudice 偏见分为显式和隐式的，隐式是系统 1 的 能力和可爱/温暖不能共存，不同情况下，人们会展现不同的一面 当周围人没有偏见时，也会影响自己 为何会有偏见（动机角度） 发泄其它原因的不满 获得归属感 感到威胁时会增加对另一群体的偏见，而感到安全时偏见减少 偏见可以是潜意识的，但只要愿意可以消除 为何会有偏见（认知角度） 为了快速判断，对自己熟悉的群体，会看到多样的个体，而不熟悉的则使用 stereotype Aggression 侵犯分为物理的和社会的（感受、地位），目的分为表达情感或达成某个目的 侵犯来自于受挫、环境、身体状况 受挫尤其是看到别人有而自己得不到的情况，网络和电视加大了这种影响 arousal 唤起后，不同的解读会有不同反应，解读成药物作用则实验对象不会有反应 枪支、暴力视频、暴力游戏、包含强奸的色情会增加青少年、成年的攻击性 游戏既可培养协作、用于教育，也可增加暴力 在游戏或现实中发泄愤怒，只会让自己更愤怒 作者认为多数犯罪为冲动杀人，因此死刑不会带来犯罪减少，而提前预防可以 Attraction and Intimacy to belong, to feel autonomy and competence. Happiness is feeling connected, free and capable 熟悉创造喜欢，外貌影响第一印象 漂亮的人在社交上更自信，但其它性格上没有差异 进化角度，女人需要资源，男人需要年轻、代表生育能力的女性。男女都喜欢善良、智慧 相似创造喜欢，不是差异 负面信息比好消息影响更大 喜欢是相互的，喜欢喜欢自己的人 爱情 3 要素 intimacy 亲密感 passion 毒品上瘾 commitment arousal + label = emotion，不同解读、归因导致不同的情感 长期的关系，从激情消退到朋友式的陪伴 积极互动与消极互动至少 5 比 1 婚姻才能长期维持 Helping 为何帮助别人 为了去掉坏心情，拥有好心情 互相帮助 社会责任 从生物角度解释助人现象，会被指责后见之明，只有预测了未来，变成可证伪，才有意义 旁人越多，导致帮助他人更少。因为 难发现有人要帮助 不容易被认为需要帮助 不容易认为是自己的责任，等其他人帮忙 何时更容易帮忙 其他人帮忙时 与自己相似时 有空闲时间时 个人自身特点也影响是否愿意帮忙 远离群众的富人确实更可能冷漠 信宗教的人更愿意帮忙 把他人当作 ingroup 是自己团体的成员，如相信都是上帝的子民 Conflict and Peacemaking 每个人追求自身利益，让整体更差，如囚徒困境，让整体更好，如自由市场经济 归因错误：提到自己时，认为是受外部环境影响，提到别人时，认为是他们自身性格等内部影响 为了解决这种困境 监管。改变激励，让合作有利可图 让团体规模小，沟通更顺畅 宣传利他道德标准 解决冲突的方式，4 个 C，contact, cooperation, communication, conciliation 跨种族不愿交流是害怕被拒绝 威胁、共同的目标加强了内部的团结 共同的目标失败了反而互相指责，破坏团结 作者提倡的是多样化的群体同时有共同的内核，在个人和集体主义中取得平衡 有第三方调停，可以让双方有面子的让步，将 win-lose 化解为 win-win 局面 让双方只陈述事实和自己的感受，使用我开头，而不用你 让另一方用自己的话复述对方的观点 降低对峙，通过双方逐步降低敌意开始，但保留反击能力 Social Psychology in the Clinic 对方比自己更容易发现自己思考中的错误 反驳自己，思考论点的反面，来避免错误 统计数据比临床医生的判断更准确 看事情比现实情况乐观似乎有利于心理健康，但轻度抑郁更能停下来思考，不自大 当害羞的人将紧张感归因于其它方面时，开始变得健谈 如果不能直接使用意志力改变感受，那么可以通过改变行为来影响 不强迫，让人有选择，这样人们会将行为归因为自己做成了 通过向朋友倾诉，甚至书写的方式向自己倾诉，都可以治愈内心 贫穷，同时与周围相比的贫穷，社会财富分配不均，更影响健康 财富不能保证幸福，利用好时间，行动积极会带来心态的变化，帮助别人可以让自己更幸福 Social Psychology in Court 证人会受到审问方式的影响 指认证人时，相比较的人要相似，而且应当一个一个比较，而非并列比较 被告的外貌、种族等会影响法官和陪审员 陪审员讨论时，相似想法的人会产生极化，但如既有主张定罪又有主张无罪的，则变得温和 科学研究并非没有价值取向，不受偏见影响 Social Psychology and the Sustainable Future 全球变暖会加剧人们直接的冲突，有对人的直接影响，也有粮食产量下降、可居住地变少等间接影响 人们不相信气候变暖，因为 认为科学没定论 不想承担责任、改变现状 对个人来说金钱与幸福成边际递减关系，对国家来说，经济发展带来的物质变化并没有增加人民的幸福感 关注内部的感受，有意义的工作、亲密关系、给予他人帮助，比关注外部更幸福 人们会适应外部的新体验，adaptation-level 习以为然 与更优秀的人对比，social comparison 为应对上面这两点，除了关注内部感受外，还可以 让社会收入更平均，缩小贫富差距 与更不幸的人比较，珍惜拥有的 缩减物质欲望","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/Socical%20Psychology/"},{"title":"The Headspace Guide","text":"Introduction 作者的冥想练习源于想控制自己混乱的思绪、情绪 冥想分 3 步，如何接近、练习冥想、并整合到生活中 approach, practice, integrate 作者强调读书是不够的，只有停止阅读，开始练习、亲自体验 正念，不评判的关注当下 冥想是达成正念的手段之一，在其他情景中也可以做到正念 但即使已经熟练应用正念了，仍会愿意每天冥想，作者将此比喻成即使熟练的司机也会慢下来欣赏路边风景 从少量时间（10min）开始练习冥想，注重质量，而非数量 人生中一些情况无能为力，但思维决定了内心感受，通过改变思维来改变看世界的方式 The Approach 在路旁看着车流，追逐好看的车，而逃避不好的车。但逐渐会不再追车，不陷入思绪当中 如同蓝天，有时会被乌云遮住，但只要等就能看到晴天 也比喻成驯服野马，逐渐收紧缰绳，给予耐心 对于好的感觉，想象与他人分享。对于不好的感觉，想象是他人的痛苦，给予陪伴 冥想不能去除不好的感觉，但更多的觉察会让这种感觉减弱，以及更好的处理这种感觉（个：即通过冥想意识到问题的本质和自己的处理方式） 保持好奇的去觉察，每次的感觉都是独特的。欣赏过程的风景，而非只顾终点 The Practice 冥想通常分两部分，集中冷静部分、清楚洞察部分 (concentration calm, clarity insight) 冥想需要专注在某一个内容上，可以是外部的声音、内部的身体感觉，这样就不会有其它想法 过程 先花 5 分钟检查后面冥想可能会陷入的事件 30 秒感受呼吸和身体 数呼吸到 10，呼和吸都计数 最后 10-20 秒放飞思想 正念应用到站立、走路、躺着的状态，形成日常生活中的习惯 思想既不松也不紧，就是最好的状态 正念练习让我们关注身边人，避免冲动应对 吃的练习，包括不喜欢的食物 用于帮助入睡时，不要关注在睡眠上，而是其它感觉上 不论心情好坏，每天的习惯都尽量完成 记录下每次冥想后的感受，帮助自己看到成效","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/The%20Headspace%20Guide/"},{"title":"如何阅读一本书","text":"学习阶段 阅读阶段 阅读具体怎么做 是什么？ 检视阅读 获得书的主题、结构、关键词、关键段落封面、序言、目录、索引，关键词、关键段落 为何这样？ 分析阅读 1. 总结作者观点（事实、逻辑、举例），为何这样写2. 检验是否理解有两种方法，用自己的话叙述、用例子阐明3. 检验后 - 对不理解的进行记录，尝试理解后再找参考资料 - 对理解的进行评论，评判时要具体指出问题 与其它方式对比 主题阅读 通过 检视阅读 建立起主题、找到相关书籍、确定书籍的框架以自己为中心，确立一套术语、框架、形成问题与答案集 我怎样做，创造 这部分我认为是写作而非阅读了 1 序言为什么需要新版？ 老问题仍然存在，小学后缺少阅读教育 增加新观点，提出不同层次的阅读方法 2 The Dimensions of Reading2.1 THE ACTIVITY AND ART OF READING 越多的事实反而会阻碍理解 媒体打包好的观点没有帮助读者思考 理解程度取决于 1. 读者投入精力 2. 读者的阅读技巧 只有最开始不理解的书，才能增加自己的理解，否则只是获取了信息 读书类似于无老师的指导式学习（与探索式学习区分），要自己找到解决疑问的方向 2.2 THE LEVELS OF READING高级别包含低级 基础阅读（elementary reading），这个句子在说什么？ 检视阅读（inspectional reading），1 小时内，读表面，解决简单问题，书的结构、关于什么的 分析阅读（analytical reading）,掌握书的全部内容，用于增加理解 主题阅读（syntopical reading），读同一主题的多本书，形成对主题的分析 2.3 THE FIRST LEVEL OF READING: ELEMENTARY READING阅读的四个阶段，有老师存在 身体、智力的准备 读简单读物，掌握 300 单词 增加单词量，学会不同领域的阅读 对概念的迁移运用，比较同一主题不同作者的观点，一生持续下去 高层的阅读经常被忽视 2.4 THE SECOND LEVEL OF READING: INSPECTIONAL READING当作寻找线索的侦探游戏 有系统的跳读 决定是否深入阅读 获得书的表层内容，结构 封面、序言、目录、索引、宣传封套 引用索引中的关键词（你认为重要的词）的段落，关键章节中的总结段（开头、结尾）、其它章节的总结段落 粗浅阅读 跳过不懂的地方，尤其是读困难的书时 阅读速度 几分钟到一小时 不同的内容用不同的速度读，很多书跳读都不值得，一些书中的关键部分需要慢读（在分析阅读时），以独立宣言前部分为例 集中注意力是前提，接下来便是理解阻碍了阅读的速度，也是本书的写作主旨，而非速读课上仅提高基础阅读的速度 2.5 HOW TO BE A DEMANDING READER书中标记，保持清醒，方便日后回看 序号标明作者观点，总结作者观点 引用书中其它观点 带着问题阅读 这本书的主题是什么？使用怎样的架构论述的？ 这本书的细节讲了什么？ 哪些说的是有道理的？ 为什么作者要讲这些？这本书对你来说有意义吗？ 形成三种笔记 问题 1、2 用于检视阅读，形成结构笔记 问题 3、4 用于分析阅读，形成概念笔记 主题阅读，引用多本书，形成辩证笔记 为何要这么麻烦？ 已经会阅读了，为什么还要用这么多复杂的规则？作者用已经会走路的人学习滑雪的过程类比 每个规则分别练习，熟练后，就会 From Many Rules to One Habit 3 The Third Level of Reading: Analytical Reading3.1 PIGEONHOLING A BOOK 仔细阅读标题和序言，传达了信息 给书分类前，要清楚每个分类是什么 理论书籍告诉是什么，实践书籍告诉如何做，应该怎样做（道德、政治相关） 也会有书不好分类，继续阅读主干内容 分不清是哲学还是科学时，如果是日常经验是哲学，实验室经验是科学 3.2 X-RAYING A BOOK阶段一，回答问题 1 对书分类 使用一段话概括这本书的主题，有些书中会总结好 列出书中重要部分，这些部分如何组成整体的，逐级细分。因为书的质量不同，每本书投入的精力是不同的。书中的目录划分作为参考，但也可以不按照作者的方式。第 2 点和第 3 点是相互的 找出作者的意图 阶段二，回答问题 2 找出关键词（让自己困惑、作者特别强调的词），上下文确定含义 找出作者的结论、观点，支持该观点的证据 将观点组合成论点，可能在多个段落中。清楚作者的前提假设是什么 作者要解决的问题是什么？哪些问题没有被解决？ 规则只适用于非虚构类书 不论是找词还是找句子、段落，首先标明位置，这是语法层面，接下来阐释含义，这是逻辑层面 同一个语法元素（单词、句子、段落）可能表达不同含义，不同的元素可能表达同一含义，语法和逻辑层面是多对多的关系 检验是否理解有两种方法，用自己的话叙述、用例子阐明，否则只是停留在语法层面的文字游戏 3.3 CRITICIZING A BOOK FAIRLY阶段三，回答问题 3、4 充分了解是进行认同、不认同、无法评价的前提 读懂前，不给出是否认同、无法判断的结论。同样，没理解就进行的评论可忽略 理性评论，不发泄情绪 区分知识和个人观点，评价有依据 3.4 AGREEING OR DISAGREEING WITH AN AUTHOR不认同的四种情况，不互斥 这些错误只有与书中结论有关时才有意义 知识不充足。达尔文缺少基因遗传学知识 知识错误 推论不合逻辑 分析不完整。具体指出 阶段三完成，不同的书的投入是不同的 3.5 AIDS TO READING读完并尝试理解前，不去参考，防止影响自己的观点 参考的前提是，知道自己的问题是什么，如何找答案 相关经验 其它的书。历史书、哲学书是相关联的 导论与摘要 工具书，字典和百科 4 Approaches to Different Kinds of Reading Matter4.1 HOW TO READ PRACTICAL BOOKS阅读时带着问题读，判断是否书能帮助自己达成想要的目标，主动型 非虚构类型(expository) 理论类。与作者无关 实践类，多数实践类阐述原则，具体规则由读者推断。与作者的背景有关 规则的变化 两个阶段的第 4 个问题都是与你有关，试图说服你 4.2 HOW TO READ IMAGINATIVE LITERATURE想象文学比 expository 书难，只读表面简单，但这里需要批判式阅读。被取悦与被教育相比更容易，当知道为什么被取悦就更困难。感觉到美容易，分析为什么美更困难。 不要做的 想象文学传达的是一种体验，不要抵抗这种影响，允许被感动 不要再找共识、论述 故事设定的合理来作为评判标准，不使用真实性 expository 评论现有的体验，而想象文学提供新的体验。expository 教导我们，想象类的书需要我们自己从体验中学习 structural interpretive critical structural 分类 诗、小说、戏剧。用一句话总结情节。了解每部分的情节，expository 的章节更独立，而想象类关联性更强 interpretive ，term 对应 事件和人物，需要熟悉。propositon 对应背景、虚构的世界。argument 对应情节 critical 不要对背景设定做出批评，可以批评这样设定后的内容。不喜欢和喜欢要说出为什么，指出书中对应的内容 4.3 SUGGESTIONS FOR READING STORIES, PLAYS, AND POEMS 故事书一次读完，在理解之前不要否定。书像生活一样，经历之后，向后看才能明白 故事书，要区分这种喜爱是只满足了个人的需求，还是通用的所有人的需求，作者认为后者算伟大的作品 史诗。作者鼓励尝试 戏剧，在阅读最后要尝试想象出演员的表演。大声带感情读出能够帮助理解 悲剧剧本很多不完整，不值得读，少数可以 诗歌，1. 读一遍不论是否理解 2. 再读一遍，大声读，帮助找到节奏。至少能够提出问题了 4.4 HOW TO READ HISTORY 历史更接近小说而非科学 历史学家总是会有自己的立场，提出自己认为的事件原因，然而事实往往复杂。所以同一段历史要从多个角度来看 了解事实并非读历史的唯一原因，人们尤其是政客会以史为鉴 提问 讲的是哪部分历史？哪部分不会讲？ 是用哪种方式讲述的？章节是如何划分的 批判有两种方式，但都以理解了内容为前提 叙述不真实，即便提供了来源，比如没有缺点的英雄 没有充分收集资料 与自己的关系？以史为鉴，避免犯错 传记相当于历史 definitive 传记更全面，更值得信赖 authorized 传记，由朋友或自己来写的，要注意偏见。但也可以了解那个时代哪些事情是被接受的 一些传记是用来教导人的，获得启示 自传也并非新的类别。广泛来说，我们可以通过任何人的作品来了解作者，即便这里面有掩饰的成分 How to Read About Current Events 阅读当代作品要注意作者或者其消息来源包含了利益关系 作者想要证明什么 想要说服谁 假设读者具备怎样的知识 使用了哪些知识 作者真正了解他谈论的话题吗 A Note on Digests 信息类内容是可以精简的 对精简人的特质要了解，避免被误导 即使精简了也要做好自己这部分 4.5 HOW TO READ SCIENCE AND MATHEMATICS 读科学经典不是为了掌握现代领域知识，而是理解科学的历史和哲学 科学作品不是没有偏见，而是将前提假设明确说出 科学与科学术语的发展是相辅相成的 科学作品两个难点 从现象进行归纳，需要亲自实践才能理解，做实验 数学 科学书籍中的数学 读第一遍避免陷入细节 数学因为精确、清晰、限制范围而经常被科学书籍使用 科普书 避免了数学和实验，但与阅读报纸一样，需要了解筛选人 4.6 HOW TO READ PHILOSOPHY 读哲学时，像孩子般提出简单的问题，同时又可以深刻、成熟的思考 要注意，一些科学问题不属于哲学问题，因为作者写作时科学还没有发展到那个程度 第一类 理论性问题 形而上学，存在问题 自然哲学，变化问题 认知论，关于知识的问题 实践性问题，规范 伦理学，善、恶，幸福和人生目标 政治哲学，良好的社会，个体与群体间关系的 第二类认为第一类问题无法解决，从而研究解决第一类问题时涉及的 需要用到的知识 回答时思考的内容 表达时使用的语言这类问题狭窄，只限于专家研究 哲学风格 对话。柏拉图、苏克拉底。难写 论文。亚里士多德、康德。常见 反对意见讨论。阿奎那。较少 数学形式。笛卡尔、斯宾诺莎。难读、难写 警句形式。尼采。缺少解释 阅读哲学的提示 问题可能是隐含的 回答问题的原则也可能是隐含的 要注意，哲学术语来自于平时对话，但含义是不同的 隐含原则举例 柏拉图，conversation about philosophical subjects is perhaps the most important of all human activities 亚里士多德，happiness is the whole of the good, not the highest good 康德，Kant, is a critical survey and assessment of the mind’s resources and powers 与科学问题不同，在阅读了不同的哲学书籍后，哲学问题是可以形成你自己的想法的 神学 自然神学 教义神学。困难在于对于没有信仰的人要暂时接受某个前提才能理解书的内容 4.7 HOW TO READ SOCIAL SCIENCE社会科学包括 人类学、经济学、政治学、社会学 大部分法律、教育、公共行政 一部分商业、社会服务 大量的心理学 困难的地方 社会科学的书籍经常是多种类型混合，因此回答这是一本什么样的书是一个难点 术语没有统一，coming to term 没有权威、更新的快，导致社会科学领域更需要主题阅读 5 The Ultimate Goals of Reading5.1 SYNTOPICAL READING问题：对主题的了解是随着阅读的增多形成的，即开始时存在悖论（没有阅读就不知道主题，没有主题就不知道怎样找相关的书） 解决方法：主题阅读开始前，通过检视阅读 去掉无关书籍 了解相关书籍的概要 了解主题是什么 主题阅读的 5 步，与分析阅读的区别是以你为中心 找出书中相关的内容 创造一套通用术语，将其它书的术语进行翻译 形成问题和答案 对问题和答案归类整理 对应分析阅读的问题 3、4，指出这样分类的原因 做到客观，理想状况是 look at all sides and to take no sides Syntopicon 书可以提供与主题相关的书单，对阅读起到发起、建议和指导的作用 5.1.1 以“进步”举例 不使用非虚构书籍，因为小说、戏剧、诗歌观点模糊 形成自己的术语，我们研究对人类有益的这种进步，当其它书中将”进步“这个词来指代其它内容的时候，我们对其总结时不再使用”进步“来避免歧义 明确问题。历史中存在进步吗？三种回答 是、否、无从知晓 对于回答是的还有 3 个争论 进步是必要的还是伴随其它事件发生的？ 进步是否有尽头？ 进步是由人类的动物本能还是外部环境产生的？ 对于回答是的还有 6 个子问题知识进步、科技进步、经济进步、政治进步、道德进步、艺术进步 5.2 READING AND THE GROWTH OF THE MIND 只阅读能力范围内的书是没有进步的 主动的方式帮助成长，被动的外部激励（娱乐和信息），作者将其比作越来越依赖的毒品","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/%E5%A6%82%E4%BD%95%E9%98%85%E8%AF%BB%E4%B8%80%E6%9C%AC%E4%B9%A6/"},{"title":"亲密关系","text":"有趣的、全面的、贴近生活的教科书 增加了关键词和应用到生活中的建议 考虑到同性恋、多人关系、变性等关系 从科学层面解读亲密关系 1 The Building Blocks of Relationships 什么是 分享私密内容 互相影响 关心、信任、理解自己、支持自己 承诺 但随着时间，亲密程度会变化 为何需要 亲密关系是对归属感的需求，归属感无法得到满足会影响健康 当我们有了几个亲密关系后，就会失去寻找下一个动力，直到关系结束再次开始寻找 文化影响 不结婚、晚婚、未婚同居、未婚生子增加，更少的人认为婚姻会维持终身 婚前同居进行测试，但没有结婚计划的人，反而降低了之后结婚的概率 影响的来源 经济和教育，允许更多单身的人 西方的个人主义，物质主义，更少关心他人，对从伴侣中获得满足感有更高的要求 避孕措施的发展 社交软件导致人们花更多时间在陌生社交上 高性别比例（男性多）导致更传统的婚姻方式，低性别比例导致女性解放 经验影响，attachment styles，根据是否渴望亲密、是否害怕分开分 4 种，FIGURE 1.5 secure 能从关系中获得安全感 preoccupied, anxious- ambivalent 依赖他人肯定 avoidant 逃避 Fearful 害怕别人拒绝 dismissing 自给自足，不在乎别人看法 注意 4 种不是离散的，是连续的，每个人的程度有所不同，不要贴标签 并且依赖类型来自于经验，是可以被改变的 不稳定的童年，会让人更早有性行为、更多的伴侣 个体差异 sex differences，先天，生理上：男女基本相同，差异总体上是很小的，甚至比不过（男性或女性）群体的内部差异 gender differences，后天，社会文化和家庭环境。但是后天会受到先天的影响，男女行为上的差异是习得的 男性 instrumentality 女性 expressiveness 35% 两种性别特征 androgynous 都有，15% 有另一种性别特征 + 两种都缺少 1% 是 trans，但人数并不少了 androgynous 的两个人比起传统的男女更好相处，因为共同点更多 对两性的刻板印象损害人们的全面发展，作者认为两种性别特征都应该有 个性 Big Five traits，与其它影响相比更稳定长久。情绪稳定、责任感、考虑周到，比起外向、爱冒险，对长期关系来说更重要 自尊，衡量社交关系，社交关系好，高自尊，被拒绝，低自尊 高自尊，会依赖他人，不怕被伤害，低自尊会陷入恶性循环 性取向，连续的，如有的人并非绝对的异性恋。异性恋 – 双性恋 — 同性恋 这样的范围 百分比 男/女，异性恋 90/91，双性恋 7/5，同性恋 5/2 gay 更 expressive，lesbian 更 instrumental，更自由、受教育程度更高 人类天性，动物层面 生殖，社交好的有更多的后代 男女在生物上投入的时间不同，因此采用不同的伴侣选择策略。女慎重选择，男广泛播种 短期关系上，男女一致，长期关系上女性更看重财力，而男性仍是看重外表 互动，同时也包含了不好的部分 2 Research Methods 提出问题，分两种情况 描述一个新的现象 找出其中的因果关系 获得参与者 对于不同群体差别不大的内容，选取大学志愿者就可以 否则要选取研究群体的采样 同意实验的志愿者可能拥有某些共同的特点，导致实验结果无法反映其它群体的情况，即 volunteer bias 选择设计 关联。关联不等于因果，反向因果，第三变量影响两者 实验。控制唯一变量（其它变量一致或随机）从而得出因果关系，但有些内容无法做实验 数据来源 人们的自述，好获得，可了解内心想法，缺点 可能会对问题理解有偏差 对自己的行为没觉察到 为了自己的形象，而撒谎。网上匿名要好一些 观察，为了不让观察影响结果，可让被观察者不知情 生理反应 过去的资料 道德影响 解读结果 结果适用于多数人，但不绝对 关系中二人的结果是互相影响的，不是统计学独立的 3 Attraction 吸引力基础 直接 间接 instrumentality，帮助自己得到想要的 喜欢距离近的 频繁联系 但距离近也会让不合的人更讨厌 远距离恋爱，对于愿意信守诺言的两人来说并非阻碍，而重聚才是 如同线上网友见面，理想的形象消失，现实中的缺点暴露 线上交流变得普遍，然而并没有让人们更容易在一起，因为结果是难以预测的 喜欢好看的，第一印象，认为好看的人性格也好 总体上人们（甚至包括婴儿）对美有一致的标准，只是个体间存在细微差异 相貌每个特点都恰到好处，脸部对称，体重不胖不瘦，就是公认的美 女性胸部的影响没有身材大 男性只有在有钱的前提下，好的身材才会对女性产生吸引力 好看的人气味也好闻 喜欢那些喜欢自己的人 A Potential Partner’s Desirability = His/Her Physical Attractiveness X His/Her Probability of Accepting You 自己的 mate value 更高的人，要求也高，他们想要所有优点集于一身 perfect 的人 搭讪方式，建议男性不用选择轻浮的笑话，普通打招呼或直接表明来意更好，而对女性搭讪来说，无论哪种方式男性都会接受，但最好的仍是直接表明来意 喜欢那些像自己的 相似的态度，相似的背景，但性格不必相似，性格中的稳定、随和、责任心更重要 不同会吸引是误解 相似是两人认为的相似，客观上看两人也有区别 逐渐才会真正了解一个人，按顺序从明显的特点开始 外貌、年龄 价值观 角色，在不同事情上的分工，如抚养孩子、家务 fatal attractions，人起初会被与自己性格相反的人吸引，但随着相处，优点变成了缺点 喜欢的人可拥有自己想要的特质，但不能让两人差距太大，太大会感到自卑 常见的模式，有钱男人和年轻女人，看起来差距大，实际上他们都为彼此提供了相似的价值，男：名望、金钱、才华；女：年龄、外貌都是价值 女性追求金钱，也可能来源于社会机会的不平等，事业越成功的女性对男性财富的要求越低 但平均来说，男女都看重温暖和忠诚，男性保证女性不太丑，女性保证男性有基本的经济实力，多数人都有所妥协，不会要求完美的伴侣 互补：需要帮助时，提供帮助；给与对方建议时，对方可以考虑；一人出想法，另一人给出计划 这种互补并非相反，相反的性格会给自己阻碍，相似的性格才会提供支持，两人拥有共同的目标，只是分工不同 4 Social Cognition 社会认知：评估自己和他人的过程，对一段关系的认知会影响到我们的行为 第一印象的影响很重要，但第一印象判断的原理是快速归类，往往是错误的 没有意识到自己是如何形成某个看法，是可能的 理想化，在了解事实的基础上，强度优点、忽视缺点，positive illusions，积极看待 归因 attributions，对他人的行为容易内部归因，实际应当考虑对方面临的外部环境因素，即设身处地从他人角度考虑，充分了解对方所想 好的伴侣把对方的好事内部归因，坏事外部归因，认为是偶然因素 这也和 Attachment Styles 有关，安全型会比较乐观的看待关系 错误的认知 不同意就表示不够爱我 不用我说，就应该理解我的心思 mindreading 他不会有什么改变，就是那样的人 每次性行为都应该完美 男人女人想法是不同的 好的关系不需要维护，只要在一起就会幸福 正确的方式是 growth beliefs，相信两人的关系会通过努力不断成长 自我实现的预言。因为预期导致的行为，从而实现了预期。预期 – 导致 –&gt; 行为 – 实现 –&gt; 预期 如认为对方是有趣的就积极相处，结果因为积极的模式，对方确实也变得主动、友善（这是否就是心理暗示的原理？） 两人相处也是会有良性循环和恶行循环 自我感知，受与他人关系的影响 self-enhancement，从他人的反馈中获得自我认同，“我真棒” self-verification，获得与自我信念相同的内容，“我是对的” 如果一个人认为自己是不好的 Negative self-concept，那么他希望伴侣也认为这是不好的，而非表扬 一些无意识的反应比自我报告更能预测伴侣关系的走向 印象管理 讨好，恐吓，装弱，装强 self-monitoring 两种类型 High self-monitors，不同人留下不同的印象，朋友多，但共同点少 Low self-monitors，每个人留下差不多的印象，朋友少，但都很相似 花更少的时间在亲密关系上管理形象 我们对对方了解多少 时间越久了解越多，但结婚后人们对对方兴趣下降，所以结婚很久还不如刚结婚了解彼此 外向的人容易被了解 有的人擅长解读他人，但这可通过练习或培训提高 5 Communication 非语言交流 面部表情 眼睛 肢体动作，不像面部表情可以跨文化 身体接触 社交距离 气味，人不同情绪会散发不同气味 女人更善于解读非语言内容。但在不好的婚姻中，双方交流投入的精力更少，形成恶性循环 语言交流 随时间，逐渐深入了解，互相自我披露，表达关心与兴趣 Attachment Styles，回避类型的人，更少披露自己的信息，也更容易误解他人；害怕抛弃的人，披露的太多太快 女人交流感受、人，男人交流非个人事物，异性间交流时没有差别 有女性参与的对话更多的披露自我，而男性间则不这样，因此一般男性更需要一个女性来披露自我 但这只对于传统男性，对于 assertive(Instrumentality) and warm(expressivity) 的雌雄同体男性不同 交流不畅 Miscommunication 不解决问题，谴责人品，说其它问题 不倾听对方的内容，按自己的理解，否认对方 打断，表达认同和确认内容是没问题的，但其它方式不利于倾听 争吵时保持冷静，使用 XYZ。When you do X in situation Y. I feel Z 给予反馈，说明听懂了。确认自己的理解。确认对方的情绪 无法冷静时，等一会再交流 6 Interdependency 社会交换 social exchange 结果 = 得 - 失，得失计算包括物质和情感 是否留在关系中取决于 你对关系的预期，满足感 = 结果 - 预期。满足感来源于比较，而非结果的绝对值 替代品是否比目前的更好，依赖程度 = 结果 - 替代（新的关系或单身）。即使目前关系不好，当没有更好的替代品时，人们也会留在关系中 两者联系，当满足于目前关系时，“替代”值会变小，因为更少考虑其他人（替代） 预期 CL comparison level，结果 Outcomes，替代 comparison level for alternatives (CLalt) 情况 结果 Out &gt; CL, Out &gt; CLalt 满意，稳定 Out &lt; CL, Out &gt; CLalt 不满意，稳定。类似不喜欢但不能换的工作 Out &gt; CL, Out &lt; CLalt 满意，不稳定。类似更好的工作机会 Out &lt; CL, Out &lt; CLalt 不满意，不稳定 更独立、有更多选择的人，更有 power，对另一半的影响越多 随着关系的进行，好的 Out 会提高 CL，从而满足感降低，也就是习惯了 积极与消极的比例至少 5/1 才能维持关系 获得快乐和避免痛苦是不相关的，因此可形成 4 种组合 快乐可以与痛苦并存 不痛苦不意味着会快乐 提供快乐的方式要比避免痛苦多，不断提升自己，才能给对方持续的新奇感 对伴侣有个现实的预期，不应过度理想。养育孩子一般会导致婚姻质量下降 Communal relationships 共同体关系，只是不斤斤计较，但仍然存在交换 Equitable Relationships，公平关系，每个人的收获 / 付出比例相等，比 Interdependence theory 更量化 公平原则在某些内容很适用，如家务和照顾孩子，在其它方面适用程度因人而异 Commitment 受到 5 方面影响 目前的满意程度 对以后的预期（发展前景？） 其它选择的质量 已投入规模 道德和环境影响 Commitment 让人 忠诚 牺牲自我 包容 7 Friendship 构成要素 喜欢、真实 自我披露、情感支持 与爱情区别 爱情具备吸引力，性欲，排他性 朋友的关系更随意，而爱情更强调忠诚 友情更少直接向对方表达感情 与爱情的共同点 尊敬 信任 分享喜悦 支持，物质、情感、物理拥抱、建议 降低压力、乐观生活 提供帮助时，要看对方需要，有时反而帮倒忙 考虑他的利益、重视他、倾听他、对他感兴趣 友情的差异 性别上，男性朋友间是共同的活动，女性朋友间是分享情感、自我披露 因为受到社会文化的影响，女性的朋友更多，男性则很少、甚至没有，很少袒露情感 男女之间的朋友，男性善于表达情感，女性愿意给出指导 男性比女性更愿意在朋友关系中发生性关系 男女之间可以是，朋友、炮友、朋友 + 炮友、朋友转向恋爱、从恋爱转为朋友 结婚后，男女之间的朋友更难发生，因为对方伴侣会认为是个威胁 自我的构建中，既有独立、自治，又有依赖他人的部分 某些方面，宠物比人类朋友更好 1 / 4 的美国人没有亲密朋友，平均下来算爱人在内，只有 2 人 害羞的人，害怕他人的拒绝，从而导致恶性循环 孤独是无法从现有的社交关系中获得满足 年轻人甚至更孤独，因为没有结婚 孤独对健康有不好的影响 2 / 3 男子主义男性依赖女性避免孤独，而表达型男性（雌雄同体）则不需要 孤独会引发社交中的怀疑，更少自我披露，因此导致恶行循环 花在社交媒体上过多时间，反而导致幸福感下降，就和手机视频上一样 对孤独状态的解读，乐观的心态也会影响孤独感受 8 Love 之前的爱情与婚姻无关，有柏拉图式的、有为了政治、经济的 现代的个人主义、经济独立 爱情的分类，友情的激情和承诺部分要少 爱情三角理论 亲密：信任、支持、温暖 激情：性渴望，其它强烈情感 承诺：为维持关系付出努力 只有亲密 = 友情，只有激情 = 迷恋陌生人，只有承诺 = 被安排的婚姻或没有了爱情的婚姻 亲密 + 激情 = 浪漫爱情 亲密 + 承诺 = 激情褪去的长期婚姻 激情 + 承诺 = 愚蠢的爱，不了解对方的闪婚 三者兼备 = 完美的爱，难以维持 生理学基础 激情和亲密属于不同的生理结构 当男性处在紧张、兴奋状态时，好看的女性会变得更有吸引力，不好看的也会更没有吸引力 爱情会美化对方，让人盲目 romantic love 亲密 + 激情 VS companionate love 亲密 + 承诺 companionate love 是更稳定的，类似朋友的状态，长期的婚姻是这种形态 companionate love 释放减轻压力的催产素 Compassionate Love 对另一半的无私的爱，不属于爱情三角理论 朋友类、欲望类、幻想类、玩类、务实类、无私类 两年后激情就减少到一半，为什么？ 现实摧毁幻想，无法理想化对方 新鲜、神秘、危险带来激情 个体有差异，但总体看激情是下降的 培养友情，用创意想出新鲜感 9 Sexuality 性与爱是关联的，尽管可以分离，性并不只是高潮那么简单 男人后悔没发生关系，女人相反，后悔发生了关系 性行为是否以爱为前提，每个人的看法不一样,Sociosexuality 结婚的男女都有一小部分的出轨比例，男 32% 女 21% Unrestricted Sociosexuality 更容易出轨 非一夫一妻 有纯性伴侣的交换，也有包含爱情的 不同人接收程度不同，restricted sociosexual、女性接受程度低 人可以同时爱多个人，但一般多个伴侣是主、从关系 有些人认为这种关系存在问题，但也有人在这种关系中更满足 性欲 普遍来看男性 &gt; 女性 异性夫妻间出现性欲不匹配 3 / 4 的大学生有过一夜情，很多不使用安全套 性满足 让人满足的条件 choose and control our own actions (that’s autonomy) to feel confident and capable (that’s competence) to establish close connections to others (relatedness) 大众媒体的很多宣传不靠谱，多数女性对男性的尺寸满意 性满足可以通过双方沟通协调来逐渐获得 性满足与情感关系是相互影响的 性胁迫 侵害方式从“言语”到“物理”，侵害内容从“抚摸”到“性交” 男性在物理上实施侵害更多 将男女之间的性视为一种比赛的人更容易实施侵害 10 Stresses and Strains 关系价值 别人看待这段关系的价值 别人重视自己时，感觉到的是接受，忽视时，感觉到的是拒绝 当自己感受到别人的重视程度低于自己的预期时，会感到受伤，尤其是因为自己能力不足时 受伤 从无所谓到拒绝这个程度带来的伤害区别很小，伤害最大的是从无所谓到完全接受的区别 这种被拒绝与物理伤害的感受相似，对乙酰氨基酚也能起到止痛效果 低自尊、害怕被抛弃（焦虑类型）受到更大的伤害 冷落，人们对被冷落非常敏感 嫉妒，复杂。痛苦、愤怒、恐惧 两种嫉妒，一种是基于事实的，另一种是怀疑和猜测 容易嫉妒的情况？可替代的人很少时、过于依赖，低自尊、自我价值感低时，自己能力不足时 保持一定的独立可以避免嫉妒 进化角度：男性的嫉妒用来防止孩子不是自己的，女性的嫉妒防止男性不再提供资源。因此男性看重肉体出轨，女性看重精神出轨 社交媒体 带来的拒绝感，不点赞、不回复 自己错过的他人的欢乐 对嫉妒的反应 男性倾向寻找新伴侣，女性倾向修复现有关系 出轨是常见的，54% 男 34% 女 欺骗 多数人一周说一次重要的谎言 谎言可以被用于表达礼貌、友好 当一个人说谎时，他也会怀疑对方说谎，认为别人与自己是相似的 没有通用检测出谎言的标志，包括是否慌乱，但可通过观察故事是否连贯、言行一致来判断 事先了解这个人，会发现说谎时的表现不符合通常样子 但由于亲密关系，导致人们通常信任，所以谎言不容易被侦测到 背叛 从亲密的人中受伤最深 与多个人维持关系时就会出现需求冲突 复仇不可取 复仇的力度不好掌握，容易过火 复仇不总是感到满足，因为可能被报复的人没意识到自己的问题 原谅条件 对方真诚承认错误 承诺继续关系 反复思考曾经的过错，不利于原谅 11 Conflict 冲突不可避免，对关系有好有坏，越亲近越可能有冲突 冲突 不论是否故意，一方阻碍了另一方的目标，两人在某个时间的需求就不同 独立于依赖的矛盾 袒露与隐私的矛盾 稳定与变化的矛盾 陪朋友还是陪爱人的矛盾 冲突影响身体健康 女性更经常表达关系中的冲突，也与通常女性在婚姻中地位低有关 调查方法对于识别伪科学很重要吸引力社会认知，对双方关系的认知沟通方式对关系的影响经济学视角的互相依赖挚友，与爱情有相似也有不同爱情，过去，结婚的目的并不是因为爱情，但目前人们开始更重视性关系中不好的部分冲突，多好的关系也会有冲突，如何让冲突促进关系谁在关系中占主导，如何让关系平等，亲密关系中的 Social power关系结束的常见原因和后续发展维持与修复关系","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/%E4%BA%B2%E5%AF%86%E5%85%B3%E7%B3%BB/"},{"title":"How To Become A Hacker","text":"来源 How To Become A Hacker For true hackers, the boundaries between “play”, “work”, “science” and “art” all tend to disappear, or to merge into a high-level creative playfulness hackers build things, crackers break them 这里只谈软件上的黑客，其中 hackers 和 crackers 的区别 Hackers solve problems and build things, and they believe in freedom and voluntary mutual help to be a hacker you have to get a basic thrill from solving problems, sharpening your skills, and exercising your intelligence Otherwise you’ll find your hacking energy is sapped by distractions like sex, money, and social approval if you tackle just a piece of it and learn from that, you’ll learn enough to solve the next piece — and so on, until you’re done If you’re attracted to hacking because you don’t have a life, that’s OK too — at least you won’t have trouble concentrating. Maybe you’ll get a life later on. If you lack the intelligence, there is little hope for you as a hacker; if you lack the discipline, you’d better grow it. You can learn language features — bits of knowledge — from books, but the mind-set that makes that knowledge into living skill can be learned only by practice and apprenticeship. What will do it is (a) reading code and (b) writing code. How long will it take me to learn to hack? That depends on how talented you are and how hard you work at it. 从解决问题中获得快感，从而不被其它事情分心 喜欢提高自己的能力并乐在其中，self-motivated 远离社交确实可以让自己更专注，但这不是必须 崇尚效率 不浪费他人时间 不解决重复的问题，如闭源软件阻止了重复利用 推荐 Python、Go、C/C++、LISP 如果一个编程语言做得太多，那么它适合生产，但不适合学习 LISP 是个独特的体验 因为现在机器性能已经足够优秀，在性能不关键时减少直接用 C 编程，节省自己的时间 只有练习才能提高，读代码、写代码 弄个网站 学好英语 gift culture，通过给与获得声望，得到别人承认 求助时，体现出自己的思考，谨慎提问","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/How%20To%20Become%20A%20Hacker/"},{"title":"自控力","text":"This book first introduces the two selves and explains how people lose control. Next, the book explains the right and wrong ways to improve self-control through results of scientific experiments and life experience. Self-control is innate, and continuous practice can improve it. Treating self-observation as an experiment, being aware of your thoughts, and foreseeing the future results are the essence of self-control. 自控力是人类共性问题 两个角色对哪件事更重要有不同的看法，意识到，深呼吸 (4-6/min)，预见未来 大脑不是恒定不变的，意志力可以像锻炼身体一样提高 意志力也取决于心理上的信心，不只是物理能量，找到能让你产生信心的点，在你灰心时使用 正向：锻炼、自我觉察（数呼吸）、躯体扫描、好习惯、有植物的户外、健康的饮食 负向，恶行循环：分心、酒精、睡眠不足、压力、自责、空想、眼前的诱惑、两个自我的内战 假设每一天都重复今天，今天你会怎么做？ 遵守纪律，不能把损害目标的东西当作进步的奖赏，困难的逃避、安慰。你认同的是哪个自我？长远的还是冲动的？ 多巴胺给予动力，而非幸福，不应该去除，而是利用好多巴胺 预测会失败的情形，然后避免。想象今天没完成任务会怎样，越具体越好。想象成功的情形 等待 10 分钟再行动，远离诱惑物品 动力和堕落会传染，仿佛内心中多了其他人的自我。自己有机会将成功分享给别人时，别人在监督时，可做得更好 感觉不可控，行为可控。越抑制反而越想，只观察不相信，使用正念的方法。云、冲浪的联想 用好习惯替换坏习惯 自己就是实验对象，持续观察","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/%E8%87%AA%E6%8E%A7%E5%8A%9B/"},{"title":"英语魔法师","text":"1 基本句型S 主语 V 动词 O 宾语 C 补语 S + V S + V + O S + V + C，接补语的动词叫“连缀动词”，表示是（划等号）的含义，没有实际含义，be、look、seem、appear、sound、feel、taste、become 称为、make 作为、turn 转变为、prove 证实为 S + V + O + O S + V + O + C，O 与 C 是相等的关系 补语表达相等关系，是名词或形容词 be 动词后面没有补语时翻译为“存在”，To be or not to be 如果两个名词不相等，那么是 4，否则是 5 2 名词词组与冠词名词短语 3 部分 限定词，a、many、his、the，限制 3. 名词范围 形容词，修饰名词 名词 3 部分每个部分都可以省略 不使用限定词的场景 抽象名词、物质名词（water、food），因为没有一个这个概念 复数，因为不是一个 专有名词，人名、地名，因为全世界只有一个，限定的话暗含多个 主语或宾语为专有名词，则补语因为与其等同，同位语也是，但是否为专有名词要看具体语境 123Mr. Elson was &lt;president&gt; of the high school.Mr. Elson is also &lt;a member&gt; of the Council of the city.Mattin Wales, &lt;Head&gt; of the football team, at the time, wore a mustache. a(n)是one的弱化结果，而the是that/those的弱化结果 所谓的要使用 the 的专有名词，the 还是指代的意思，是因为名词部分被省略掉，把复数的-s移到前面来 12the Philippine Islands → the Philippines (菲律宾群岛）the Alp Mountains → the Alps (阿尔卑斯山） 练习： 形容词位置的名词没有复数 所有格中无生物用 of，生物用 ‘s 代指一句话只能用 this 不用 that 3 动词时态 简单式，一个时间段，可以小到一点，大到无限（真理）。按照时间段的中心点再分为三种 过去时间，be = was，The witness was being questioned in court when he had a heart attack.，可以加上表被动的分词，也可以加上表正在的分词，这个是两个都加，这些分词看作形容词的补语 现在时间 未来时间，be = will be 完成时，用箭头表示的截止时间，根据截止时间的位置分三种 现在时间，be = have been 过去时间，be = had been 未来时间，be = will have been 4 不定词短语不定词与助动词的共同点，不定词是助动词的变化 接动词原形，I will go, I want to go 都有不确定的语气，He may be right, He seems to be right，个人理解也就是未来的事情 用完成时来表过去，It seems to have rained last night 现代分词、过去分词是形容词类，不定词可以作名词、形容词、副词 1234567891011must — have toshould 一 ought towill/would — be going tocan/could — be able tomay/might 一 be likely toto 有表示目的的含义，in order to书中具体讨论了 plan、avoid、hate、like/dislike、try、remember、stopThey plan to marry next monthThey plan (that) they will marry next monthThey plan (that they are) to marry next month let、have、make 使役动词接动词原形，因为是命令语气 感官动词（see、hear、watch）接动词原形或现在分词（表持续），因为没有不确定的含义 5 动名词 持续性的暗示，have a drink 和 drinking 动作的暗示，swimming 动名词与不定词相比更像名词，可以有所有格、复数、冠词 动名词短语看作名词从句的简化 I really enjoyed (that I taught -&gt; teaching) English to school at night. 从句主语与主句不同时，使用所有格 I don’t like John’s calling my girlfriend day after day. Picking strawberries / The picking of strawberries / Strawberry-picking 的语法区别见书 being 现代分词，表示进行 作为动名词被动形式，being Ven 动名词与现在分词区别，形式一样，现在分词是形容词，动名词是名词。可以将带区分的词变化成 A is Ving 的形式，解释得通就是现在分词 6 分词 现在分词，暗示正在进行 过去分词，暗示被动或完成 感觉相关的词，区分主动和被动 He is disappointed at his scores His scores are disappointing 形容词从句简化主语和 be 动词，The vase (which is) being auctioned now is a Ming china. 副词从句，Having finished the day’s work ,the secretary went home. 如果没有 be 动词，就变成进行时，然后再去掉 be 动词 7 形容词形容词修饰名词，副词修饰以外的词（动词、形容词、其它副词） 只能有两个位置，名词短语位置表示持久的属性，补语位置表示临时的 在名词短语中的形容词。通常在限定词和名词间，但对于限定词与名词结合的情况（someone、anybody），就只能放在后面了。另一种放在后面的情况是 a- 开头的形容词 alike、alone 在补语位置的形容词 名词作为形容词使用时要变为单数，短语作为形容词使用时，出了其中的名词变为单数，还要加上连字符 形容词顺序，越不可变的越靠近名词，越临时的越远离名词 形容词比较级 单音节词尾变化（-er、-est），三音节加 more、most，双音节，形容词词尾（-ing、-ful、-ess、-ous、-ive）加 more、most，其它两种变化皆可 作补语的形容词不需要 the，名词短语中的形容词有指示含义时加 the （比较级也有可能加 the） 为避免重复，比较级时，会用 yours、those 来替代，同时要保证对称 8 副词 状态的副词 (Adverbs of Manner)，-ly，修饰动词，通常在动词后，但如果有宾语或补语就要后移，或放在动词前面 强调语气的副词（Intensifiers)，修饰名词、动词、形容词、副词 强度范围，位置挨着修饰对象（前面或后面），only、merely 加强语气，在修饰对象前面，badly 程度副词，在修饰对象前面，almost 修饰句子的副词（Sentence Modifiers)，需要逗号分割，可以放在句首、句中、句尾 连接副词，however、therefore，类似连接词 (Conjunctions) 分离副词，相当于省略了其它成分的状态副词，(If we are speaking) Scientifically , the experiment was a success. 9 语气 叙述事实，真 条件语气，不确定。个人理解和不定词类似 假设语气，假 祈使语气，希望成真 事实语气，对于未来的情况加上 will 表不确定。如果未来两件事情有条件关联时，先假定一件事已经发生，这件事用现在时（不加 will）。If you are late again,you’ll be fired 条件语气，must、should、will/would、 can/could、may/might，过去形式的助动词表示更加不确定，比如 could 相对于 can。用完成时表示对过去的猜测，It may have rained a little last night. 假设语气 现在时间，条件句过去时，主句助动词 过去时间，条件句过去完成时，主句助动词 + 完成时 未来时间，条件句过去时 或 should 或绝无可能的 were to，主句助动词 助动词都是过去式（would、might、could），注意主句和条件句未必都是假的 不是条件 + 主句的形式，套用条件句的变化形式。根据网上资料，有时条件是隐含的，此时使用主句的变化形式 祈使语气，动词原形，对未来的期望和要求。The court demands that the witness leave the courtroom. 个人补充，should 表示惊叹，为真的事实，原形或 have Ven，是否也可以当作条件语气理解？因为不敢相信It is surprising that she shouldn’t pass the math examI am surprised that you should have acted so indiscreetly. 10 介系词介词用法类似记单词，需要靠多读 空间上，点 at，线 on、along，面 on，体 in时间上，点 at，长时间 in，日期 on on one’s way 在路上，in one’s way 挡住路 arrive in 按照体理解，arrive at 按照点理解 between 有表明位置的功能，而 among 没有 below 表示低，under 还有表示位置的意思 11 主语动词一致性 通过 the/a 限定词来帮助判断主语是一个还是两个 but 排除后面的内容不影响单复数 either or，neither nor 就近原则 every、each 表示每的，用单数 度量单位作主语，用单数 all of、a lot of、some of 看不出主语时，才看 of 后面的内容，其它情况不用管 of （还有其它介词）后面的内容 集合名词，只一个整体时单数，用来指内部成员时复数，staff (员工、幕僚）、faculty (教员）、以及 family、police、committee、crew(机员、船员） 以 s 结尾的不一定是复数，如 Mathematics 12 名词从句 合句，两个简单句对等关系，对等从句 复句，有主从，从句在主句中做名词、形容词、副词 名词从句，放在主句的主语、宾语、补语、同位语位置，当作名词 可以用 it 放在主语、宾语位置，突出主句，从句后移 宾语、补语位置的 that 可以省略，因为即使省略也不会造成断句困难 有时从句更重要，从句在前，主句在逗号后，而且可能倒装 代表问题时，使用 who、what、when，从句改成非疑问句顺序 who you are 句首和介词后只能用 whether，不用 if 13 副词从句副词从句与对等从句区别是使用的连接词不同，与名词从句的区别是，名词从句的主要从句不是完整的简单句 连接词 时间、地点，after、until、when、where 条件，if、as long as、suppose 原因、结果，as、now that、so that 目的，so that、in order that、lest、in case 让步，although、while、whoever( = no matter who)、whichever(= no matter which) 限制，as far as、in that 方法、状态，as、as if 区分连接词和介词，介词后面接名词，不接句子，比如 despite 14 形容词从句形容词从句，关系从句 两个句子有名词交集 X，(句子 1 X 成为先行词)(句子 2 X 改成关系词 wh- Y，作为连接词和代名词，即从句的成分)，句子 2 作为形容词修饰 X 关系从句中的连接词是对从句中名词的改写，而名词从句和副词从句的连接词是外加的 代词 副词 he/they it/they 从句要限制范围时 his him then there so for a reason who which that whose whom when where how why 主句已经指定范围，比如一个专有名词，然后用逗号隔开，后面的内容相当于括号中的补充说明，此时从句不需要进一步限定范围所以不用 that，用 who、which 介词后面用 which，不用 that 如果从句在先行词后引起混淆，则改变句型或调整从句位置 省略关系词 Y Y(如 whom) 在从句中做宾语、补语可省略，以不影响断句为准 主从之间无逗号分隔 省略先行词 X X 为空泛的字眼，thing、people 主从之间无逗号分隔 从例子看此时 Y 也被省略 因为 X 为主句名词不能直接省略，所以 X 会变为 what、whoever、whichever，这种句型可按名词从句解释 从句中副词 Xa 与主句名词 X 有对应关系，则有 3 种方式省略，同样有逗号隔开不省略 省略主句中包含 X 的副词短语，如 The rain came (at a time)(when)the farmers needed it most. 省略 at a time 省略从句中的连接词 Y (Xa 变化而来) 不能直接省略 X，但可改为疑问类型的名词从句 如 I know the time (when) he will arrive，省略 when 为方式 2 的省略，省略 the time 则变为疑问类型的名词从句，I know when he will arrive. 方式 3 whenever、whoever、whichever 有两种解释 翻译为 no matter wh- 表示让步、条件，作为副词从句。Whatever (= No matter what) he may say, I won’t change my mind. 翻译为 anyone/anything that 作为名词从句。替换为 anyone that 就成为形容词从句。Whatever (= Anything that) he may say won’t be true. 15 对等连接词结构和内容越对称越好，对等连接词 and、or、but 连接对等的句子、单词、短语，对等连接词还包括相关词组(correlatives) not… but; not only… but also; both… and; either… or 分号可以取代连接词连接两个从句，不能连接词组正确 He’s not an atheist; rather, he believes in agnosticism.错误 scientists are not atheists; rather agnostics. 16 从句简化通则简单句 -&gt; 复句、合句 -&gt; 简化从句，合句的简化是删除对应位置的重复部分，复句的简化即三种从句的简化，名词、形容词、副词 一般语法书称这三种从属从句的简化为“非限定从句”(Nonfinite Clauses),并称其中的Ving(动名词或现在分词）、Ven (过去分词）与to V (不定词）为“非限定动词”(Nonfmite Verbs) 省略主语与 be 动词，保留补语 何时省略主语 从句的主语是空洞的字眼(one、everybody, people 等) 从句的主语与主句相同 没有 be 动词时 助动词变为不定词，could/must 变为 be to 或 able to、likely to、in order to、so as to 添加 be 动词变成 be Ving 17 形容词从句简化关系词是宾语省略，是一般省略，关系词是主语省略，则一定会省略 be 动词，这时是形容词从句简化 补语为 Ven/Ving，省略关系词和 be 补语为 形容词/名词，省略关系词和 be 有助动词，改为 be to V，省略关系词和 be 没有 be 动词和助动词，动词改成 Ving 不定词修改的注意 不定词主、被动John is not a man whom one can trust -&gt; John is not a man to trustJohn is not a man who can be trusted -&gt; John is not a man to be trusted 不定词的动词为及物动词时是否加宾语This is exactly the thing which we should do -&gt; This is exactly the thing to doThis is exactly the time when we should do it -&gt; This is exactly the time to do it 不定词后面只有介词，没有宾语，因为这个宾语是关系词被省略了He will be the toughest guy you must deal with 从句主语与主句不同时的省略，如果是不定词则可通过加 for 来安插主语I have a job that your brother can do -&gt; I have a job for your brother to do 18 名词从句简化省略主语与 be 动词，连接词 that 可省略，疑问句改来的疑问词不能省略 被动时，由于 Ven 是形容词，改成 being Ven 形容词/名词，改成 being + 形容词/名词 有助动词，改为 be to V。不定词不能放在介词后，要用 Ving 没有 be 动词和助动词，改成 Ving。完成时变成 having 换成相同含义的名词 主语不能省略时 名词从句作宾语，从句主语成为宾语，从句动词成为宾补 动词为 Ving 形态时改成所有格，His calling my girlfriend every day is too much for me 添加介词，隐含的介词简化时要写出来，I am worried (about the fact) that my son lies all the time -&gt; I am worried about my son’s lying all the time 或 I am worried about my son lying all the time，第一种改法更接近原意，说谎是宾语，因为第二种将说谎变成了宾补。That the Clippers should beat the Lakers was quite a marvelous feat -&gt; For the Clippers to beat the Lakers was quite a marvelous feat 19 副词从句简化之一省略主语和 be 动词，没有 be 动词和助动词时，改成 Ving 连接词表示当的 while、when ，表示因为的 because、as ，一般可以推测出，因此可以省略。而 although 表转折则不省略，或变成 still 形容词/名词时，不省略连接词或变成 being，As I am a student -&gt; As a student 或 Being a student 连接词可以作介词时 before、after、since，使用 being，否则语法错误 Before he was in school -&gt; Before being in school 过去时，连接词不省略或使用完成时来交代时间 主语不同时，省略 be 和连接词，不能只省略 be 动词 20 副词从句简化之二 Ven 省略主语、be，连接词 after 因为 Ven 已有完成的暗示，可以省略，但是像 although 表转折就不省略或替换为 still，before 也不能 连接词 before、after、since 在简化后成为介词，要接名词，要写成 being Ven 因为 Ven 已经有完成的暗示，having been Ven 可以进一步变成 Ven 语气助动词简化为 to V 连接词改介词的简化，because、since 变成 because of、as a result of、with，when 变成 upon，动词变成 Ving 或换成对应的名词。如 Because the exam is only a week away , I have no time to waste. -&gt; With the exam only a week away ,I have no time to waste. 21 简化从句练习重新阅读一遍，见习题和答案 22 倒装句 增强清楚性，主语有比较长的修饰语，导致动词与主语、宾语（已提前）间隔太远，或强调宾语 比较级 关系从句（关系词做宾语） 引用句 强调 假设语气，be 动词、助动词提前 地方副词到句首，In Loch Ness dwells a mysterious monster 否定的(not、never, hardly )、only 副词到句首","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/%E8%8B%B1%E8%AF%AD%E9%AD%94%E6%B3%95%E5%B8%88/"},{"title":"西方现代思想讲义","text":"书的结构 核心问题“现代性问题”，以人物为线索，按时间顺序。对现代的反思和批判 现代世界的基本特征 —— 理性化 人生难题 社会困境 最后两章是对西方政治的回应、后冷战时期 为何学，了解现代思想上的转变 思想为何重要，因为它决定了解释、判断、行动 什么是现代 不断进步，对传统的否定，脱离宿命，成为自由的创造者 理性观念推动现代变革，带来现代世界的政治、经济、思想 如个人主观价值提升、自然秩序被打破、理性秩序建立 理性取代了上帝 从将自然视为母亲到长大成人，客观的研究自然、利用自然，弊端是破坏自然 个人不再一生属于某个群体，然而作为独立的个体，带来了孤独感 缺少信仰，生活的意义 人人自由后，如何统治，建立社会秩序 韦伯 研究领域广泛的知识分子 反思理性，世界的祛魅、诸神之争、现代的铁笼、工具理性 世界的祛魅，用科学去除神秘，但又失去生命的寄托 诸神之争，价值观冲突，真善美，善美属于应然，是科学无法解决的 也导致了价值真空 工具理性，计算成本和收益，追求高效，人被简化成可计算的数据，导致手段压倒目的的问题 现代的铁笼，非人化，成为一个社会零件，但因其高效的让社会运转又不能废除 现代人的精神危机 为何需要信仰，通过信仰将短暂的生命献给崇高的事业，获得永恒、超越自己的私利 但信仰是一种价值，难以被证明为真 尼采认为价值不是发现出来的，是人创造出来的，上帝已死，成为自己的上帝，成为“超人” 从不同视角理解问题 弗洛伊德提出潜意识，颠覆了理性人观念，让本我欲望不再羞耻，但理论经不起科学考验 本我：原始欲望、驱动力，自我：理性的监护人，超我：理想化人格，天使 萨特，人的存在是虚无，人是自由的，但为自己的选择承担后果，又是沉重的 每个人都是自由的，为了争夺主导权，推出他人即地狱的观点，认为人与人之间无法调和 20 世纪的教训 为何需要一个政府？ 因为两个假设，资源匮乏，人性自利，所以需要政治权威维护，对暴力的合法垄断 合法性来自于 过去：自然等级，天生的高低贵贱 现代：需要一套理由 3 种主要政体，社会主义、资本主义、纳粹主义（国家社会主义） 人们相信社会科学也像自然科学意义，可解决社会问题 纳粹并不偶然，而是因为 现代官僚体制，让每个人都只是一个零件，缺少了总体的责任感和道德感 打着科学的理念，认为犹太人是某种杂质 分散群体，且逐渐加大迫害，避免形成大规模叛乱 因此现代社会这种非人格化特性，对人提出了更高的道德敏锐感要求，需要独立思考自行判断 科学即要有被证伪的可能性 因此没有彻底的正确，要带着批判的方式看，即批判理性主义 同样否定了历史决定论，即无法预测未来，反对乌托邦（整体规划），提倡渐进改良 哈耶克与凯恩斯，哈耶克提出自发秩序 每个人自由选择，自发形成了秩序，而非系统规划 这种规划是一种理性的自负，以苏联和德国纳粹为例 无法消除所有的不确定性，因此要勇敢的与之共存 柏林，多元价值（来自于其经历的多重身份）、两种自由 不存在一个终极价值，多个价值间不可转换 但价值也并非无限多，且人类价值有共通性，双方能理解其它不同的价值 两种自由：消极，不做什么，积极，可以做什么 警惕打着为你好的积极自由的借口，实际来限制自由 但作者认为可以通过牺牲自由来换取其它内容 消极自由更能体现自由的本质 马尔库塞，舒适的不自由，新左派 人的异化 工作时像动物一样，人的东西成为动物的东西 吃喝性，才感觉是个人，动物的东西成为人的东西 韦伯的工具理性，追求成本收益，人们关注的就是如何赚钱、如何消费，形成“单面”的社会 即使有反叛的声音，也会被资本吸纳、驯服，变成一种赚钱的职业 提出了批判，但没给出解决方案。但正是对自由主义存在批判才证明它仍然活着 自由主义有越来越强的平等、公正诉求 自由主义包含很多学派，但共同特点是保障个人权利 自由主义尽量兼顾自由、平等、多元 罗尔斯 忘记自己身份后作出平等的决策，无知之幕 原则一：平等的自由，言论、信仰、个人财产自由 原则二：只允许两种不平等 在抹平家庭背景、成长背景后，用机会平等导致的差异 差异的存在是为了改善弱势群体状况的 诺齐克 正当获得的就是正义的，不应该通过强制征税二次分配，国家只提供安全保障功能 诺齐克，“历史正义”，来路清白。罗尔斯，“模式正义”，经济分配满足某种结构 德沃金，平等的关怀，不该让自己无法选择的因素影响命运 桑德尔，社群造就了个体，你的故事总是在社群关系中形成，因此个体对社群有义务，这种义务是给定的、不是自愿的 所以人改为自己的祖辈担负责任，如日本侵华 沃尔泽，人无法脱离社会，但实践中却出现自我中心的冷漠社会，因为流动性的社会造就了孤立的个体 流动指：地理上的流动，社会身份的流动，婚姻的流动，政治信仰的流动，因此现代的社群是自愿社群 缺点是牺牲了稳定性、归属感 作者认为，从集体主义到个体主义是现代社会导致，而非东西文明的区别 泰勒，无法放弃自由，但如何解决自由带来的问题 既忠于内心的感受，又通过与人对话来让自己更加清醒，成为更好的自己 自我价值判断标准并不凭空产生，而通过改造和采用别人的价值尺度 韦伯，诸神之争，价值判断领域的争执。而哈贝马斯提出，通过”主体间性 inter-subjectivity“ 交流分两种，作为达成目标的工具，作为理解对方的交往行动，通过这种交往取得共识 全球化带来冲突。有两种观点，文化和制度之争 福山认为，由于经济发展产生了获得承认的需要，而只有自由民主制度能满足，满足后变革的动力消失 亨廷顿认为，民主政治依赖于西方文明，无法推广到其它文明，只能通过文明圈间协商控制冲突 作者认为文化既有相互融合影响的一面，又有短期内难以改变的部分，两人分别阐释其中一面 作者最后想说”人类因理性而伟大，因知道理性的局限而成熟“ 婚姻在现代（因为避孕、洗衣机、外卖、城市化、女性经济独立等等）没有了其它非感情限定因素，更容易离婚","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/%E8%A5%BF%E6%96%B9%E7%8E%B0%E4%BB%A3%E6%80%9D%E6%83%B3%E8%AE%B2%E4%B9%89/"},{"title":"量化健身","text":"写作两个目的 为健身者提供 标准化 的学习产品，可复制的。个性化训练前的内容是可以标准化的 为健身者介绍系统性的知识体系 健身者根据标准模板、标准动作进行个性化调整 八章 破除健身迷思，一些误解 如何制定训练计划 更精确的控制，计划变量 对于初学者的计划 增肌计划 力量举计划 减脂计划 量化营养摄入 1 破除健身迷思 打破“唯基因论”的偏见 肌肉并不需要通过药物才能增长 肌肉不是只通过锻炼增长的，而是锻炼、饮食、休息的结合 肌肉要一直训练来维持 普通人完全可通过训练获得好身材，不需要考虑基因 一个典型中国女性的血泪减肥史 错误：空腹有氧、裹上保鲜膜、多数减肥产品没通过双盲测试 只有抽脂手术可以局部减脂，其它情况都是整体减脂的 间歇性断食：谨慎操作 低碳饮食：阿特金斯饮食法和生酮饮食。高脂低碳，指导下进行 原始人饮食法：难操作 减肥关键是热量差 典型男性 腹肌并不表明训练水平，只表明体脂水平 新手也应当掌握一些自由重量训练 徒手与负重训练没有本质区别，只是器械更容易控制加重 增肌不一定要极限强度，极限重量的 50-80% 即可 减脂、增肌关键 减脂，长期持续的、热量赤字。为避免平台期，多种减脂可交替进行，每种至少维持一个月 增肌，热量盈余、足够的蛋白质摄入、训练压力 蛋白质 = 1.5 - 2g X 体重kg 训练压力：时长、强度、休息间隔、一定程度的肌肉损伤 热量和蛋白质相当于汽油，训练压力相当于发送机 抛弃二元化思维 只要能达到减脂、增肌关键要素的训练都可采用，细节可以按自身调整 不必完全照搬别人的、不必迷信某种动作、器械 对有经验的训练者，也不必迷信过去经验，应积极调整策略 两种肌肉酸痛：训练时、训练后 训练时酸痛常用来作为练习停止的标志 训练后疼痛，如经常出现则不正常，应当改练别的部位，做到充足的休息。并且不出现并不表示训练没效果 2 建立严谨计划观念 超量恢复，是一种应激、适应的过程。训练后体能下降（警觉期），经过恢复，体能会超越原水平——超量恢复（适应期）。停止训练，体能恢复从前（衰退期） 2-3 天训练一次。不建议每天都练，因为需要恢复的时间，否则是过度训练，长期过度训练，会越练越弱 建议初学者采用不分化（部位），少次数训练。有经验后，再分化和增加次数 变得更专业，记录与执行训练计划 时间，训练项目，强度（动作难度、重量、跑步速度），容量（组数、次数、跑步路程），时间（动作时间、休息时间），感受建议 应对平台期 1-2 年初学者，调整动作、计划就可突破 平台期的 4 个原因 训练不足。强度、容量、频率、训练计划固定、身体部位薄弱 恢复不足。全身或身体某部位训练强度大而恢复不足 此外，极端刻苦的训练者每次训练不会等到 100% 恢复，长期就会有疲劳积累，此时应有 1 周来降低训练强度 身体功能限制。活动度差，稳定性差，导致动作变形，此时应先调整身体，解决问题 动作不规范。低强度时问题暴露不明显，而增加强度后出现不适时，应纠正动作，避免受伤 训练计划 增肌是同化作用（合成代谢），减脂是异化作用（分解代谢），热量摄入 - 消耗 两者是相反的，同时进行则都进展缓慢 不同人对健身有着不同的标准，不同标准间会产生冲突，马拉松和健美就产生冲突 设计训练计划的原则 渐进超负荷 有目的性，减脂、增肌 结合自己的时间、身体状况，保证难度适中 训练部位和动作的全面 3 更精确的计划 频率和分化方式 开始时低频率，保证充分休息 由不分化逐渐过渡到三分化 强度，根据不同目的，选择不同的强度。低强度促进肌肉耐力，中强度肌肉肥大，高强度增加绝对力量。 强度即某个重量下的（一组）最大反复次数，RM (Repetition Maximum)。或者用极限重量（RM = 1 时的重量）的百分比。RM 与百分比可互换，有对应关系。 容量，可按组数、次数来计算。对跑步、游泳，则为时间、距离。 但容量不能精确到动作细节，没有考虑完成时间，所以仍不够精确 高强度通常搭配低容量，反之亦然。如强度大、容量高、那么必然训练频率降低 组间休息，受到训练强度影响。增肌者可严格控制休息时间 动作 不同的训练目的，不同的训练者关注点不同 形体训练者，从肌肉角度选动作 力量训练者，从动作模式选 功能训练者，选可迁移到日常运动中的动作 减脂者动作，热量消耗低但时间长的动作，跑步、游泳。热量消耗高的动作，强度应在中低 选择动作的原则 根据训练目的来选 优先选复合动作 优先选大肌肉群动作，胸 、背 、腿 、臀 能弥补短板的动作优先考虑 适用范围广且具有功能性的动作优先考虑 以塑形、增肌为目的的健身者，我在训练初期，同样会让他们按照“动作” 去规划自己的训练计划，但是入门之后，我会让他们更多地关注局部肌肉的“本体感受”，按照“肌肉”去规划自己的训练计划。按在家、是否有杠铃，详细在 《量化健身：动作精讲》 次要变量 动作节奏，分 4 个阶段 动作速度，追求力量的会较快完成，追求肌肥大的会较慢完成 动作幅度 次间间歇，一组内每个动作的间歇时间 4 初学者健身模板 不论何种训练目的，初学者的基础动作都是一样的，初学者计划主要考虑三点 规范动作 提高身体素质 养成健身习惯 给出了两个 L1/L2 两个模板，训练次数在每周 2-3 次，后续进阶在增加组数、每组次数、缩短休息时间 具体进阶上的调整，参考 L2 的案例介绍，以及后面的“进阶策略的注意事项” 5 拆解增肌训练 健身相关的主要是骨骼肌。肌纤维增粗的两种方式 肌浆肥大，健美运动员 肌原纤维数目的增加、神经募集肌纤维的能力，力量举运动员，绝对力量 计划的原则，5.2 小结有总结表格 渐进性超负荷原则，各种进阶方法 专项性原则，肌肉体积增长 个体差异原则，年龄、营养、生活方式 持续性原则 增肌计划模板 1 以下部分跳过不读 6 量化营养摄入 碳水、蛋白质、脂肪 = 每克 4、4、9 千卡（kcal，大卡，大写 C），1 kcal = 4.18 kJ 确定吃多少 静息代谢率，静息代谢率（RMR）高于基础代谢（BMR）10% 左右 每日代谢热量 每日应当摄入热量 每日应当摄入营养素 静息代谢率 4 种计算方法，我的在 1700-1800，取 1750 每日代谢热量 = 静息代谢率 + 非运动性热量消耗 + 运动性热量消耗 + 食物热效应 每日代谢热量 = 每日静息代谢率 X 活动水平系数 2406 = 1750 * 1.375 每日应当摄入热量 每日代谢热量 个人的体重目标 维持阶段，每天可以有约 300 千卡的上下浮动 达成目标的速度 每日应当摄入营养素（没用统一指标），还可参考“食物”文档，美国居民膳食指南 碳水，应根据运动量而增加 蛋白质摄入量，很少建议超过 2.2g/KG，更多并不能促进增肌 一周测量 3-4 次，体重变化超过 5kg 重新调整计划 减脂时太饿了，增肌时吃不下，有一些替代食材，具体见书 单位 kcal 碳水 蛋白 脂肪 中国营养协会 50-65% 10-15% 20-30% 区域饮食 (Zone Diet) 40% 30% 30% 若饭（每 100g） 164，40% 109.2, 27% 136.8, 33% 若饭 1614 615 410 513 理论 1750 864-1152 432 - 576 20-30% 7 动作篇 基础训练技巧，一些基本原则、常识 基础徒手训练 基础力量训练 热身与损伤预防 考虑用哑铃替换杠铃，哑铃攻略 8 基础训练技巧 宁轻勿假。先保证动作的标准，形成肌肉记忆，不急于加重 姿势不正确，之后纠正要花费更长时间 不用健身房的镜子，培养本体感觉，通过录制视频进行调整 绷紧腹部练习，让躯干成为刚体 胸式呼吸：肩胛骨是否有上下活动，是否出现耸肩，或者上胸部是否向上提升 胸式呼吸：吸气时腹部内收，呼气时腹部外鼓 腹式呼吸：吸气时腹部外鼓，呼气时腹部内收 关于腹式呼吸的疑惑。腹式呼吸与绷紧腹部并不矛盾 练习圆柱体策略 腹式呼吸与积极情绪有关，可用于调整情绪 轻重量高次数：顺着阻力，吸气。对抗阻力，呼气 大重量：瓦式呼吸 保持脊柱中立位，相关练习，日常生活中也一样 通向外旋转形成扭矩整体发力，肩部、髋关节。注意不要旋转过度 压实接触面重心 9 徒手动作 先开始练，再逐渐调整动作到完美","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/%E9%87%8F%E5%8C%96%E5%81%A5%E8%BA%AB/"},{"title":"kindle","text":"1 设置字体和词典在 kindle 环境文件夹 把电子书过滤设置选为“全部内容”，然后把电子书排序设置选为“收藏夹” 。用收藏夹分类电子书 字体放在 fonts 文件夹，自带英文字体可以用 Baskerville ，中文字体思源黑体还好，思源宋体（Source Han Serif）太浅不要用，思源宋体，如何评价，以及如何正确使用 词典放在 documents\\dictionaries 文件夹 一本英汉：与 PC 词典相同的简明英汉（160万），一本英英：Merriam-Webster’s Advanced Learner’s Dictionary，选择依据。其它为 kindle 自带，现代英汉、汉英、汉语，Oxford kindle 不适合阅读长篇英英解释，如需彻底理解单词，用 kindlemate 导出生词本到欧路词典背，见 词典软件。或者在平板上用 kindle App 同步过来，使用欧路词典 文章订阅，kindle4rss。发送频率 3 天，否则要经常删除云端文档，不需要同步可以关闭云端存档。不再使用的两个订阅 田间小站-双语阅读、经济学人双语版 kindle 正版书也可以切换到其它国家购买，同时可以装 google play 版本和中国版，实现双开。由于 kindle for pc 复制后会插入空格和一行来源，需要编程实现自动去除，对于需要做笔记的书暂不考虑购买正版，且calibre 去 drm 插件对 kfx 格式支持也不够好 2 书籍来源3 书籍处理 见 电子书处理 4 字体处理字体正常是 4 个文件放入 kindle，比如 NotoSans-Bold、NotoSans-BoldItalic、NotoSans-Italic、NotoSans-Regular 有时缺少斜体 Italic，可用 ttx 工具将想要加入的斜体的 &lt;name&gt; 中 nameID=1 改为与 regular 相同的 FontFamily，可能不止一处 1234567# ubuntu 下# 解开 regular 看一下 name 表中的值ttx -o r.ttx Play-Regular.ttf# 解开 Italic 将 name 表中的值改为和 regular 中的一样，可能有多个ttx -o i.ttx Play-Italic.ttf# 重新打包回 ttfttx -o i.ttf i.ttx 参见 Kindle Paperwhite 添加中文字体 5 App 端 android 可以替换中文字体，相同文件名覆盖即可，路径 内部存储\\Android\\data\\com.amazon.kindlefc\\files\\fonts。但无法替换英文字体，只能 root 后把系统字体换掉 How to Change Kindle App Fonts on Android android 可以替换自带词典，相同文件名覆盖即可，路径 ``内部存储\\Android\\data\\com.amazon.kindlefc\\files\\B007Z8VKSQ\\B007Z8VKSQ_EBOK.prc` ，文件名其实是词典的 ASIN，这本是默认的英汉词典，也可以替换 B00AZOHEGE 现代汉英词典，作为备用词典 6 辅助软件软件在 windows 环境文件夹 sdr-Cleaner 清理无用sdr Kindle Mate 笔记与生词管理 calibre 电子书管理与格式转换 7 生词本 Kindle 阅读器“生词本”功能详细使用说明 配合 kindlemate 背生词 欧路词典应用指南","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/2.%20%E5%A4%84%E7%90%86%E5%B9%B3%E5%8F%B0/kindle/"},{"title":"linux","text":"1 配置 必装 ssh proxychains4 git meld p4merge vim gtags ctags，github 导入公钥 关闭该死的系统更新，非要更新前一定创建快照 1.1 SSHapt-get install openssh-server openssh-client 如配置 VPS 修改 SSH 端口，则要在系统 iptables 和 vps 页面两处同时放行新端口，并用 nc -l 测试没问题后，再重启 sshd 服务。此时先别断开旧连接，防止出现新端口连不上的情况 1.1.1 解决 20.04 broken package 问题参考 Problems with installing of the openssh-server 123# 通过 aptitude 尝试解决sudo apt install aptitudesudo aptitude install PACKAGENAME 根据 aptitude 安装前的提示，发现是预安装的 openssh-client 版本高，apt purge openssl-client 卸载后安装 openssh-server 没问题。也可以降级已安装的包，sudo apt install &lt;package-name&gt;=&lt;package-version-number&gt; 1.1.2 secureCRT 配置问题 关闭不用的菜单栏、状态栏等，去掉 use dockable session manager 选项，记住连接管理的快捷键即可 编码与字体 在Options -&gt; Session Options -&gt; Appearance 选项中将 Character encoding 设成”UTF-8”即可，字体 Consolas-with-Yahei，三号。没办法用没有 CJK 字符的字体 启用颜色 官方的介绍 https://www.youtube.com/watch?v=SZLbBsp3914 在 default session 中选 solarized dark，emulation 中启用 xterm-256color 在全局配置中外观 - 高级，选中 solarized dark 新建一个颜色模式 将 normal 和 bold 中前景色调亮，同时下拉列表选择 solarized dark，在 default session 中应用 前景色 RGB 颜色 166,177,179 详细参考视频 www.youtube.com/watch?v=SZLbBsp3914 调整系统提示声音，将 默认响声 设置为 windows信息栏.wav 安装 Xming，对于 ubuntu 的 session 中勾选 X11 forwarding 两个选项，默认配置即可 Options–&gt;Session Options–&gt;Terminal 启用选择发送滚轮事件到远程。取消 Scroll to bottom on output Options–&gt;Session Options–&gt;Terminal–&gt;Emulation–&gt;Mapped Keys，选中 Backspace sends delete 默认会话中终端 Options–&gt;Session Options–&gt;Terminal–&gt;Emulation–&gt;Mode，取消 Enable keypad mode switching 小键盘映射 Options–&gt;Session Options–&gt;Terminal–&gt;Emulation–&gt;Advanced，忽略窗口标题更改请求 Options–&gt;Edit Default Session 设置常用的按键映射，运行脚本 a-r、取消脚本 a-s、清屏 a-l (clear)、滚动到底部 a-b （可选）添加键盘映射，HOME/END 为 \\033[H 和 \\033[F，原理见下 Terminal input sequences 1.1.3 隧道/端口转发 代理就是通过隧道帮助用户要访问某个受限资源 隧道由本地和远端组成，本地作为 SSH 客户端连接远端 SSH 服务器端 graph LR subgraph 代理 用户 -- 隧道 --> 受限资源 end subgraph 隧道 L(\"本地 local，客户端\") --> R(\"远端 remote，服务器\") end 按情况分为用户在隧道的本地和远端两种，常见三种 转发方式 所谓用户就是要连接监听端口的设备 所以对用户在本地 local 的，使用 -D 或 -L 打开本地端口，转发给 remote 侧的某资源。如资源为固定的 ip port 用 -L，动态的多个资源用 -D 这种场景如科学上网，-D 打开本地的 sock5 监听端口，加密连到 vps，动态访问各个网站 对用户在远端 remote 的，用 -R 打开远端端口。同样可固定可动态，填 ip port 是固定，不填为动态 这种场景如内网穿透，内网必须作为客户端主动连公网服务器端 为了防止连接中断可 写个脚本 但在公网服务器开端口暴露内网资源可能不安全（有的内网资源没有密码等），真要这样用还需配置 GatewayPorts yes，否则只会在环回口监听 所以为了安全，即 1. 要有授权的客户端才能连服务端口 2. 保证用户到服务端口之间数据的安全性（socks 协议不加密）。在先用 -R 开启环回口（动态方式）后，再在用户侧用 -L 练到公网服务器，见 链式端口转发 (文中为固定转发给 3000 端口，可改为动态) 图中的 4 个角色（资源、用户、local、remote）可重合，即特殊情况 local 和 remote 为同一台设备，如将这台设备用作 socks 代理服务器 ssh -D port localhost 用户与 local / remote 为同一设备，资源与 local / remote 为同一设备的情况 如要只将 ssh 用作隧道，限制用户登陆，可以 修改用户的 shell 对 windows 可用配置好连接信息的绿色版 putty 来当作 vpn 客户端的功能 graph LR subgraph 用户在本地一侧 -L/-D s1(用户) --> s2(local) --> s3(remote) --> s4(受限资源) end subgraph 用户在远端一侧 -R s5(受限资源) --> s6(local) --> s7(remote) --> s8(用户) end subgraph 特殊情况 s9(\"local 与 remote 重合，ssh -D port localhost\") s10(\"用户/受限资源 与 local/remote 重合\") end subgraph 内网穿透 s11(受限资源) --> s12(local) -- -R动态方式 --> s13(remote) -- -L连接到-R的动态端口 --> s14(用户) end 1.1.4 DNS 介绍 DNS 原理和自建 DNS 根服务器、另一个参考 1.2 系统 设置 PS1 export PS1=&quot;\\[\\e[35;22m\\][\\! \\A \\w] \\[\\e[0m\\]&quot;，如要改变标题则继续加一句，PS1=&quot;\\[\\e]0;20.04: \\W\\a\\]$PS1&quot; ，把 20.04 改成想要的名字 ls 颜色 https://github.com/seebi/dircolors-solarized .bashrc 中添加 eval dircolors ~/dircolors-solarized/dircolors.256dark 给 man 命令启用颜色，~/.bashrc 添加如下 1234567891011man() { env \\ LESS_TERMCAP_mb=$(printf &quot;\\e[1;31m&quot;) \\ LESS_TERMCAP_md=$(printf &quot;\\e[1;31m&quot;) \\ LESS_TERMCAP_me=$(printf &quot;\\e[0m&quot;) \\ LESS_TERMCAP_se=$(printf &quot;\\e[0m&quot;) \\ LESS_TERMCAP_so=$(printf &quot;\\e[1;44;33m&quot;) \\ LESS_TERMCAP_ue=$(printf &quot;\\e[0m&quot;) \\ LESS_TERMCAP_us=$(printf &quot;\\e[1;32m&quot;) \\ man &quot;$@&quot;} 修改时区 12sudo unlink /etc/localtimesudo ln -s /usr/share/zoneinfo/Asia/Shanghai /etc/localtime 1.2.1 Kali How to move taskbar from top to bottom in kali linux Settings Editor -&gt; xfce4-panel -&gt; panels/panel-1/position 的 6 改成 4，下面的 size 可扩大，以让图标更大 1.3 网络思路是用无线网卡使 PC、虚拟机、无线路由器处于同一网络中，可以上网。用有线网卡使 PC、虚拟机、开发板处于另一网络中。 要点，配置网关的网卡将作为上网网卡，旧网卡（无线网卡）用来上网，所以只有旧网卡有网关 18.04_20.04 用 netplan，配置文件示例见 asset，命令 sudo netplan --debug apply interfaces 和 NetworkManger 即配置文件与图形界面两种方法不能同时使用，对于 /etc/network/interfaces 配置文件如下 1234567891011121314auto eth0iface eth0 inet staticaddress 192.168.2.36netmask 255.255.255.0gateway 192.168.2.1auto eth1iface eth1 inet staticaddress 192.168.1.36netmask 255.255.255.0# dhcp方式# auto eth0 # iface eth0 inet dhcp /etc/resolvconf/resolv.conf.d/base 配置 dns，没有则新建。sudo resolvconf -u 立即生效 12nameserver 114.114.114.114nameserver 8.8.8.8 1.4 内部局域网为了搭建封闭的局域网，可以在 windows 中 添加 KM-TEST 虚拟网卡，所有虚拟机桥接到该网卡，实现虚拟机间和主机与虚拟机的通信 1.4.1 代理 proxychains4，适用于所有包管理系统和 git SSR 选择允许局域网 apt 安装 proxychains4 配置 配置文件在 /etc/proxychains.conf 或 proxychains4.conf，改成 socks5 192.168.7.36 17890 设置 DNS 文件在 /usr/lib/proxychains3/proxyresolv，修改 DNS_SERVER=8.8.8.8 注意配置文件代理地址设置成 host 的 IP 192.168.2.29，不是 127.0.0.1 tsocks 不那么好用，先不考虑 1.4.2 软件源中科大 1.5 sshfs-win 先装 winfsp (Cryptomator 也装了 winfsp)，然后装 sshfs 64位 计算机上右键 映射网络驱动器，不要选 添加网络位置，勾选 登陆重连 mount home 的情况，\\\\sshfs\\compilers@192.168.36.3 mount 其它目录的情况，\\\\sshfs.r\\compilers@192.168.36.3\\usr\\class\\cs143\\cool 使用 key 和代理的情况 配置文件 C:\\Users\\用户.ssh\\config IdentityFile 指定私钥路径 ProxyCommand 指定代理，这里用 nmap 附带的 ncat ProxyCommand D:/soft/Nmap/ncat.exe --proxy 127.0.0.1:17890 --proxy-type socks5 %h %p 参考 打开 cmd （非管理员权限），sshfs-win.exe svc \\sshfs.k\\ubuntu@主机!端口 v: -d -o LogLevel=DEBUG3 映射为 v: 调试信息 -d -o LogLevel=DEBUG3 但因为 ProxyCommand 依赖 sh，参考 这里 的方法，下载 busybox 并改名为 sh.exe，可避免装 Cygwin。同时 ProxyCommand 也要改成能识别的斜杠 / 如直接映射驱动器 \\sshfs.k\\ubuntu@IP!端口（而非 sshfs-win.exe 命令），则不会使用 config 文件，此时 key 只能放在 C:\\Users\\用户.ssh 下 1.6 vmware 共享文件夹12345# 查看共享vmware-hgfsclientmkdir -p /mnt/hgfs# allow_other 删除也没问题vmhgfs-fuse .host:/ /mnt/hgfs -o subtype=vmhgfs-fuse,allow_other 1.7 samba、tftp、nfs linux samba 3.6.0 开始支持 SMB2，之前的版本需要在 Windows 控制面板启用 SMB1.0 客户端，用命令 sudo smbstatus 查看软件和协议版本 即可以在控制面板启用，也可以 powershell 管理员运行 Enable-WindowsOptionalFeature -Online -FeatureName &quot;SMB1Protocol-Client&quot; samba 可能不稳定，重启 Windows 后会无法连接。要重新敲上面的 enable 命令后再重启宿主机和虚拟机才能连上，可把上面命令保存成脚本并 管理员运行方便后续使用 对于 virtualbox 虚拟机导出给 vmvare 使用时，遇到 virtualbox 服务找不到无法启动图形界面时，进命令行卸载 virtualbox 服务，cd /etc/init.d 、sudo ./vboxadd cleanup、sudo ./vboxadd-x11 cleanup samba 不稳定也可考虑用 ssh 映射替代，见 [sshfs-win](## 1.5 sshfs-win) 123456789101112131415161718# 安装# 20.04 同样出现 broken package 问题，先卸载高版本的依赖 sudo apt purge libwbclient0 samba-libs，再安装apt-get install samba samba-common# 备份配置文件cp /etc/samba/smb.conf /etc/samba/smb.conf.bak# 修改smb.conf。添加一个共享定义，share 表示windows连接到的文件夹名为 \\\\ip\\share# create mask = 0644 避免添加执行权限[share] comment = samba home share path = /home/zack browseable = yes read only = no create mask = 0644 directory mask = 0777# 添加用户sudo smbpasswd -a zack# 重启服务sudo service smbd restart 1234567891011#安装apt-get install tftp-hpa tftpd-hpa xinetd#设置目录vi /etc/default/tftpd-hpa#启动服务service tftpd-hpa restart#测试tftp 127.0.0.1tftp&gt; get hellotftp&gt; quit 123456789101112# 检查nfs服务是否安装。没有则 sudo apt-get install nfs-kernel-serverservice nfs-kernel-servertar xvf rootfs.tar.xz sudo chmod 777 rootfs # 重启nfs服务(使得前面修改生效)sudo /etc/init.d/nfs-kernel-server restart# 测试nfs服务是否安装成功sudo mount -t nfs localhost:/nfs/rootfs/ /mnt/# 如果其中的内容和/nfs/rootfs中一致。 表示有挂载成功ls /mnt/sudo umount /mnt 1.8 ftp更多安全相关的配置见 vsftp 配置 1234567891011121314sudo cp /etc/vsftpd.conf /etc/vsftpd.conf.orig# Allow anonymous FTP? (Disabled by default).anonymous_enable=NO# Uncomment this to allow local users to log in.local_enable=YES# 可上传write_enable=YES# 用户列表userlist_enable=YESuserlist_file=/etc/vsftpd.userlistuserlist_deny=NO# 在这里添加可登录的用户，系统的用户名和密码/etc/vsftpd.userlist 1.9 编译工具1234567# 20.04 同样有 broken package 问题，要降级安装 libcsudo apt install build-essential python3# 安装最新 cmake，参考 https://askubuntu.com/questions/355565/how-do-i-install-the-latest-version-of-cmake-from-the-command-linewget -O - https://apt.kitware.com/keys/kitware-archive-latest.asc 2&gt;/dev/null | gpg --dearmor - | sudo tee /etc/apt/trusted.gpg.d/kitware.gpg &gt;/dev/nullsudo apt-add-repository 'deb https://apt.kitware.com/ubuntu/ focal main' sudo apt updatesudo apt install cmake 1.10 chrome12345# 装 chromehttps://dl.google.com/linux/direct/google-chrome-stable_current_x86_64.rpmyum localinstall google-chrome-stable_current_x86_64.rpm# chromedriver，下载 linux64 版本https://chromedriver.chromium.org/downloadsba 1.11 vps 改端口号 sudo passwd 设置密码，为了以后 VNC 抢救时可以登陆设备 备份防火墙 sudo iptables-save &gt;fire.backup 添加 ssh 端口号，iptables -I INPUT 1 -p tcp --dport xxxx -j ACCEPT nc 测试新端口能被连接 修改 sudo vi /etc/ssh/sshd_config 的 Port sudo systemctl restart sshd，先不关闭旧连接，测试新端口是否生效 改防火墙 事先备份 sudo iptables-save &gt;fire.backup 删除无用项，或还原改后配置 sudo iptables-restore fire.now 永久保存，避免重启后失效，sudo netfilter-persistent save 重启测试 sudo reboot 修改 PS1 和时区 备份还原 对 X86，可创建 5 个备份，需要还原时，先删机，等完全终止后，利用之前的引导卷新建机器 对 ARM，因通常很难创建，使用 dd 备份还原 停止实例，分离引导卷 附加到另一实例的块存储卷，并用命令（iSCSI 命令和信息）连接 sudo fdisk -l 查看为 /sdb 硬盘，备份或还原 备份 sudo nohup bash -c &quot;dd if=/dev/sdb conv=sync,noerror bs=64M status=progress | gzip -c &gt;backup.gz&quot; &amp; 还原 sudo nohup bash -c &quot;gunzip -c backup.gz | dd of=/dev/sdb bs=64M status=progress&quot; &amp; 查看进度 sudo tail -f nohup.out，ubuntu 20.04 原始备份时间 35min 大小 650M，还原时间相同，dd 的 bs 越大越好 附加引导卷，启动实例 用命令（iSCSI 命令和信息）断开连接，并分离 为优化资源占用，多使用 top 命令 卸载 snap，防止 CPU 占用高，sudo systemctl stop snapd, sudo apt purge snapd 关闭甲骨文日志 systemctl stop unified-monitoring-agent，systemctl disable unified-monitoring-agent 甲骨文开启 IPv6 关闭 fwupd sudo systemctl stop fwupd， sudo systemctl disable fwupd 卸载 gnome，然后重启 123456789101112131415161718192021222324sudo apt updatesudo apt purge adwaita-icon-theme gedit-common gir1.2-gdm-1.0 \\gir1.2-gnomebluetooth-1.0 gir1.2-gnomedesktop-3.0 gir1.2-goa-1.0 \\gnome-accessibility-themes gnome-bluetooth gnome-calculator gnome-calendar \\gnome-characters gnome-control-center gnome-control-center-data \\gnome-control-center-faces gnome-desktop3-data \\gnome-font-viewer \\gnome-initial-setup gnome-keyring gnome-keyring-pkcs11 gnome-logs \\gnome-mahjongg gnome-menus gnome-mines gnome-online-accounts \\gnome-power-manager gnome-screenshot gnome-session-bin gnome-session-canberra \\gnome-session-common gnome-settings-daemon gnome-settings-daemon-common \\gnome-shell gnome-shell-common gnome-shell-extension-appindicator \\gnome-shell-extension-desktop-icons gnome-shell-extension-ubuntu-dock \\gnome-startup-applications gnome-sudoku gnome-system-monitor gnome-terminal \\gnome-terminal-data gnome-themes-extra gnome-themes-extra-data gnome-todo \\gnome-todo-common gnome-user-docs gnome-user-docs-ru gnome-video-effects \\language-pack-gnome-en language-pack-gnome-en-base language-pack-gnome-ru \\language-pack-gnome-ru-base language-selector-gnome libgail18 libgail18 \\libgail-common libgail-common libgnome-autoar-0-0 libgnome-bluetooth13 \\libgnome-desktop-3-19 libgnome-games-support-1-3 libgnome-games-support-common \\libgnomekbd8 libgnomekbd-common libgnome-menu-3-0 libgnome-todo libgoa-1.0-0b \\libgoa-1.0-common libpam-gnome-keyring libsoup-gnome2.4-1 libsoup-gnome2.4-1 \\nautilus-extension-gnome-terminal pinentry-gnome3 yaru-theme-gnome-shellsudo apt purge gnome-getting-started-docs gnome-getting-started-docs-ru acme.sh 申请证书 Google domain，参考 Google Ca acme.sh --set-default-ca --server google 页面获得 eab-kid eab-hmac-key acme.sh --register-account letsencrypt CA，acme.sh --set-default-ca --server letsencrypt 页面获得 API-Token，export GOOGLEDOMAINS_ACCESS_TOKEN=”获得的 token” acme.sh --issue --dns dns_googledomains -d synrst.de -d *.synrst.de -k ec-384 安装 acme.sh --install-cert -d synrst.de -d *.synrst.de --ecc --key-file /etc/XXX/server.key --fullchain-file /etc/XXX/server.crt --reloadcmd &quot;systemctl force-reload nginx&quot; 其它命令，官方文档 删除证书 acme.sh --remove -d synrst.de -d *.synrst.de，之后按提示删除文件夹（正常还应该 revoke） 强制 renew acme.sh --renew -d synrst.de -d *.synrst.de --force --ecc 查看证书 openssl x509 -text -noout -in xxx.cer 查看 acme.sh --list，crontab -l 科学上网加速 BBR Plus 加速，区别对比 CDN 加速 v2ray 域名 -&gt; cdn -&gt; vps ip 在域名上配置 NS 接入：nameserver 配置成 cloudfare CNAME/IP 接入：v2ray 域名 -&gt; cdn ip/域名，域名则添加 CNAME，IP 则添加 A 记录。这是为了配合 DNSPod 不同城市线路用不同的 CDN IP，例子，感觉是给机场接入用的，个人 NS 接入即可，例子 在 CDN 配置 ：v2ray 域名 -&gt; vps ip（回源地址） 1.12 screen .screenrc 文件，参考 How To Use Linux Screen 和 Screen User’s Manual 1234567891011121314151617181920212223242526272829startup_message off# Disable visual bell# vbell off# Set scrollback buffer to 10000defscrollback 10000# https://superuser.com/questions/506080/screen-divider-border-width-and-colorcaption string &quot;%{= dd} &quot;rendition so &quot;=&quot;# https://stackoverflow.com/questions/359109/using-the-scrollwheel-in-gnu-screentermcapinfo xterm* ti@:te@# 内存部分参考 https://stackoverflow.com/questions/18439129/system-loads-in-gnu-screens-hardstatus-linehardstatus alwayslastline# backtick 1 1 1 /bin/bash -c 'free | grep Mem | awk '\\''{printf(&quot;%.1f%%&quot;, $3/$2 * 100.0)}'\\'' 'backtick 1 1 1 /bin/bash -c 'free | grep Mem | awk '\\''{printf(&quot;%.1f%%&quot;, 100 - $7/$2 * 100.0)}'\\'' 'hardstatus string &quot;%{= KG} %-Lw%{= bW}%n%f %t%{-}%+Lw %=%{= Kg}| %c %{-}%l %1`&quot;# 给 Windows terminal 用的浅色主题 AtomOneLight https://windowsterminalthemes.dev/# hardstatus string &quot;%{= wG} %-Lw%{= bW}%n%f %t%{-}%+Lw %=%{= wg}| %c %{-}%l %1`&quot;# focus ctrl+a tab，other ctrl+a ctrl+a# 推荐在左侧标签按键，这样右侧标签分到屏幕右侧，按键焦点留在左侧bind v eval &quot;split -v&quot; focus other focus# 这个配置焦点在右侧# bind v eval &quot;split -v&quot; focus otherbind x remove screen 状态栏显示正在执行的命令或当前路径，参考 bash .screenrc 文件 12# shelltitle | 前面的 ] 表示提示符结尾shelltitle ']|bash' .bashrc 文件 123if [[ $TERM == screen* ]]; then PROMPT_COMMAND='echo -ne &quot;\\033k\\033\\0134\\033k[`basename ${PWD}`]\\033\\0134&quot;'fi zsh，参考1、参考2 1234567891011121314setopt extendedglobif [[ $TERM == screen* ]]; then precmd () { local dir=$(print -Pn &quot;%c&quot;) print -Pn &quot;\\ek$dir\\e\\\\&quot; } preexec () { local dir=$(print -Pn &quot;%c&quot;) # 截短是为了留空间显示 CMD dir=$dir[1,6] local CMD=${1[(wr)^(sudo|*=*|-*)]} print -Pn &quot;\\ek$dir] ${CMD}\\e\\\\&quot; }fi 相关手册 %c ^(=|sudo|-*) [wr] 的含义 Subscript Flags 常用按键/命令 常用按键/命令 含义 screen 创建启动后 SecureCRT 要调整一下窗口 screen -ls 查看 ctrl + a d detach screen -x Attach to a session which is already attached与 -r 相比推荐这种，可加到 .bashrc 实现登录就在 screen 中 screen -r attach ctrl + a c create 窗口 ctrl + a k kill 窗口 ctrl + a 数字 切换到该窗口 ctrl + a ctrl + a 切换到刚刚的窗口 ctrl + a p/n 切换到前一个、后一个窗口 ctrl + a :number 数字 重命名窗口以调整窗口在下方的显示顺序 上面的自定义按键 ctrl + a v 分 region ctrl + a x 关 region ctrl + a tab 切 region 2 使用软件问题见 linux软件编译、安装、运行 2.1 基础 Linux工具快速教程 2.1.1 修改 linux 用户名123456# 退出所有登录（包括 SSH）# Ctrl+Alt+F2 以 root 登录# 修改用户名usermod -c “Full name real” -l new_name old_name# 修改 homeusermod -d /home/newHomeDir -m newUsername 2.1.2 bash 快捷键 123456789101112Ctrl + r – search the history backwardsCtrl + g – escape from history searching modeCTRL + A = the beginning of the lineCTRL + E = the end of the lineALT + B = move backward one word ALT + F = move forward one word/* 所有的 ALT 可换成 ESC */Ctrl + U = Delete left of the cursorCtrl + K = Delete right of the cursorCtrl + W = Delete word on the leftALT + D = Delete word on the rightCtrl + Y = Paste Terminal input sequences 2.1.3 zsh 粘贴 kali .zshrc 命令提示 sudo apt install zsh-autosuggestions 参考配置 screen 2.1.4 脚本 shell 脚本调试12345678910111213141516171819202122232425262728293031323334353637383940-------- bash ---------export SHELLOPTS# 还可配合 FUNCNAME 实现调用栈打印export PS4='[${BASH_SOURCE[0]}-$LINENO] '# 可考虑去掉 euset -eux# 确认set -o# 还原set +eux-------- zsh ---------# https://stackoverflow.com/questions/56137084/zsh-inherit-xtrace-option# 利用 $ZDOTDIR/.zshenv# https://stackoverflow.com/questions/9901210/bash-source0-equivalent-in-zsh-- 注意：下面的所有方法在应对 source（即 .） 引入脚本时，不会更新文件名，此时从感兴趣的位置向上找到最近 source 的几个脚本，一般就是那里 --# 定义 MyShellOpts 开启调试，可考虑去掉 euexport MyShellOpts=-eux-------- ash ---------#!/bin/busybox sh# 这个脚本保存为 sh 替换 /bin/sh# 替换方法，确保 /bin/sh 为指向 /bin/dash 的软链接# sudo chmod --reference=/bin/sh sh# sudo chown --reference=/bin/sh sh# sudo cp --remove-destination sh /bin/shexport PS4='[$0-$LINENO] '/bin/busybox sh $MyShellOpts &quot;$@&quot;-------- dash或其它类似 shell ---------#!/bin/dash# 与上面一样，这个脚本保存为 sh 替换 /bin/sh# $LINENO 存在也可加到 PS4 里，不存在则参考 Workaround for shells without LINENO# https://stackoverflow.com/questions/17804007/how-to-show-line-number-when-executing-bash-script# 还原，cd /bin &amp;&amp; sudo ln -f -s dash shexport PS4='[$0] '# 可考虑去掉 eu/bin/dash $MyShellOpts &quot;$@&quot; 不论在那个路径下运行都得到脚本的路径123# 不论在那个路径下运行都得到脚本的路径# 获取当前脚本路径SCRIPT_DIR=&quot;$( cd &quot;$( dirname &quot;${BASH_SOURCE[0]}&quot; )&quot; &amp;&gt; /dev/null &amp;&amp; pwd )&quot; 2.1.5 nc 推荐安装 nc openbsd 版本，apt install netcat-openbsd 2.1.6 curl123456# FTP 下载curl ftp://user:pass@192.168.7.29/code/pdt-toolchains/src/tin -o /mnt/internal_storage/tin# FTP 上传curl -T /etc/profile ftp://user:pass@192.168.7.29/code/profile# 与 docker 通信sudo curl -v -H 'User-Agent:' -H 'Accept:' -s --unix-socket /var/run/docker.sock http://localhost/v1.41/containers/json?all=true | jq .[0] 2.1.7 查找文件1234567find /media/d/ -type f -size +50M ! \\( -name &quot;*deb&quot; -o -name &quot;*vmdk&quot; \\)# 删除前去掉 delete 进行确认find . -type f ! \\( -name '*.cpp' -o -name '*.h' \\) -delete# 跳过隐藏文件find . -not -path '*/\\.*' -type f ! \\( -name '*.cpp' -o -name '*.h' -o -name '*.txt' \\)# 先创建与源码相同的目录结构再拷贝文件，拷贝文件时忽略某些文件夹下的文件和源码find . \\( -type d -exec mkdir -p '../gatebox_work/{}' \\; -o -type f ! \\( -path './.git/*' -o -path '*/GmSSL/*' -o -path '*/.idea/*' -o -path '*/.vscode/*' -o -name '*.c' -o -name '*.h' -o -name '*.o' -o -name '*.log' -o -iname makefile \\) -exec cp '{}' '../gatebox_work/{}' \\; \\) 2.1.8 磁盘占用统计1sudo apt install qdirstat 2.1.9 cron 常见 cron 写法，计算 cron 下次执行时间 crontab -e 编辑，cron 会检测 crontab 的更新，自动用最新配置 select-editor 改变默认编辑器 2.2 网络 wireguard 看介绍视频，详细的配置方法，注意区分 server 和 peer client 对已经有配置文件的，sudo apt install wireguard resolvconf，将配置保存到 /etc/wireguard/wg0.conf，然后 sudo wg-quick up wg0 clash_for_windows linux 版，手动安装服务方法，网关模式 网速占用统计 apt 安装 nethogs 3 备份与还原考虑到经常环境经常变动，所以有必要学习linux的备份和还原技术。 3.1 系统备份备份脚本 rsync-incremental-backup 注意 rsync 的 exclude 将 源路径 视为 根，因此 exclude 指定的路径都是相对 源路径 来说的，具体可以建立几个测试文件，用 dry-run 的方式验证。恢复的脚本要自己写了，如果进不了系统就用 ubuntu 的安装 U 盘恢复。 下一步可以配合 cron 实现自动定期备份，配合 ssh 实现远端备份 3.2 启动备份多系统的启动管理。每个硬盘一个 MBR，每个系统分区都有个 boot sector，两个位置都会安装 bootloader 多系统启动方式如下，MBR 的 bootloader 可以转交给其它分区的 bootloader，即 chainload 下一步可以查看 grub2 的帮助文档，以及用 dd 备份 bootloader 的方法。还原的方法则使用 ubuntu 的 安装U 盘即可。另为 ubuntu 提供了 Boot-Repair 工具。 参考 鸟哥备份 鸟哥 rsync Incremental Backups on Linux Rsync full system backup import mermaid from 'https://cdn.jsdelivr.net/npm/mermaid/dist/mermaid.esm.min.mjs'; mermaid.initialize({startOnLoad: true, flowchart: {curve: 'linear'}});","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/2.%20%E5%A4%84%E7%90%86%E5%B9%B3%E5%8F%B0/linux/"},{"title":"手机_电视_平板","text":"1 ADB 卸载系统 App 开发者选项，开启 USB 调试 安装 USB driver 下载 ADB 工具 2、3 放入 windows 建议安装 - ADB 中 获取包名，打开 App，输入 adb shell dumpsys window | findstr mCurrentFocus 列出包，adb shell pm list packages 恢复方法 adb shell cmd package install-existing com.huawei.appmarket Andrioid 11无线调试 打开 usb 调试和无线调试 adb pair HOST[:PORT] [PAIRING CODE] adb connect 192.168.1.xxx:xxx // 注意端口和上门的配对端口不一样，无线调试的IP地址及端口 华为 123456789101112131415161718192021adb shell pm uninstall --user 0 com.android.mediacenter 音乐adb shell pm uninstall --user 0 com.huawei.himovie 视频adb shell pm uninstall --user 0 com.huawei.wallet 钱包adb shell pm uninstall --user 0 com.huawei.search 搜索adb shell pm uninstall --user 0 com.huawei.hwread.al 阅读adb shell pm uninstall --user 0 com.huawei.browser 浏览器adb shell pm uninstall --user 0 com.huawei.vassistant 语音助手。不建议删，开启可支持 AI 字幕adb shell pm uninstall --user 0 com.huawei.scanner 智慧视觉adb shell pm uninstall --user 0 com.huawei.intelligent 智能助手adb shell pm uninstall --user 0 com.huawei.android.pushagent 推送服务adb shell pm uninstall --user 0 com.huawei.tips 智能提醒adb shell pm uninstall --user 0 com.baidu.input_huawei 百度输入法华为版adb shell pm uninstall --user 0 com.huawei.hitouch 智慧识屏adb shell pm uninstall --user 0 com.huawei.hiaction 智能识屏中控模块adb shell pm uninstall --user 0 com.huawei.hiai 智慧引擎adb shell pm uninstall --user 0 com.huawei.recsys (HwHiAIDSEngine)adb shell pm uninstall --user 0 com.huawei.pengine 智能建议adb shell pm uninstall --user 0 com.huawei.phoneservice 我的华为adb shell pm uninstall --user 0 com.android.contacts 联系人adb shell pm disable-user com.huawei.android.hwouc 关闭系统更新，先清除数据，进入更新消除红点。disable-user 换成 enble 启用adb shell pm disable-user com.huawei.hwid (HMS Core) 小米，参考 12345678910111213141516adb shell pm uninstall --user 0 com.miui.systemAdSolution （小米系统广告解决方案，必删）adb shell pm uninstall --user 0 com.miui.analytics （小米广告分析，必删）adb shell pm uninstall --user 0 com.miui.player （小米音乐）adb shell pm uninstall --user 0 com.miui.video （小米视频）adb shell pm uninstall --user 0 com.miui.videoplayeradb shell pm uninstall --user 0 com.android.thememanager （个性主题管理）adb shell pm uninstall --user 0 com.miui.translation.youdao （有道翻译）adb shell pm uninstall --user 0 com.miui.translation.kingsoft （金山翻译）adb shell pm uninstall --user 0 com.android.quicksearchbox （搜索）adb shell pm uninstall --user 0 com.android.browser （浏览器）adb shell pm uninstall --user 0 com.miui.voiceassist （小爱同学）adb shell pm uninstall --user 0 com.miui.miservice （服务与反馈）健康只能 disableadb shellpm disable-user --user 0 com.mi.healthpm enable com.mi.health oppo a57t 123456adb shell pm uninstall --user 0 com.oppo.usercenteradb shell pm uninstall --user 0 com.android.emailadb shell pm uninstall --user 0 com.oppo.musicadb shell pm uninstall --user 0 com.nearme.themespaceadb shell pm uninstall --user 0 com.nearme.themespacelibadb shell pm uninstall --user 0 com.nearme.gamecenter 2 Android2.1 验机 二手购机指南、升级版验货宝 重置设备 小米输入 *#*#6484#*#* 测试功能 验机参考视频，也可以参考苹果的 二手验机流程 安兔兔 和 鲁大师的验机也可以参考，但这两个 App 的验机一直出现网络问题 安兔兔 里面有根据 IMEI 查询机器信息 安兔兔 里面有测试电池损耗，测电池前可以长时间录像放电，参照 iPhone 测试稳定性 小米自带的电池健康度 去测速网站测试网速 Geekbench 6 测试 CPU 性能，并与网上相应手机型号的数值对比 2.2 小米 note 3 先申请解锁，解锁工具和刷入 twrp 时用旧电脑，新电脑 fastboot 有问题 EU 版 MIUI 12 和 twrp，这是最后一版 3 Iphone3.1 验机 二手购机指南、升级版验货宝 造假方式 参考 从收到快递开始，一直用摄像头录像 设备检测，二手验机流程 爱思、鲨漏的验机报告，包括专业报告 二手回收价格也可以从这里查到 淘宝 GSX 花 4.8 查询 有锁机，通过 IMEI 查是否 clean，也就是是否欠费、被偷等，如果 clean 就可以官解 气密性，只能从 sim 卡槽吹气大致看一下，不够准确 电池容量检测，软件 在这 下，可多测几次 3.2 卡贴 解锁模式分为 TMSI 和 QPE，QPE 是 12 以上使用，耗电多，还要配合 esim 或另一张卡，因此两种模式都可以的话优先用 TMSI 另外还有 ICCID 黑解 TMSI 解锁时，变换位置会出现没信号的间隔，所以适合大部分时间位置固定的场景 运营商分两种情况，电信方便（先插原来的卡，再插卡贴 + 卡），联通、移动需要 卡 IPCC 联通、移动要保存 IPCC，可巨魔后用 IPCC Replacer，去抖音上搜索教程 卡 IPCC 最后的重启资源库还可以使用 快捷指令。利用 Bug 的话不同 ios 版本有细微区别 卡贴使用 使用时，必须忘记已经连接的 WIFI 热点，即只使用移动数据 弹出菜单时，对于 se2 是英特尔基带，因此卡贴解锁选择，英特尔 XR-11，然后 T-mobile LTE。开启数据漫游、VoLTE 对于联通、移动，接着用上面的卡 IPCC 方法获得 4G，电信则直接有 4G 卡贴不要频繁拿下，容易损坏芯片 手动进入菜单 激活界面，Home 键，选择紧急拨号时，拨打 # 号弹出选择菜单（也可能是 * 号，不同卡贴不一样） 蜂窝网络 – SIM 卡应用程序 4 Google play目前小米和华为对 google 的支持都比较麻烦，谨慎升级系统，或者换到国际版系统 4.1 小米 准备 参考 怎么刷MIUI国际版Rom？ 按电源键 + 音量上键进入 recovery，长按电源键 + 音量下键进入 fastboot 备份微信聊天记录，进行桌面和其它内容的云同步 解锁手机，需要进入开发者模式 – 设备解锁状态，等 7 天 刷入 recovery 参考 Installing a Custom Recovery ，下 fastboot 和 对应设备的 twrp，进 fastboot，刷 twrp 不同设备有区别，见参考 装小米驱动后 fastboot 仍可能找不到设备，参考这个。在设备管理器中，驱动更新选择 “从计算机的设备驱动列表中选择” – Android Phone – Android bootloader interface，忽略安装警告 TWRP-3.3.0-0421-XIAOMI9SE-CN-wzsx150-fastboot.7z 是旧版备份 三清(Dalvik/Cache/Data)后，（降级或第一次刷）刷入前清除 data 分区，recovery 刷入 eu 版 。刷机双清、三清、四清 对于 E30004: This package is for &quot;grus&quot; devices; this is a &quot;&quot; ，输入命令 setprop ro.product.device grus 和 setprop ro.build.product grus，见 K60 在最后会报挂载的 3 个错误，目前看没问题 最新的澎湃 android 14 使用 fastboot 刷入 23.11.8 （具体参考这个链接，用 update 脚本，不用格式化），文件名 xiaomi.eu_multi_MONDRIAN_OS1.0.23.11.8.DEV_os1-14.zip，因为 Storage encryption in TWRP does not work on Android 14 so we recommend to use fastboot method magisk root 方式也不用下面的 zip 方式，而是 Magisk App 来 patch 刷机解压出的 boot.img，再用 fastboot 刷入，参考1、官方参考 12345678910# 安装 magisk apk# 从线刷包里面找到 boot.img# 进magisk app生成 patch img# adb shell 修改patch文件名称# 拷贝到电脑adb pull sdcard/Download/magisk_patched.img# https://sspai.com/post/67932adb reboot bootloaderfastboot boot magisk_patched.imgfastboot flash boot magisk_patched.img 更新：目前可以 recovery 刷入了，文件在 k60\\miflash_unlock_en_7.6.727.43 safetynet，参考1、参考2、参考3 下载 清除 3 个 App 的数据后重启，Google Play Services, Google Play Store and Google Services Framework 用 SPIC 校验时要多试几次，用 Google Play 下载时也要多试几次，有时成功有时失败 关闭 play 商店的自动更新 联网后用小米账户解锁，设置 WIFI 局域网代理从而可以登录 Google 账号，参考 在 recovery 刷入 magisk，官网下载 apk 文件（不是 zip，zip 是源码），然后重命名为 zip 文件后刷入 Magisk 隐藏应用名 打开排除列表 DenyList（Zygisk 下面），选上所有银行 App App 安装 除Win外软件\\手机\\mi9se 里面的小米应用商店、MX 播放器、系统应用删除 删除系统应用，视频、音乐、搜索、服务与反馈、浏览器 使用云同步恢复应用，Google Play 恢复应用 设置 magisk hide 等金融 App，同时选择隐藏 Magisk 包名 字体修改，默认 nato sans 在同一个作者中的找到 milan pro 安装并应用 不要用自带应用商店更新天气，会导致天气打不开 为了让 JuiceSSH 输入中文，用手心输入法，并禁止联网，apk 已备份 通过 Magisk 模块 解决，没有公交卡、短信通知类不归类、电话没有来电识别，配置文件 MiuiEuLocalization.ini 已备份 LSP + Shamiko Magisk 刷入 启用 zygisk 关闭“遵守排除列表” 配置排除列表 关闭 play 商店自动更新，关闭小米应用商店自动更新 微信 用 wechat play 版体积更小 搜索 rec 打开深度清理，然后进入通用里面清理缓存 最终方法是备份聊天记录后还原 开启青少年模式、关怀模式去除公众号广告 4.2 华为安装 google play 见 除Win外软件\\华为M6 参考 这个视频，卸载当前版本”备份“，安装旧版本”备份“，恢复”谷歌服务助手“，激活后重启 时间改到 19 年（ 是否可以不改？），顺序安装 1-5，关键的帐户管理器，使用另一个视频中的，登录不上去重启一下。安装时所有 App 的权限都勾上 安装服务框架 关注视频账号的最新更新，没事不升级华为该死的系统 现在将应用商店地区切换到 中国香港，安装 Gspace，然后在里面就可以登陆 Google 账号，安装 Google play 应用了，参考 4.3 应用购买 中国区不能购买应用，使用 US Fake Address Generator 添加生成的美国地址（目前在用的见 prsnl），信用卡使用 VISA 挂美国代理，在页面中切换为美国区。删除旧的中国地址 信用卡会扣 1 美元测试，一段时间后自动退款 5 手机 App5.1 抓包 文件存到 HttpCanary_3.3.5.apk抓包.zip，按这个说明使用 安卓14 + HttpCanary 抓包设置 主要解决“系统证书”和“目标App使用固定证书”两个问题 6 盒子类6.1 极米Z4X花 50 买的这个固件 [小林固件]极米Z4X第三方官改，极致精简、去广告、ROOT，当贝桌面版，无法切换信号源。因为只有极米桌面才有信号源功能。联系卖家 QQ 群后，给了我新的固件，使用极米原版的 Launcher，且没 root。以后再也不买这种垃圾，还不如自己 root 后删系统应用呢。好像不 root 能用 ADB 也可以。 刷入上面提到的小林固件，jimi-z4-root-dangbei.zip 安装 3C All-in-One Toolbox-Pro-v2.2.2c_build_200111-Mod-armeabi-v7a.apk 和极米桌面 用 3C 删掉当贝的那堆垃圾，其它系统应用也可以删，可以只留系统设置和无线投屏 配置极米桌面，删掉不用的栏目 用 3C ，应用管理 - 极米桌面 - 打开 - Open external Directory，删掉 cache 文件夹里面的内容，同时去掉 cache 的写入权限，这样极米桌面就没有下载的图片了 不要用这个。用 3C ，应用管理 - 极米桌面 - 打开 - 打开数据目录，databases 中的 okgo_server.db 如果被去掉所有权限，就能做到桌面上什么都没有，信号源功能还可用。原本打算这样然后再装一个 TV Launcher，但尝试后发现，在 Top_TV_Launcher 中无法看到极米桌面（其它 Launcher 也看不到），而不启动极米桌面就无法使用信号源，╮（╯＿╰）╭ 。而且使用其它 Launcher 再启动极米桌面会有一段延迟。看来只能是有裁剪的极米桌面才能达到我想要的效果 固件和 Apk 的共享链接提取码：echo 技巧 更新到旧版本前，在现有版本中，忘记无线网络，避免联网后自动更新和下载广告 在官方版本中，将g 后缀文件 6.2 玩客云 可以弄成游戏机、openwrt、armbian，多数选择 armbian，在 这里 下载 下载版本选择，因为 这个 选择 current，这个 选择 jammy （即 Ubuntu，更熟悉） 和 burn，最终是 Armbian-unofficial_24.5.0-trunk_Onecloud_jammy_current_6.6.21_minimal.burn.img 总体流程参考 这个 刷机操作参考 这个视频，用 Amlogic USB Burning Tool v2.1.6.8 版本，刷机时出错，用 USB 2.0 接口，多试几次，换旧电脑 短接触点时用镊子，短接成功时 LED 灯不会亮，并且有滴滴声 刷机完成后，换源，改时区，注意 ubuntu 22.04 的 armhf 源是 这个，url 中要有 ubuntu-ports /root 下新建 .profile，内容如下，为了让连接 ssh 后 .bashrc 能自动执行，参考 1234567# if running bashif [ -n &quot;$BASH_VERSION&quot; ]; then # include .bashrc if it exists if [ -f &quot;$HOME/.bashrc&quot; ]; then . &quot;$HOME/.bashrc&quot; fifi 装 casaos， wget -qO- https://get.casaos.io | bash 使用技巧 使用录播姬容器 镜像 cookie 从 BBDown 中获取，避免失效快 记录弹幕，不记录原始信息 装 biliup 由于没有 arm32 位 docker 比较麻烦，安装如下 123456apt install libxml2-dev libxslt-dev build-essential python3-dev libffi-dev zlib1g-dev libjpeg-devapt install python3.10-venvpython3 -m venv venvsource venv/bin/activateTMPDIR=/root/tmp pc pip3 install biliup 6.3 N1 盒子 网心云刷 armbian，先救砖回到 android，然后再刷，以下是救砖方法，注意别勾选擦除 bootloader、flash 参考 1、参考 2 刷机文件 来源，根据表格选 s905d，参照玩客云选 jammy，即 ubuntu 22.04，但发现没法识别无线网卡，改成 Ubuntu 24.04 noble，Armbian_24.5.0_amlogic_s905d_noble_6.1.84_server_2024.04.08.img.gz 下载解压用 Rufus 烧录 img 文件到 U 盘（用的 MBR 分区表），插上 U 盘就会从 U 盘启动（如果是盒子可能要借助 ADB），同时插上 USB 键盘和 HDMI 显示器 参照 说明页面，刷入 armbian-install，选 101 即 101 s905d Phicomm-N1，文件系统选的 ext4 刷入后配置 wifi armbian-config ，Network – WIFI，看不到 WIFI 选项说明没驱动 联网后，可以 ssh 登录，不需要 HDMI 连接了 armbian-apt 选择清华源 刷回 android 的方法整理，未测试 方法一 清除 boot 分区进入线刷，为了免拆机， 参考一、参考二 方法二 ddbr，参考一、参考二 注意 Tools 链接 7 平板 使用 kiwi browser 和 bypass-paywalls-chrome-clean，在 releases 中找到专门给 kiwi 的 crx，打开开发模式后装入 常用媒体 ap、nyt、wsj、Economist、wired 7.1 华为 M6 华为M6锁定后台 任务切换视图，下滑锁定（下滑时间长一点） 应用启动管理，改为手动，允许后台活动 电池优化，不允许优化 开放相应的权限 清理生成的 hwbk 文件，参考 先 adb pm uninstall --user 0 com.huawei.systemserver 再用 MiXplorer 重命名所有要删除的文件 最后用 MiXplorer 删除改名后的文件和所在文件夹 7.2 kindle fire 使用美国亚马逊账户登陆，否则没有应用商店，如果已经用中国账户登陆可以重置，并在账户中删除设备。安装完 netflix 后，可以切换到中国区账户，方便接收文档 实际测试，只要注销中国区并用美国账户登录，应用商店即可转区，不需要重置设备 开启 usb 调试，使用 Fire Toolbox V12.0 去广告、换 launcher、装 Google Play、隐藏底部导航条、去除自带应用 1234561. 清除 download failed 提示adb shell dumpsys notification，获得通知 app 的名称为 com.android.providers.downloadsadb shell pm disable-user com.android.providers.downloadsadb shell pm enable com.android.providers.downloads2. disable search 应用adb shell pm disable-user com.android.quicksearchbox 7.3 文石 BOOX Poke2 在应用设置中选择安装 谷歌套件 需要有 GSF ID 认证的步骤，否则会提示未获得保护机制认证，操作见 boox应用技巧：googleplay的设置和绑定 添加词典，在 dicts 中新建词典名称文件夹，拷入词典，拔出数据线，操作见，词典文件与欧路共用简明英汉 V2 引擎关闭会导致有的图书看不到目录 8 WSA 解决 WSA 占用 C 盘空间过大，移动到其它盘，参考 mklink /J &quot;C:\\Users\\用户名\\AppData\\Local\\Packages\\MicrosoftCorporationII.WindowsSubsystemForAndroid_8wekyb3d8bbwe\\LocalCache&quot; &quot;D:\\LocalCache&quot; 9 App 名称 用处 FolderSync Pro 用于 Google Drive 同步文件，也支持其它网盘服务选择同步到本地，同步选项开启同步删除操作poke2 要安装 chrome 浏览器才能弹出授权","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/2.%20%E5%A4%84%E7%90%86%E5%B9%B3%E5%8F%B0/%E6%89%8B%E6%9C%BA_%E7%94%B5%E8%A7%86_%E5%B9%B3%E6%9D%BF/"},{"title":"新闻来源","text":"1 新闻 为了平衡东西方的价值观冲突和中美利益冲突，选择两派中最中立的媒体作为新闻来源 Least Biased 且 Factual Reporting 为 High 以上作为初筛，以新疆、香港额外考察对中国的报道 考察内容 是否涵盖了关心的内容 报道内容是否真实 提出观点时是否引用证据（事实），是否充分给出反方观点、证据，语气、用词是否中性 媒体资金来源 新闻自由程度 西方 东方 中国 事实 apnews/reuters asiatimes/channelnewsasia 新华社/人民网/外交部 观点 Carnegie Endowment/Harvard Gazette/Belfer Center asiatimes 中国现代国际关系研究院 (CICIR)/北京大学国际战略研究院 (IISS) 观点数量少，是阅读材料，事实数量多，用来求证观点时再主动查询 中国观点部分参考 2020 Global Go To Think Tank Index Report 排名，添加第一的中国与中国大学智库 中文博客/播客额外补充个人视角，比如新闻实验室。Youtube 的 台湾公视新闻 关键是了解背后 代表的利益，如此即便阅读“环球时报”和“观察者”也不会产生误解 1.1 工具选择 为解决新闻真实和中立性问题，使用 RSS 选择可靠的信息来源，不使用任何新闻客户端 自建 RSS 服务，有费用、维护问题，使用复杂违背 RSS 初衷 付费 RSS 服务，收费高，不认可某些功能应订阅付费，免费版广告违背 RSS 初衷 自建和付费的 TTS、翻译优势与 rss 转 kindle 方式不明显，且 rss 转 kindle 提供输出全文功能 所以最终仍使用 rss 转 kindle 发送的方式，使用 amazon 免费同步 android 平板使用静读天下 Moon+ Reader Pro 2 系统学习 目的找到该学科排名靠前的大学的 syllabus ，工具 harvard 课程 搜索1、搜索2 也可以考虑以 google scholar 的排名作为切入点 harvard DPI-415 Comparative Politics &amp; Policy 的 syllabus 选择 Daniele Caramani. Comparative Politics. 5th 作为阅读书籍 harvard GOVT E-40 International Conflict and Cooperation 的 syllabus 选择 World Politics: Interests, Interactions, and Institutions. 4th 作为阅读书籍 harvard GOVT E-­20 Introduction to Comparative Politics 2015 年教材，选择 Comparative Politics Today 11th 作为辅助 3 新闻观察3.1 模版 用时： 正 反 事实 得出推理 个人总结","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/1.%20%E6%9D%A5%E6%BA%90%E4%B8%8E%E6%94%B6%E9%9B%86/%E6%96%B0%E9%97%BB%E6%9D%A5%E6%BA%90/"},{"title":"快思慢想","text":"1 序言 给予人们一组帮助诊断错误的词汇，就像医生诊断病情一样，相互纠正错误。系统 1 是不自觉的。语言学习、语法是有直觉的，而即使统计学家对统计也没有直觉，只根据能否想起来来判断，因此媒体起到很大作用 Amos 和作者以互相出题的方式快速形成理论框架（先直觉判断，不求证），性格互补，过程有趣，导致他们的研究逐渐趋于完美 两人发现一些系统性错误，与之前人们归因于情绪不同。同时因为运气，给出了实验过程从而读者可以轻易验证认知错误，使得该论文流行。人们容易忽视运气和未知，高估对世界的了解 系统 1 的专家直觉，无非是识别暗示 cue，通过暗示找到记忆中的信息，根据信息来操作。如同从声音中识别愤怒、注意到马路上的车辆一样，只不过这些太常见所以不感到奇怪 在没有专家直觉时，系统 1 发生问题替换，或使用系统 2。系统 1 指快思考，同时包括环境评估、记忆、感知、联想、直觉 书中不介绍两人成果，而介绍近期认知和社会心理学关于系统 1 的成果。简要介绍各章内容，附录里有两篇简单的论文 2 系统 1 特点在 Part1 结束，以下特点帮助产生对系统 1 的直觉（个人观点：从而避免犯错） 不费力，技能直觉 环境评估，识别不和谐（可编程） 边际递减，损失厌恶 倾向相信眼前的/刻板印象，忽略没看到的（或事情的反面） WYSIATI，夸大低概率。产生感觉、构造和谐的联想（包括因果关系），跨量度转换，困难问题替换 3 每节内容 The Characters of the Story，作者以愤怒的女人和数学问题来说明存在两种系统，系统 1 处理不费力的活动，系统 2 处理需要注意力的活动。投入注意力可以让人忽略一些事，以篮球场上黑猩猩举例。系统 1 提供给系统 2 感觉、直觉、目的的建议，但察觉到异常时激活系统 2，系统 2 通常比较懒，这种搭配在某些情况下存在问题。因此需要识别出这种情况，否定系统 1 给出的判断 illusion，作者以 Muller-Lyer 线段举例。作者以系统 1、系统 2指代两种处理模式，方便读者对两种模式形成直觉 Attention and Effort，系统 2 平时懒惰状态。Add-1、Add-3 实验，可通过瞳孔放大程度，判断系统 2 的使用率。不同于电路过载时断电，系统 2 过载时保护重要任务，忽略其它（如看不到黑猩猩）。技能熟练或有天赋时系统 2 就不那么费力。时限内完成任务、任务频繁切换能力强的，一般来说智力高 The Lazy Controller，系统 2 的精力有限，有的人系统 2 强，可以维持纪律，控制注意力与情绪，且可能与智商正相关（Keith Stanovich 认为高智商与高理性不一样）。心流状态不需要自控力（个人观点：我认为只是心理上享受着这种过程，不会 ego depletion，但仍然是 cognitive busyness，不能再做另一项系统 2 类型的任务）。饥饿、劳累、饮酒导致自控力低，以法官批准保释举例。智力不仅体现在理性逻辑上，还体现在系统 1 能否在记忆中找到相关内容，以及分配注意力的能力。自控力耗尽 ego depletion 在获得激励后可以继续，而 cognitive busyness 则无法靠努力提高，如 Add-1 这种 The Associative Machine，对于产生的联想，人会获得比真实发生轻微但一样的感受，联想像池塘落入石子的涟漪一样。prime effect，想到某事行为就会受影响，行为这么做又会影响想法，虽然影响不大，但这个影响是无法察觉的 Cognitive Ease，系统 1 会自动评估环境，放松时更有创造力，紧张时更少犯错。放松时，更容易犯错，更容易相信，比如清晰的字体、押韵的语言、好记的名字、多次重复产生的熟悉（mere exposure effect，重复发生但没有坏事发生），都会影响系统 1，系统 2 不会察觉。心情差时失去创造力。心情、动作、系统 1/2、认知轻松/紧张互相增强、互为因果 Norms, Suprises, and Causes，系统 2 可编程检测某事件，系统 1 构造的世界随着事件发生而变化，某个让人惊讶的事件再次发生就不会那样让人惊讶，作者以两次在国外遇见熟人为例。系统 1 自动根据事件给出原因，无法做统计思考。有两种模式归因，一种以灵魂为主语发出动作，另一种以物理动作来描述 A Machine for Jumping to Conclusions，信息少、环境不熟悉、金额高时使用直觉风险高。近期事件给予更多权重，信息呈现的顺序影响判断，用“第一印象”和”作者批改同一人的两个论文成绩相似“举例。为了客观，要让开会的观点独立（会前收集观点，避免被能说的人影响），证人证词独立。系统 2 可以质疑，但懒惰，系统 1 用少量信息构建出更简单的世界 How Judgments Happen，强度匹配和 mental shotgun，系统 1 通过典型来进行判断，忽略总和、数值，以竞选总统看外貌、一组线段平均值比总长更容易、给海鸥捐钱依靠情感而不管具体数量。思考像散弹枪一样会过多计算，比如要判断单词是否押韵，拼写反而会影响判断速度 Answering an Easier Question，散弹枪导致问题替换然后强度匹配，当想到约会就会影响生活幸福的评估 The Law of Small Numbers 系统 1 从因果方向思考而非统计，但有的事情只是概率而已，即便看起来像人为的。不注意样本过小得出的结论是否可靠，更在意内容是否和谐 Anchors 系统 2 的调整不足，系统 1 的 prime effect。谈判时，因为锚定先出价的人有优势，后出价的要避免被影响 The Science of Availability，系统 1 根据想起的难易程度来判断，但如果系统 1 事先知道回忆会有困难，就不会识别出不和谐或者系统 2 介入就没问题 Availability, Emotion, and Risk，灾难记忆逐渐消退导致风险逐渐低估。人群与媒体互相被塑造，导致吸引眼球（如恐怖攻击）却不那么重要（发生概率低）的事被高估。以感觉代替思考的问题替换。使用有或无的答案，忽视具体概率。政策的制定应该感性考虑公众情绪还是理性？作者认为应该专家意见和公众情绪综合考虑 Tom W’s Specialty，给出一个人的描述来判断这个人的专业，人们忽略基础概率和信息的准确性 Linda: Less Is More，处理“和”类型的问题不敏感，尤其是统计的和，概率 A = AB + A非B。可通过具体举例、直接对比来减少错误 Causes:Trump Statistics，cause 原因类型统计数据比普通数据更有吸引力，同样给出具体例子更有说服力 Regression to the mean，导致结果的可能有多个原因，其中一个原因就是随机。当因果不完全相关时，进行预测就要考虑运气，上次运气好，这次运气很可能就差，所谓回归均值。并不是每件事都有原因。对照组就是用来消除随机的 Taming Intuituive Predictions，证据的可靠性、证据与推测结果的相关性，当不完全相关时，需要以平均值 base rate 为基础结合证据来预测，即 regress to mean。特殊情况，当极端情况的损失很大时，则即便概率小也给予更大权重是合理的 The Illusion of Understanding，依赖结果来评估之前决定的对错，忽略其中的运气成分。在不知道自己无知时，事实越少越容易编出和谐的故事。hindsight，曾经想到过，只是猜测，然而当事情真的发生，就会认为自己早就想到了 The Illusion of Validity，证据越少故事越好，反馈帮助作者发现了自己的判断问题，要预测的未来太远，与当时的团体协作考核的相关性很低，即便知道这个结果人们包括作者依然会选择相信眼前，不相信统计数据。衡量是否存在 skill 的测试是 persistent achievement，这里作者以股票举例表明其中不包含技能，然而人们仍然相信自己的判断。以 Taleb 的黑天鹅举例未来难以预测。作者认为，短期未来可预测，长期的未来不能以现在事件作为推断，更不能凭借自信程度、故事和谐程度来判断。个人思考：或许可以从 Taleb 的书中找找如何以概率的方式预测未来 Intuitons Vs Formulas，专家受到系统 1 影响在预测长远时并不客观，偏向于独特个案，同时反馈通常很多年以后（所以难以发现预测错误），作者认为最终决定应当交给公式来做。作者以自己设计的新兵招募评估，以过往事实评估 6 个独立的性格特点，最终等权重求和计算出结果。该方法可推广到招聘上 Expert Intution: When Can We Trust It? 专家直觉不是魔法，只是普通的模式识别，与识别人脸一样，调取出之前的记忆和解决方案。或者因为途径某地而回想起不好的记忆。取得技能的两个要素 1. 规律可预测结果的环境，即随机很少 2. 长时间的练习，反馈越快、反馈质量越高学习越快。如果环境中随机的噪音多，此时人类预测不如算法。自信程度不能作为预测准确的判断，前面的两个要素才是，即通过此人所处环境的规律性和学习历史 The Outside View，个人观点：人们不愿接受概率一是因为不直观，二是其中包含了不完美、包含了失败的概率，尤其是当前看起来很完美时（个人观点结束）公开讨论不是收集所有人观点的好方法，而是收集每个人（作者没解释原因，记得之前提到过会给发言的人过多比重，从而引导了话题）。作者以编写教材为例说明自己忽略 base rate （这里叫 outside view）的例子，当时看起来进展顺利，但人无法预测未知的未知，容易过于乐观，预测时间越远意外越多，越需要参考类似案例的情况。此外作者反思了自己知错不改，因为沉没成本，因为是自己发起的项目，承认失败丢脸，因为没压力逼迫作者这样做。个人观点：所以我需要一个敢反对自己的朋友，当然个人也同样保持警觉 The Engine of Capitalism，人们关注自身的水平，忽略竞争对手和外部环境，导致对前景过于乐观。社会对自信持赞扬的态度也导致过于乐观。在科研上，也是乐观使人们能不断的面对失败。个人观点：如已经正确评估前景，或者在没有其它选择的情况下，即使成功概率低，也只能继续做，面对现实和乐观做事我认为并不矛盾（个人观点结束）作者给出应对过于乐观的方法，请所有人假设计划一年后失败了，给出可能的失败过程。这样可以引导所有人思考风险，且鼓励提出质疑（尤其是对领导提出的计划） Bernoulli’s Errors，经济学当时假设的人是完全理性的，与心理学不同。伯努利认为人的实际感受与钱的数量是对数关系，即边际递减，所以人们在确定的钱数与相同期望的概率钱数中，选择确定钱数（比如确定的 4 与 0.5 * 1 + 0.5 * 7 之间会选择 4） ，risk aversion。作者认为自己与 Amos 的前景理论成功有一定运气，恰好发在了经济学期刊而非心理学。他们两人拿自己做实验，可以快速提出一些假设。作者的理论补充了参考点，即在都是坏的选择（损失钱）时，人们会赌一把，risk seeking。作者认为包括自己都容易受到固有理论的思想局限，所以一直没人对 expected utility theory （伯努利的理论）提出质疑 Prospect Theory，同等金额的损失与获得的心理上的比例是 1.5-2.5 倍，评估时要区分参考点导致获得还是损失，从而使选择不同。选项1，你得到 1000，然后 0.5 赢 1000 和 确定赢 500 二选一。选项2，你得到 2000，然后 0.5 输 1000 和 确定输 500 二选一。同样都是确定 1500 和 0.5 1000 0.5 2000 的最终结果，但人们选项 1 选确定，选项 2 选赌博。前景理论的 2 个缺陷都是忽略了选项对情绪、即心理结果的影响上，第一个是对于大概率赢而没赢产生的失望，第二个是对于大的确定金额与赌博之间，选择赌博输了导致的后悔。个人观点：参考点产生的锚定，加上损失产生的强烈情绪，使人忽略更全景的评估，使富人计较小的损失 The Endowment Effect，保持现状时 lose aversion 的结果，选择不是不变的，拥有了就不想失去。用来使用的物品会有这个特点（失去比获得更难，卖出价高于买入价），用来交易的则不会。穷人也不会，因为他们所有的获得都是靠失去另一种换来的，所有买卖都是失去。有经验的交易人 Endowment Effect 更少 Bad Events，坏消息更能引起人的注意，系统 1 会评估威胁，自己不同意的观点、lose aversion 也视为威胁。为维持稳定的关系（应该指婚姻），好的互动与不好的比例至少 5:1 。没达成目标被看做损失，而超过预期后努力就会降低，因为被视为获得。协商分配利益比分配损失容易。设定一个参考点被视为一种谈判策略，因为参考点决定了是损失还是获得。得失判断也影响公平的判断，因为公司损失而降低工资或公司盈利分配给员工的利益少不被视为不公平，而通过降低工资来为公司牟利则视为不公平。公平的判断影响着经济，即经济不只由自身利益驱动，不公平的企业会受到社会的惩罚。也影响法律，法律补偿损失，但不补偿由损失而失去的盈利 The Fourfold Pattern，确定与接近确定两种情况间的心理感受与统计理论相差大，同时加上边际效应的作用，导致了 risk seeking 和 risk averse 4 种情况，大概率获得 -&gt; 厌恶风险，大概率损失 -&gt; 追求风险，小概率获得 -&gt; 追求风险 买彩票、赌博，小概率损失 -&gt; 厌恶风险 买保险。为了避免情绪对不确定的痛苦，愿意花超过统计期望的钱（个人观点：用钱买情绪或许可以理解），作者认为如果这种情况很多，那么为情绪的开销就太大，不值得。个人观点：这也是为何保险能赚钱，个人仍愿意买保险来去掉不确定性、平复情绪 Rare Events，能引起系统 1 联想的描述，导致概率被夸大，但涉及到钱时这个影响小，因为是具体的数值。可以利用这种效应，给出数字和描述来夸大，给出概率来让人忽略。而当有可能发生而从未经历过时，概率会被低估，因为系统 1 想不起来类似事件。个人观点：比如外国人会高估日本地震的概率，而处于日本的人，由于大地震发生概率低，一生都没经历过，会低估这个概率（个人观点结束）前景理论通过文字描述研究人们的选择，而通过实际经历来研究人们的选择时，对于小概率事件，人们往往低估，因为从未发生过 Risk Policies，A 得 240，B 25% 得 1000，C 失 750，D 75% 失 1000。AB 二选一，CD 二选一，多数人选 AD，然而联合比较发现 BC 更好。AD 75% 失 760，25% 得 240；BC 75% 失 750，25% 得 250。人类天性视野狭窄，选择矛盾经常出现。遇到概率选择，如果能想到一生中这种选择很多，即长远来看，从概率来看 broad frame / outside view，某一次的风险就会减弱（个人观点：类似于保险），应用这个策略有几点注意：1. 每次选择独立，比如不是投资同一领域 2. 损失不会大到无法承受 3. 胜率不会过小，以至于无法等到。指定 risk policy 即某个策略能帮助 broad frame 方式做决策，关注统计概率 Keeping Score，不愿承认失败、沉没成本，对应四象限 “大概率损失 -&gt; 追求风险” ，使人停留在失败的婚姻、工作中。当偏离常规（冒险）而有失败结果时，人会后悔，因为害怕后悔而不敢承担足够的风险。作者认为在冒险前充分考虑后果可以避免后悔，或完全不考虑后果（个人观点：这应该是对不值得在意的损失，避免浪费精力时），只有在自己感觉差一点就选对了时最后悔 Reversals，比较产生更广泛的见解 broad frame，现实中通常没有对比（个人观点：所以我们要自己找对比来产生更广泛的见解），只会与该类别下的 norm 作比较。单一评价是系统 1 的跨量度转换，而对比会使用系统 2。当然对比如果是利益相关方提供的则要警惕 Frames and Reality，系统 1 不是基于现实的，所以人的选择不能完全基于现实（个人观点：受到情感影响）。对某种情况打折，可以换种说法对另一种情况罚钱，金额一样，感受不同。90% 存活和 10% 死亡，不同表述会改变人的选择。（个人观点：所以为做出理性选择，我们要想到另一面，从更大的视野考虑问题）另一种导致选择不同的情况是系统 2 的懒惰，不愿改变默认选项。政府可以利用这个特点，制定对社会有利的政策，如默认器官捐献 Two Selves，一个是评估自我，峰终定律，忽略时长，另一是当下的体验自我。最终影响决定的是评估自我。评估自我依靠记忆，记忆是系统 1 的功能，使用典型代替整体，不求和，因此记忆未必反应真实情况 Life as a Story，评价人一生时使用平均值，峰终，不求和，只考虑故事的好坏。给一个幸福一生的人，加上 5 年不那么幸福的人生，会降低对他一生幸福的总体评价 Experienced Well-Being，少部分人口的痛苦遭遇了多数痛苦，与普通人相比疾病让极度贫穷的人更痛苦。体验自我由当时的环境决定，例外是一些频繁出现的想法（PTSD？）也影响心情，稍夸张些指是否与你爱和爱你的人相处。有钱可能影响评估自我，但不会影响体验自我。可控制自己的时间是提升幸福最简单的方法 Thinking About Life，评估自我只选取能想到的故事片段来评价人生，作者以结婚对幸福的影响图来说明，并非真的婚后幸福下降，而是结婚这件事更难被想起。体验自我也只与当时的环境有关，与是否结婚无关。评估自我的满意度与设定的目标是否达成有关。两个自我都与幸福有关。当我们想到某事时，这件事在评估中的比重被放大。买车、换居住环境，这些开始很有趣，后期无趣的事会给予过大的权重。例外是慢性病、环境噪音，因为会一直引起注意（个人观点：作者以体验自我来看，人决策时容易忽视时间的效应，应当区分出是开始有趣还是长期有益/有害的事，同时评估自我关注目标达成，以片段来编故事） Conclusions，评估自我忽略时长，与体验自我的看法未必相同。人不是完全理性，逻辑也存在矛盾，需要帮助来做出更好的决策，如在存钱养老上给予默认选择。足够的练习与反馈才会有准确的直觉，解决系统 1 错误的唯一办法，就是识别容易出错的场景，慢下来使用系统 2，识别他人的错误更容易。组织比个人更容易避免错误，制定规则，互相监督 我认为只使用系统 1 的判断是次优的，是在时间紧迫时的不得以选择 4 参考为什么独立思考这么难","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/%E5%BF%AB%E6%80%9D%E6%85%A2%E6%83%B3/"},{"title":"路由器","text":"1 刷机1.1 斐讯K2 确定硬件版本，斐讯K2 PSG1218 硬件A2 更新到官方某个版本，来实现开 telnet、ssh 刷 breed，相当于 bootloader EEPROM、编程器固件备份 刷别人的固件，华硕、padavan(hiboy)，见 刷机与固件列表，还可以考虑 自己编译 1.2 小米路由器3G 下载 开发板 miwifi_r3g_firmware_12f97_2.25.124.bin，登陆路由器页面，系统状态 -&gt; 升级检测 刷入 开 SSH miwifi_ssh.bin。按照页面提示操作 刷 breed breed-mt7621-xiaomi-r3g.bin。放入 U 盘后，mtd -r write /extdisks/sda1/breed-mt7621-xiaomi-r3g.bin Bootloader EEPROM、编程器固件备份。有线网卡 IP 192.168.1.x，断电、按住 reset、接电，路由灯狂闪的时候松开，电脑上在浏览器中输入192.168.1.1，进入 breed 控制台 刷 padavan(hiboy) 中的 MI-R3G_3.4.3.9-099.trx 参考1、参考2 1.3 红米 ac2100 原版固件网速快（500M 宽带，两级路由下面 5G WIFI 达到 610M 网速，与直连光猫拨号比少几十M网速），但功能少，无法解决二级路由下设备 IPv6 地址在 PPPoE 重拨后旧地址不消失的问题；而 OpenWrt（开 PPPoE 拨号，有线最高 430M 网速）网速慢，但插件多，支持 IPv6 PD 下发。目前 OpenWrt 固件是大分区单系统，无法双系统切换 刷 OpenWrt 参考 开 SSH。用官方修复工具降级到有漏洞版本 2.0.7 开 SSH 1234567替换 &lt;STOK&gt;http://192.168.31.1/cgi-bin/luci/;stok=&lt;STOK&gt;/api/misystem/set_config_iotdev?bssid=Xiaomi&amp;user_id=longdike&amp;ssid=-h%3B%20nvram%20set%20ssh_en%3D1%3B%20nvram%20commit%3B%20sed%20-i%20's%2Fchannel%3D.*%2Fchannel%3D%5C%22debug%5C%22%2Fg'%20%2Fetc%2Finit.d%2Fdropbear%3B%20%2Fetc%2Finit.d%2Fdropbear%20start%3Bhttp://192.168.31.1/cgi-bin/luci/;stok=&lt;STOK&gt;/api/misystem/set_config_iotdev?bssid=Xiaomi&amp;user_id=longdike&amp;ssid=-h%3B%20echo%20-e%20'admin%5Cnadmin'%20%7C%20passwd%20root%3Broot 密码 admin 刷固件 下 OpenWrt 官方固件，openwrt-22.03.0-ramips-mt7621-xiaomi_redmi-router-ac2100-squashfs-kernel1.bin、openwrt-22.03.0-ramips-mt7621-xiaomi_redmi-router-ac2100-squashfs-rootfs0.bin 两个文件用 WinSCP 传到 /tmp 下 12345678# 看当前分区cat /proc/mtdnvram set flag_try_sys1_failed=1nvram commitcd /tmpmtd write openwrt-22.03.0-ramips-mt7621-xiaomi_redmi-router-ac2100-squashfs-kernel1.bin kernel1mtd write openwrt-22.03.0-ramips-mt7621-xiaomi_redmi-router-ac2100-squashfs-rootfs0.bin rootfs0reboot 另一种 breed 法，不推荐，还原原版要先还原 bootloader 刷 Breed，scp 传到 /tmp 下，mtd -r write /tmp/breed-mt7621-xiaomi-r3g.bin Bootloader 进 Breed，固件更新，闪存布局选 OpenWrt，也可以刷老毛子 padavan，有些 padavan 能到 600M 以上，没测试 刷回原版或原版降级：如果刷过 breed，要先通过 breed 恢复原版 bootloader（原版才能用修复工具），然后修复工具刷 2.0.7（台式网卡不行，USB 网卡可以） 想一直用原版固件，借鉴 autossh 的 方法 固化 SSH，在 firewall 配置添加一个自启脚本 autossh.sh，之后就可以升级官方固件了 1234567891011121314151617# 改密码passwdmkdir /data/auto_sshcd /data/auto_ssh# WinSCP 传进来 auto_ssh.shchmod +x auto_ssh.sh./auto_ssh.sh# 应该存在 dropbear_rsa_host_keylsuci set firewall.auto_ssh=includeuci set firewall.auto_ssh.type='script'uci set firewall.auto_ssh.path='/data/auto_ssh/auto_ssh.sh'uci set firewall.auto_ssh.enabled='1'# 确认修改uci changes firewalluci commit firewall# 之后就可以更新官方固件到最新了 1.4 移动CR8808（红米AX3000) 开 ssh 进 uboot 拆两颗螺丝，撬棒打开顶盖，接上 TTL 网口朝上，从左开始依次是 电源、RXD、GND、TXD，因此从第 2 个开始依次接 TTL 模块 TXD, GND, RXD 修复工具刷 8806 固件。用笔记本的网卡（台式网卡不行，USB 网卡可以），关 defender 防火墙，禁用其它网卡，网线插 1 号 LAN 口，reset 按钮是凹进去的，别和 mesh 组网按钮搞混了 刷好后蓝灯闪烁，插电 5s 内按任意键 开启插电 5s 内任意键进串口，方便以后调试 123setenv boot_wait onsetenv uart_en 1saveenv 改 bdata.bin 12345678910111213setenv ipaddr 192.168.1.2setenv serverip 192.168.1.1# 查看分区信息smeminfo# 打开 tftpd64.exe 后选择对应IP地址，回到命令窗口输入以下命令提取 bdata 分区nand read 0x44000000 0x900000 0x80000tftpput 0x44000000 0x80000 bdata.bin# 备份后，用 WinHEX 修改 bdata.bin# 修改方法见下方 详细步骤2# 上传回去并写入tftpboot bdata.bin &amp;&amp; nand erase 0x900000 0x80000 &amp;&amp; nand write 0x44000000 0x900000 0x80000# 写入 ok 后重启reset telnet 登录，密码通过 sn（包含斜杠/） 算出 可选：开 ssh，原理是给 firewall 配置加一个新的开机启动脚本，脚本放在不会被还原的 /data 下，脚本里面每次还原 ssh 密钥（也备份到 /data 下）并启动 ssh 服务 防火墙配置部分，参考 OpenWrt firewall 用 uci 命令 配，就像 这里 的 ssh 自启动一样 1234567891011121314151617181920212223242526# 查看当前防火墙配置uci show firewall# 允许 ping 内网uci add firewall ruleuci set firewall.@rule[-1].name='Allow-ICMPv6-Forward'uci set firewall.@rule[-1].src='wan'uci set firewall.@rule[-1].dest='*'uci set firewall.@rule[-1].proto='icmp'uci add_list firewall.@rule[-1].icmp_type='echo-request'uci add_list firewall.@rule[-1].icmp_type='echo-reply'uci add_list firewall.@rule[-1].icmp_type='destination-unreachable'uci add_list firewall.@rule[-1].icmp_type='packet-too-big'uci add_list firewall.@rule[-1].icmp_type='time-exceeded'uci add_list firewall.@rule[-1].icmp_type='bad-header'uci add_list firewall.@rule[-1].icmp_type='unknown-header-type'uci set firewall.@rule[-1].limit='1000/sec'uci set firewall.@rule[-1].family='ipv6'uci set firewall.@rule[-1].target='ACCEPT'# 确认修改uci changes# 让修改生效，用 ip6tables 也能配，但重启后会丢配置uci commit firewall/etc/init.d/firewall restart# 查看配置uci show firewall.@rule[-1]cat /etc/config/firewall 参考 总体概况，2 楼内容 详细步骤1、详细步骤2 启发来源 AX3600 装插件 刷固件：在 uboot 或 ssh 里面刷，目前固件 2.4G wifi 信号不稳，刷 openwrt1、刷 openwrt2 参考 烧写代码，ubiformat /dev/mtd19 -f openwrt-ipq50xx-arm-redmi_ax3000-squashfs-nand-factory.ubi，将 OpenWrt 烧到 system2，原版在 system1，为双系统，切换系统命令如下 12345678910111213# 显示 ubi.mtd=rootfs 说明当前为 system1，ubi.mtd=rootfs_1 为 system2cat /proc/cmdline# system1 切 system2，原版切到 OpenWrtnvram set flag_last_success=1nvram set flag_boot_rootfs=1nvram commitreboot# system2 切 system1，OpenWrt 切到原版fw_setenv flag_last_success 0fw_setenv flag_boot_rootfs 0reboot 由于 ac2100 刷 openwrt 做一级路由拨号时，最大速度只有 450M，故将 CR8808 刷 openwrt 做一级路由（关 wifi，网线接二级路由，所以固件信号问题不影响），ac2100 刷回做二级路由，虽然原版 WIFI 速度快，但无法解决二级路由下设备 IPv6 地址在 PPPoE 重拨后旧地址不消失的问题（netsh interface ipv6 show siteprefixes，怀疑没有发送 RA 中 Router lifetime 为 0, Prefix information 中 Valid Lifetime 为 0 的报文，能确认 OpenWrt 发了，让旧的 prefix 失效），故也刷 OpenWrt 可改分区表 mtd1 MIBIB 实现增加 OpenWrt Flash 空间，未尝试，这样可能就是 OpenWrt 单系统，没有原版系统了 路由器无线加密方式“WPA3/WPA2”，Windows 查看是否支持 WIFI6(802.11ax) 和 WPA3 命令 netsh wlan show drivers 刷回原版或原版降级：见上面系统切换命令，原版系统已开 telnet。注意：如要用修复工具还原原版，则需要重新拆机开启 telnet 2 远程管理2.1 WOL ip 和 mac 绑定，系统和 bios 要开启对应配置 wol 网络唤醒。如关机后网口灯不亮，说明网卡断电，更新网卡驱动解决。驱动配置中，关闭环保节能和节能乙太网路 配置 花生壳内网穿透（无公网 ip，无法 ddns 和端口映射） 一个账号只能一台设备，因此已有账号则需要使用子账号的方式，方便实名认证 padavan(hiboy) 固件可能出现 /opt 目录未挂载，导致花生壳无法启动，尝试拔掉 U 盘或重启路由器，正常 /opt 挂载为 tmpfs 文件系统 也可以考虑购买开机棒，但不如买个树莓派了 手机测试使用 google play 中的 wake on lan，pc 测试使用 Wake On Lan 又名 aquilaWOL 2.2 U盘访问 页面 USB 应用程序开启 samba 后，win10 仍无法访问。运行 gpedit.msc，计算机配置 -&gt; 管理模版 -&gt; 网络 -&gt; Laman 工作站，启动不安全的来宾登录 挂载 USB 可能出现 readonly，格式化 U 盘解决 2.3 内网穿透 正向代理、反向代理、内网穿透介绍 代理作为客户端，因此可用来隐藏客户端 IP 代理作为服务器，因此可用来隐藏服务器 IP 客户端部分用 proxychains 路由器 代理服务器端开内网穿透，注意是否提供源码（目前只有花生壳）或有路由器架构的程序 转发到本地的 HTTP 代理服务器，使用 tinyproxy 下载 openwrt 交叉编译工具 对 gcc 找不到 32 位 libz.so.1，安装 sudo apt-get install zlib1g:i386 又会提示有风险的情况 手动下载包 sudo apt-get download zlib1g:i386 解压到某个目录 dpkg-deb -R *.deb tmp 通过 export LD_LIBRARY_PATH=/tmp 指定库路径运行 gcc 对于提示程序 not found 的情况，gcc -static 静态链接 libc 考虑 免费 frp 服务，为了保证内网服务的安全，应开启 TLS、STCP，为效率可开启 KCP。参考 内网渗透代理之frp的应用与改造 如从简单考虑，或内网要求严格，可识别出 frp 流量特征，可用 ssh，见 1.1.3 隧道/端口转发 3 网络3.1 IPv6 问题：一级路由 IP 前缀改变（PPPoE 重播）后，怀疑光猫配置为 DHCPv6 stateful 导致，二级路由的 IP 无法及时更新 所以联系客服光猫改桥接，用自己的路由器来控制下级，改前关闭光猫的 WIFI，确认光猫 LAN 口速率，有的光猫只有 LAN1 为千兆 和安装师傅确认，旧光猫桥接最大支持 500M，千兆网才考虑更换光猫 测速时，笔记本从本地硬盘启动系统（不从 USB 启动）接到光猫 LAN1 口，设置 PPPoE 拨号，测速1、测速2、测速3、IPv6 支持检测 联通 500M 测速，ac2100 原版固件 5G WIFI，下行 &gt; 620M，上行 &gt; 40M 一级路由用 OpenWrt 以支持 PD 下发和对 DHCPv6 的精确控制 WAN6 设置 Alias @wan LAN 开 Delegate IPv6 prefixes LAN 启用 SLAAC，DHCPv6 stateless（RA-Flags M = 0, O = 1。实测发现设置 M 也没事），因为与 DHCPv6 stateful 相比，SLAAC 在上级重新拨号地址变化时，下级路由地址能及时更新，参考 参考 Openwrt IPv6 一级路由时的配置1（以这个为主）、Openwrt IPv6 一级路由时的配置2、IPv6 二级路由器正确配置、IPv6 相关介绍 对上级不下发 PD 时（一般为校园网），二级路由器的配置 IPv6 中继是 3 层，桥接是 2 层，报文进 3 层配置的防火墙和路由才能生效，因此想简单就用中继，更细的可以只让配置包（SLAAC 与 NDP 包）走 2 层桥接 参考：中继、中继或桥接、数据包中继+配置包桥接 防火墙，配置防火墙暴露 windows 设备、配置防火墙暴露 linux 设备 token address、使用不连续掩码 像小米原生固件，没有配置界面的，可用 uci 命令来配，见 CR8808 防火墙部分 IPv6 DDNS，考虑用一个猜不到的长域名来隐藏 IP 查看上级是否下发 IPv6-PD 方法，ip -6 r，default 两条，其中一条 ::/60 3.2 ShellClash ShellClash 装在外置存储（OpenWrt 是 /mnt），订阅必须经过在线转换才能用，Nft基础/Nft混合 都可以（新版 OpenWrt 没有 iptables） clash 资源占用高，偶尔需要全局透明代理时再开启 4 无线桥接4.1 padavan（老毛子） 无线2.4GHz，无线桥接，AP 工作模式 “AP-Client + AP”，无线 AP-Client 角色 “WAN（Wireless ISP）”，选择 SSID，输入密钥 外部网络（WAN），外网连接类型 “IPoE动态 IP” 4.2 openwrt openwrt 无线桥接，master 向外发射信号，client 接收信号。openwrt 接口名、红米 ac2100 无线中继 client 模式 红米 ac2100 的固件中，无线中继后会生成接口 apcli0 (对于 5G 是 apclii0)。在接口设置中，把这个接口设置成 wan 口的物理接口，替换调原来的 eth0.1 apcli0 (wan 口) 的网关和 dns 设置成上级的 ip（如 192.168.0.1），接口 ip 设置成与上级同一网段（如 192.168.0.2） lan 口是 eth0.2、ra0、rai0 的桥接，ip 设置为内网要分配的网段，网关、dns 设为 wan 口的 ip（如 192.168.0.2） 接口设置完后可能要在无线中“重启无线”，接下来 lan 口的桥接可能又把 apcli0、apclii0 加回来了，再去掉 5 HTTP/3 TLS 1.3 TLS 握手流程 TLS 1.3 介绍、TLS 1.3 详细介绍 ESNI（目前只有 cloudflare 支持）、ECH HTTP QUIC HTTP2 HTTP3","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/2.%20%E5%A4%84%E7%90%86%E5%B9%B3%E5%8F%B0/%E8%B7%AF%E7%94%B1%E5%99%A8/"},{"title":"git","text":"1 基础初级教程、 命令总结文档、Pro Git 2nd、Pro Git 2nd（网页版） git 特点分布式，不必联网。建议文本 UTF-8 编码 安装 linux上 apt-get 或者 源码， windows版本 设置全局的用户名和邮箱，设置代理，初始化 1234567891011121314git config --global user.name &quot;Your Name&quot;# 不设置 emailgit config --global user.email '&lt;&gt;'# 支持中文路径和文件名git config --global core.quotepath false# 编辑器设为 vigit config --global core.editor &quot;vi&quot; # 查看设置git config --listgit config --global core.autocrlf false# 提交简写git config --global alias.ac '!git add -A &amp;&amp; git commit -m'# HTTP 代理git config --global http.proxy http://127.0.0.1:17890 git pull 默认取所有分支，–all 取所有 remote。git push 默认当前分支，–all 所有分支 代理，只用 ssh 协议。参考 12345678Host github.com Hostname ssh.github.com IdentityFile C:\\Users\\XXX\\.ssh\\id_ed25519 User git Port 443 ProxyCommand &quot;D:\\soft\\Git\\mingw64\\bin\\connect.exe&quot; -S 127.0.0.1:17890 %h %pHost * IdentityFile C:\\Users\\XXX\\.ssh\\id_rsa 1.1 图形工具参考 best-three-way-merge-tool，使用 p4merge 和 meld 1234567891011121314151617181920212223242526sudo apt-get install meldgit config --global diff.tool meld# 官网注册下载# 使用手册 https://www.perforce.com/manuals/p4merge/Content/P4Merge/Home-p4merge.htmlsudo ln -s /home/zack/bin/p4v-2019.1.1830398/bin/p4merge /usr/local/bin/p4mergegit config --global merge.tool p4mergecat ~/.gitconfig# 可以选择关闭git config --global difftool.prompt false# windows 下的配置，User/用户名/.gitconfig，注意路径斜杠用 /# 设置 meld 的字体时选择 Yahei Consolas Hybrid，指定英文字体时会因为没有中文字符显示乱码[http] proxy = socks5://127.0.0.1:17890[user] email = &lt;&gt; name = Jian-Feng Du[core] quotepath = false[diff] tool = meld[difftool] prompt = true[difftool &quot;meld&quot;] cmd = &quot;\\&quot;D:/soft/Meld/Meld.exe\\&quot; \\&quot;$LOCAL\\&quot; \\&quot;$REMOTE\\&quot;&quot; 受限于网速时可用 vimdiff 一些按键 关于 merge 的按键 1.2 查看修改和历史 git diff 比较的是工作区与暂存区的差异，git diff HEAD -- readme.txt 用来比较工作区与分支的差异，git diff --cached 比较暂存区与分支差异 commit 的几种表示法详见 Revision-Selection 12345678910# 查看历史提交git log --pretty='%C(yellow)%h%Creset %C(green)%cd%Creset %C(blue)%d%Creset %s' --date=format:%m-%d --graph 1.1.1^..HEAD git config --global alias.lg &quot;log --pretty='%C(yellow)%h%Creset %C(green)%cd%Creset %C(blue)%d%Creset %s' --date=format:%m-%d --graph&quot;# 找到第一个 commitgit rev-list --max-parents=0 --pretty HEAD# 查看历史修改的文件列表git diff-tree --no-commit-id --name-only -r bd61ad98# 某个文件的历史修改git log -p -- filename# 也可以使用脚本 diff_hist.sh 见资源 1.3 改写历史Rewriting-History git merge 和 git rebase 都是先切换到目标分支，然后指定源分支的方式 12# 把一个提交应用到多个分支上git cherry-pick &lt;commit id&gt; 1.4 回到过去Reset and checkout HEAD Index Workdir WD Safe? Commit Level reset --soft [commit] REF NO NO YES reset [commit] REF YES NO YES reset --hard [commit] REF YES YES NO checkout &lt;commit&gt; HEAD YES YES YES File Level reset [commit] &lt;paths&gt; NO YES NO YES checkout [commit]/index &lt;paths&gt; NO YES/NO YES NO 123# 使用远端还原本地git fetchgit checkout origin/dev -- src_comm/tiny_config.c 1.5 加快下载1234567891011# shallow clone，可以不把全部的 commit 和 branch 都下载下来，节省下载时间git clone --depth=1 urlgit clone --depth=1 --single-branch --branch branch urlgit fetch --unshallowgit fetch --depth=200# https://stackoverflow.com/questions/6802145/how-to-convert-a-git-shallow-clone-to-a-full-clonegit config remote.origin.fetch &quot;+refs/heads/*:refs/remotes/origin/*&quot;git fetch origin# 下载失败可以尝试修改git config --global http.postBuffer 524288000 2 用 subtree 管理库 不像 submodule 显示的写到 git 配置文件中，但一次 clone 就包含所有文件，管理更简单 介绍见 Git Subtree Basics、Git subtree: the alternative to Git submodule 3 问题3.1 多个远端仓库只要远端不同，同一公钥可以用在多处仓库，只有在同一网站（比如 github）上有多个账号时需要配置多个 key 3.1.1 生成新 key 按照 git配置多个SSH Key ，其中命令可以指定文件名 ssh-keygen -t rsa -b 4096 -C &quot;another_mail@qq.com&quot; -f id_rsa_github 页面上添加对应公钥 3.1.2 添加 remote12git remote add origin https://github.com/user/repo.gitgit remote -v 给 pull 和 push 设定不同的 remote 方法，这样设置的典型用途 （同一回答） 3.1.3 设置 track 分支track-remote-upstream-branch 12345678910# Set upstream when pushing to remotegit push -u origin topic# Set upstream without pushing it# with option -u / --set-upstream-togit branch -u origin/topicgit branch --set-upstream-to=origin/topic# 验证cat .git/config 3.2 个人代码同步对未改完的代码提交一个临时的 commit，两端都基于这个 commit 来改代码（使用 commit –amend）和同步，已经修改完成则将 commit message 修改或 rebase 整理历史。 参考 git-pull-after-forced-update，两端都按下面步骤进行 取回使用 git pull --rebase 来更新另一端的提交 修改代码 改写历史 git rebase -i HEAD~~ 或合并到最近的历史 git commit --amend 更新提交历史 git push -f 3.3 删除分支3 种情况，远端、本地、本地的 track 分支 Delete Git branch locally and remotely 3.4 查找谁引入的问题 git bisect 指定两个 commit 来二分查找，good/old –&gt; bad/new，详情见 git bisect 和 Fighting regressions with git bisect 辅助用 git blame 或 git log -S","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/4.%20%E5%88%86%E4%BA%AB%E4%B8%8E%E5%A4%87%E4%BB%BD/git/"},{"title":"windows","text":"1 清理旧文件删除没有权限的文件夹 文件夹属性 -&gt; 安全 -&gt; 高级 -&gt; 更改所有者 -&gt; 输入自己的用户名 -&gt; 选择下面应用到子文件夹的勾 -&gt; 确定所有对话框 文件夹属性 -&gt; 安全 -&gt; 高级 -&gt; 权限添加 -&gt; 主体为自己的用户名 -&gt; 勾选下面的继承权限 2 搭建 安装 PE 环境到 U 盘，PE 环境尽量不更新，否则 DG 版本更新后之前的系统备份是否还能兼容 用 Edgeless PE，写入 时选择预留分区，大小为 U 盘容量 - 1G，即给前面的 PE 留出 1G 空间 PE 环境下加载 ISO 镜像（镜像选择专业版），运行 source 下的 setup 对 Win11 用 Windows 安装器加载镜像安装，绕过 TPM 2.0 更新系统、自动装驱动 关闭更新 修改桌面、文档等路径 激活系统，HEU_KMS_Activator 激活 Office 和 Windows 安装字体，设置 npp、typora、obsidian、系统字体 Win11 让系统时钟显示秒数 蓝牙丢失的情况，关机、断电源后，等一分钟，启动可恢复 蓝牙音量无法调节，regedit 的 计算机\\HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Control\\Bluetooth\\Audio\\AVRCP\\CT 中 DisableAbsoluteVolume 改为 1，参考 修复引导后，在 msconfig 引导中删除旧引导 导入 reg 目录下其它配置，如用图片查看器打开图片 使用传统右键菜单命令 reg add &quot;HKCU\\Software\\Classes\\CLSID\\{86ca1aa0-34aa-4e8b-a509-50c905bae2a2}\\InprocServer32&quot; /f /ve，恢复 reg delete &quot;HKCU\\Software\\Classes\\CLSID\\{86ca1aa0-34aa-4e8b-a509-50c905bae2a2}&quot; /f 2.1 虚拟机安装精简版 Win10 VMware 创建一个虚拟机，分配空白的硬盘 插入 PE U 盘，启动，将 U 盘连接到虚拟机，重启后会从 U 盘启动 更改 vmvare BIOS 启动顺序，重启后直接按 ESC 选择 USB（连接到虚拟机），如不行再试下面的 编辑虚拟机名称的 vmx 文件，添加 bios.bootdelay=&quot;5000&quot;，然后重启按 ESC ESC: 调整启动顺序，F2: 进入BIOS Setup 要还原回去添加 bios.forceSetupOnce = &quot;FALSE&quot; 再重启一次，参考 从 uupdump.net 选择最新的 x64 Feature Update，参考、参考2 下载 AME Wizard 和 ReviOS Playbook，运行 也可用 VMwareHorizonOSOptimizationTool，相关介绍 3 软件安装 没必要储存的大安装文件，一律以 0 字节的 name.2big 占位 3.1 试用中 试用中 配置 BurpSuite Fiddler nodesCatch 节点测延迟和测速，双内核，用来选机场节点和过滤免费节点。必要时改测速下载文件，因为机场可能封锁某些常用下载文件 incontrol 锁定 windows 版本，不更新 3.2 必装 必装 配置 驱动 使用联想驱动工具安装。驱动文件、主机编号、保修时间，见目录显卡驱动-IntelVideo、电源 ACPI-n2hku54w_x64、主板 intelchip-r0pch04w，两个蓝牙驱动显示设置中缩放与布局设置为 125%，但偶尔会出现任务栏显示位置不正常的问题，通过设置分辨率为 1366X768 来放大显示 字体与主题 Clash.for.Windows - 设置开机启动，节点切换自动断开- 手动调用 command.bat 里面的命令安装 service，及手动删除 service 解决“红色地球”问题，参见- 可能对 clash 订阅的规则不满意，因此见下面 clash 自定义部分所有平台客户端汇总 Firefox - 参考 这个方法 改变 default-release 那个 profile 位置，cache 位置就不用改了。还原 profile，还原 profile 时扩展需要关闭一下重开，账户可能要重新绑定- 临时使用 AHK 脚本支持欧路双击取词- 如果需要隐藏顶部标签栏、标题栏、侧栏标题，参照这个，但不要添加 windows 按钮那个 CSS- about:config 设置 browser.urlbar.openintab 为 true，搜索结果新 tab 打开- favicons 不更新，手动删除 favicons.sqlite BANDZIP - 6.29 用 skin.data 覆盖，去掉启动的底部广告，关闭更新 PotPlayer - 设置文件类型关联- 设置打开新文件时在当前进程，不新建进程- 字幕缓冲量设为 0 避免弹幕抖动（仅新版需要）- 最新版会有广告，关闭更新- 下载的 ass 弹幕避免占满整个屏幕，可修改 PlayResY，如 1080 分辨率高度占 0.8 高度为 1080/0.8=1350 GoogleDrive 土区年付 100G，替换 Dropbox两种用法- 与 Dropbox 相同的用法。一般用云端硬盘，切换到“镜像文件”方式同步（非在线方式），点击“文件夹”，选择要同步的文件夹- 与百度云相同的用法。即只想备份到云，不想与其它设备同步使用“我的计算机”同步 Cryptomator Obsidian 笔记管理软件，typora 作为它的外部编辑器 typora - 打开主题文件夹放置 base.user.css 字体和界面宽度设置文件 ，见 typora 文件夹- 其它偏好设置- 目前两个 Bug，会在列表间加空行变成 lose list；被该用 tab 缩进，变成两个空格 第一个用 lint 插件解决，第二个用搜索替换 “(^\\t*) “ 替换为 “$1 “ HEU_KMS_Activator office 和 windows 激活工具激活时关闭实时扫描，排除 System32\\kms-renewal.exe 和 SECOPatcher.dll Chrome 第二浏览器 火绒 替换系统杀毒 傲梅轻松备份 一份安装版、一份 PE 版，尽量不升级关机时备份需关闭 “快速启动” —下面开始是免安装软件— wiztree 显示磁盘空间占用 SumatraPDF 关联 PDF 格式 KeePass 为了安全设定自动锁定时间 npp 修改字体和字体大小点 ？以管理员启动设置更新代理服务器，在插件中安装 compare修改设置中的备份，简单备份改为冗余备份，设置自定义文件夹。每次保存都会在这里记录一份旧的 OneCommander clover 的替代品，防火墙禁止联网防止总提示更新 ContextMenuManager 右键菜单，官方下载。清理显卡，添加 MSYS2 到 目录和目录背景，其中命令为 D:\\soft\\msys64\\msys2_shell.cmd -msys -where %v Everything 空格表示与，| 表示或，”” 中是真的空格。限定搜索范围，支持简单正则简单的 FTP、HTTP 服务器 calibre epub 等格式的电子阅读器kindle 数据格式转换与管理。新版运行有问题，可能是多显示器的原因，总之维持旧版 KopiaUI 增量备份。额外添加 VSS 脚本和 kopiaignore 模板 alist 国内网盘转 webdav rclone webdav/国外网盘 挂载、同步，给 KopiaUI 提供支持 JPEGView 看图软件 3.3 虚拟机安装 虚拟机安装 配置 TIM 查考这个删除 QQProtect WeChat 百度网盘 阿里云盘 PikPak_By_Shimily BitComet_v1.87_Stable_Mod 3.4 建议安装 建议安装 配置 欧路词典与配置 GoldenDict 和 欧路词典共用的词典 欧路词典 - 参考 环境-&gt; 词典软件 设置。词典在“Dictionary在用”- 用 AutoHotkey 脚本，设置划词快捷键 Ctrl + F10 SecureCRT 见 linux 文档 SecureCRT 配置问题。配置备份在 VanDyke_Config.zip ，可直接覆盖 vcxsrv 替代 xming（有 bug、新版本收费），新建快捷方式 “D:\\soft\\VcXsrv\\vcxsrv.exe :0 -clipboard -multiwindow -dpi 108”添加到 windows 启动中，C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp 指定 dpi -dpi 108 来增加文字大小 VMware-workstation ZF3R0-FHED2-M80TY-8QYGC-NPKYF 参考- 安装时勾选自动安装 WHP（基于 Hyper-V）。解释见 Hyper-V 和 VMWare 终于可以无缝共存、Windows 下各种虚拟化名词解释- 创建虚拟机，不要勾选虚拟化引擎 Intel VT-x 这些，因为 Hyper-V 底层已经用到这些技术了 office 2021（Office LTSC 专业增强版 2021（SPLA）） 1. 先卸载旧的 office，再用 OTP 工具的激活选项卡清除旧的激活信息，重启2. 用 OTP 通道： Office 2021 企业长期版，产品：Office LTSC 专业增强版 2021（SPLA）3. 在 OTP 中设置 KMS 服务器激活，参考 Office Tool Plus 用来选择安装哪些组件和激活管理 pandoc 配合 typora 导入、导出各种格式文档 telegram xmind 比起 mindmaster 没有节点数限制，xmind 8 绿色版，免费导出 svg，适合画调用关系图xmind 2020 适合画大纲，导出 markdown，图不大时截图配在文章中 msys2 建议这个代替 git Meld windows 版下载，用于 git 或其它比较 python node 博客搭建使用 CLion pycharm ja-netfilter-all 参考 这篇文章 运行脚本激活，从这里 zhile 下载和激活码 7z 备用的解压缩软件，负责备份 firefox 时的命令行工具，提供 hash 右键菜单 Wireshark 抓包。更新到 3.2.3 安装 usbpcap 后可以识别 USB 网卡 spacedesk 平板做显示器，支持多台，无线连接不要改安装路径，否则触摸屏不好用，防火墙要放开 C:\\Windows\\System32\\spacedeskService.exe DeskPins 窗口置顶软件 逍遥模拟器 下载国际版，广告少一些支持微信平板登陆，分辨率修改为 1600X900，dpi 修改为 240雷电模拟器出现开启 AMD VT 后无法启动虚拟机里跑模拟器，可以试试 喵喵机 喵喵机 PC 打印程序 IDM 破解版，用于下载 Youtube 视频 CP2102六合一 win 10 可用 MouseWithoutBorders 取消一些快捷键，避免冲突如果改了 dns，可能需要设置 ip mapping Microsoft.WindowsTerminal 可启用透明效果的 github 版本 wireguard —下面开始是免安装软件— WinSCP FTP、SFTP 等，在 session 的 高级设置中 UTF-8 encoding for filename 用来支持中文名 调试助手 串口调试助手/网络调试助手 ADB adb 工具和 usb 驱动 IntelliJ IDEA jdk JDK、JDK Docs VSCode 创建 data 文件夹，开启 portable mode其它参照 IDE 文档配置 gtags PDF处理工具 操作见“电子书处理”文档 DeDRM_tools DRM 移除插件，租借书籍 注释掉 rented 两行代码 后可以用，已经加入改后版本 cmake 只使用 gui 程序，命令行用 msys2 的 AutoHotkey 用于，推 gal 翻页笔映射脚本，欧路词典取词脚本 Bulk Rename Utility 哔哩下载姬 B 站视频、弹幕下载ass 弹幕的 PlayResY 乘以 2 实现半屏弹幕播放同时搭配 MPC-HC，避免 potplayer 引起的闪屏 Dism++ 下载，清理系统空间、引导修复 Hourglass 倒计时软件，官网帮助文档 硬盘 坏道检查、分区、硬盘信息查看，CrystalDiskInfo 原始值十进制显示DiskGenius 官方论坛 有 PE 版，即单文件版 galgame 翻译器、全屏 Magpie、提取文字 MisakaHookFinder Image-Anti-OCR-main 图片加干扰对抗百度贴吧 OCR bilinovel2epub 哔哩轻小说转 epub Umi-OCR 离线 OCR 软件 Simple-Web-Server 给 obsidian media extended 提供一个简易的 http 服务器 Snipaste 截图、贴图工具，配合 obsidian 使用 yt-dlp youtube 视频下载 PortableWinCDEmu 替代 DAEMON Tools Lite 挂载 galgame 常见的 mds、mdf 文件 3.5 不常安装 不常安装 配置 Arm Keil MDK 包含 STM32F1 pack Git 可用 msys2 里的 git 替代 kindle-for-pc DeDRM 推荐的版本 sshfs 先装 winfsp (Cryptomator 也装了 winfsp)，然后装 sshfs 64位 Beyond Compare windows 防火墙高级设置，添加出站规则，禁止 BC 主程序联网防止过期 KindleMate kindle 单词与笔记管理 Proxifier 代替 netch，给 GoogleDrive 用不要用 Portable 即 PE 版，功能不全，会导致 chrome 挂掉5EZ8G-C3WL5-B56YG-SCXM9-6QZAP先创建 Proxy Servers，然后创建 rule 匹配规则为了保险，name resolution 中通过代理解析 VirtualBox WIFI-FC-5 Blink USB 无线网卡驱动 BTSync 分布式同步软件，下载书籍 串口工具 SerialPortMonitor 串口通信数据监控 Virtual Serial Port Driver，串口转发工具破解有14天时间限制，尝试 windows 虚拟机快照串口桥接、虚拟串口、多虚一、一虚多使用 Complex 模式，IN 和 OUT 各创建一个虚口用来监控和发送流量最后 IN 和 OUT 各两个口。也可用 redirect 模式，然后用串口监听软件 device-monitoring-studio 串口通信数据监控 PL23XX_Prolific_DriverInstaller PL2303 串口驱动 CH341SER ch340 串口驱动 DualMonitorTools 多显示器设置不同壁纸 函数调用生成 doxygen graphviz htmlhelp，生成项目文档，生成函数调用图 call graph vs_Community VisualStudio 2019 如何离线下载下载vs_Community.exe –layout d:\\vslayout ^–add Microsoft.VisualStudio.Workload.ManagedDesktop ^–add Microsoft.VisualStudio.Workload.NativeCrossPlat ^–add Microsoft.VisualStudio.Workload.NativeDesktop ^–add Microsoft.VisualStudio.Workload.VisualStudioExtension –includeOptional ^–add Component.GitHub.VisualStudio ^–lang zh-CN –addProductLang en-US下载命令添加 –fix 用于断点续传，有个 arm 包速度很慢挂代理安装，进入前面指定的 layout 文件夹，输入前面的下载命令去掉 –layout 和 –lang 的部分。取消再选择可以节省空间，可以不全部选择。但要保留下载缓存文件夹，否则以后无法修改功能 get_iplayer BBC 下载，无 DRM，自动转 mp4、srt 字幕C:\\Users\\user_name\\.get_iplayer\\options 中添加，只下载有字幕的视频，设置默认保存路径output D:\\Videos\\BBCsubtitles 1subsrequired 1 All Netflix Categories netflix 隐藏类别 chrome 插件，解压缩后安装 Thunderbird 用来替代 foxmail 的邮件客户端备份与恢复与 firefox 一样，配置文件是 %userprofile%\\appdata\\roaming\\thunderbird\\profiles.ini配置储存在 %userprofile%\\appdata\\roaming\\thunderbird\\profiles\\XXXXXX.default-release删除旧的用新的覆盖即可 TortoiseSVN EaseUS BitWiper 擦除磁盘数据，500G 需 1h K-Lite_Codec_Pack MPC-HC 播放 B 站视频弹幕不闪屏（不像 potplayer）不要装 mediainfo 会有右键菜单，也可装后再次运行安装文件卸载掉用来显示视频文件缩略图，可只勾选 Explorer Shell Extensions 里面的两个 字幕查找-生成-处理工具 查找在线字幕，繁简转换autosub（包括讯飞的配置文件）、aegisub、剪映 W28Pro 苹果电池容量检测软件 —下面开始是免安装软件— cover 字幕遮挡软件 tftpd rufus 将系统镜像烧录到U盘 TextEditor 星号查看 硬件检测 cpu-zthphn 内存颗粒检测AIDA64，软硬件检测，可以定时生成日志内存超频后的测试 ComHub 通过启用 telnet 共享本地 com 口 PacketSender 发包软件，偏上层，不关心构造包 xcap 发包软件，手动构造包 ostinato 发包软件，开源，支持协议多，linux 和 windows 都可用 GoldenDict 参考 环境-&gt; 词典软件设置 Ditto 剪贴板管理和共享，使用介绍 https://www.playpcesor.com/2011/02/ditto.html如果要局域网共享，去掉禁止接收选项，双方填入对方的计算机名和相同的网络密码，接收密码没有填，远程文件选择主机名方式，下面的发送列表添加对方主机名并选择发送全部 bLend 窗口透明化 Glass2k 窗口置顶与透明 WinHex 十六进制编辑器，正常已注册，user.txt 为注册信息 鼠大侠鼠标连点器 EV录屏 可以录制系统声音 Bandicam 另一个录屏软件 FastStone Capture 屏幕截图与录像 音频提取 怎样将视频中的音频提取出来？mkvtoolnix / gMKVExtractGUIPazera_Free_Audio_Extractor 比 mkvtoolnix 支持的多一些 SQLiteSpy sqlite 查看工具 Folder2Iso 将文件夹制作成 ISO PSTools PsExec，用来以 SYSTEM 用户执行命令 WinCryptHashers 给 7z 添加 hash 算法。解压到 7zip 目录，新建 Codecs 文件夹用法，右键 CRC SHA 选择 * 或添加到压缩文件，选 hash 算法，参考 VeraCrypt 用在 U 盘上 foobar2000 音乐转换，如 wav + cue 转 flac 分轨 sdr-Cleaner_win Quick_Any2Ico 提取程序图标 ICO、png Scrcpy 手机控制，打开USB 调试、USB 调试（安全）、无线调试，重启手机，输入 IP，.\\scrcpy.exe –stay-awake –prefer-text –tcpip=192.168.x.x目前息屏 –turn-screen-off 和 stayawake 似乎不好用 gui-inspect-tool pywinauto 推荐的工具，也可配合 AHK 用spyplusplus 可用来查看 windows message 3.6 淘汰备份 淘汰备份 淘汰原因 迅雷 X 来源 阿虚储物间，用 IDM 迅雷 5.8 HEVC 视频扩展(windows store) 目前这样设置后会卡，先不用看 Netflix 4k显示设置，3840×2160，60HZedge://gpu 搜索 HEVC，以下为 trueHEVC installed/HEVC activable/HDCP 2.2 support/HEVC - 4K support SyncFolders U 盘与电脑同步软件。同步方式选择 PC 到 U 盘的 备份方式 AllDRMRemoval 移除 DRM，不支持租借书籍 NetLimiter 破解设置最小化和关闭到托盘，关闭更新 手心输入法 Shadowsocks ShadowsocksR sourceinsight 需要破解 Sublime Text 需要使用 patch 破解 Wub Windows Update Blocker，关闭 windows 更新 服务，同时也可用于关闭其它服务，并阻止其它软件开启，设置步骤见官网如果要使用系统更新，可以开启 SSR 全局代理，加快下载 翻墙工具备份 对常用翻墙工具的备份 4 网络4.1 windows store对于 windows store 设置代理，先设置 ie 代理，然后 1234# 导入 ie 代理netsh winhttp import proxy source=ie# 取消代理netsh winhttp reset proxy 对于 windows store 无法联网，错误代码 0x80072F7D。打开IE浏览器工具（注意不是Edge）—— 点击”Internet选项“ —— 选择“高级”选项卡 —— 在“使用TLS1.2”前面打上勾 4.2 命令行123456# http 代理。只对当前 cmd 生效set http_proxy=http://127.0.0.1:8118set https_proxy=http://127.0.0.1:8118# socks 代理。使用 setx 可以添加到 高级系统设置 - 环境变量当中，删除变量只能通过图形界面删除setx http_proxy socks5://127.0.0.1:10800setx https_proxy socks5://127.0.0.1:10800 4.3 添加环回网卡 运行 hdwwiz.exe 手动选择硬件 网络适配器 – Microsoft – Microsoft KM-TEST环回适配器 4.4 Clash 自定义 Clash 修改 profile 路径为其它盘 Clash 的 基本介绍、官方配置参考、参考一、参考二 关于 Clash for Windows 的 DNS，关于 DNS 见 一、二 为防止 DNS 泄露 组策略，禁用 智能多宿主名称解析 firefox 设置 socks5 代理，并开启 socks5 DNS 解析 clash 不添加匹配 IP 的规则，牺牲一些性能 Break When Proxy Change 改成 chain，来切代理时自动断连接 用 proxy-provider + rule-provider 的方法，参考 视频、这个 最终采用白名单模式，将直连域名、IP 排除，其它一律走代理，配置文件备份到 asset 文件夹 参考 分流原则，重要直连分流规则 &gt; 去广告规则 &gt; 小分流 &gt; 国内外大分流 &gt; 补充规则 用到的在线 规则一（用于决定国内 IP）、规则二（用于细化应用流量） 以后有新要求可以添加在线或自定义规则 另一种方法是，在 profiles 的 parsers 中可加入自定义内容修改原订阅 可参考 这个 和 官方配置文件写法，更全的 这个 和 这个 调试可用 console.log 打印到文件，下面的代码给 anycast 节点增加 skip-cert-verify 配置 123456789101112131415parsers: # array- reg: xxx.com/.+$ # 正则匹配域名 code: | module.exports.parse = async (raw, { axios, yaml, notify, console }, { name, url, interval, selected }) =&gt; { const obj = yaml.parse(raw); // 注意 code 部分使用 JS 注释语法 // 对 anycast 跳过证书验证 obj.proxies.forEach((e) =&gt; { if (e.name.startsWith('Anycast')) { e['skip-cert-verify'] = true; } return e; }); return yaml.stringify(obj); } 题外话，clash 正则 不支持 lookarounds，但如果支持，正常用正则排除掉一组词，应该这样写 ^(?!.*(dollar|euro|pound)).*，匹配不包含 (dollar|euro|pound) 的词，参考 开启 TUN，用 script 模式，默认程序走 DIRECT 直连 选中的程序进行流量规则匹配，但对于手动跳过某条匹配规则的情况，如 chrome 浏览器需要临时转给流量分析程序，暂时用接入 clash 的方式区分 HTTP/Socks5 进行流量匹配，TUN 则手动选择代理，见 asset 中 clash_rule.yml 此时配合 SwitchyOmega 开启快速切换，在 HTTP 和 直连（即 TUN 接入）间切换 如果需要开启多个监听端口可用 clash core 在终端中启动 clash-win64.exe -f 配置文件路径 配置文件设置控制端口，如 9090，然后 https://clash.razord.top/#/proxies?host=127.0.0.1&amp;port=9090&amp;secret= 来控制和切换 123456mixed-port: 17891mode: globallog-level: debugexternal-controller: 127.0.0.1:9090proxies:# 代理服务器节点 clash 的 api 也可实现一些自定义功能，如 这个 选机场 测速，自己用 stairspeed 注册临时账号买便宜套餐晚高峰测 经历，经营时间、过去评价、目前跑路风险 审计，哪些端口被封，或只允许哪些端口，哪些网站被封 4.5 VPN 转 代理 VPN 为全局，在某些场景下不够灵活，因此需要转成代理 Socks5/HTTP 例子：Google one vpn，连接前先进行地区校验，然后才开始连接，每隔一段时间还要再次校验，详情参考 所以要 将校验流量走代理 由于 VPN 是全局的，不方便使用，要将其转换为 socks/http 代理，集成到 clash 分流管理中 只有安卓使用了没有被封 UDP 2153 端口，而其它平台用了被封的 443，因此只有安卓可以不套代理直连，其它平台还要再套一层转发 UDP 比较快的代理（这样做仅是为了获得纯净的落地 IP，要消耗机场流量） 方法 方法1：将 android 手机设置代理走 Windows clash，代理校验流量，再将手机 VPN 共享出来。以后试试 光速 虚拟机 widows clash 开启 Allow LAN，设置检测流量的国家。匹配规则 meta['host'].endswith('cloud.cupronickel.goog') or meta['host'].endswith('googleapis.com') 手机 设置 wifi 代理为 windows clash 的端口 开启 VPN 开启 Every Proxy 共享 windows clash 分流给共享出的端口 方法2：不借助手机、软路由，只用 Windows 作为主设备的使用方式。思路可以，但实际不能用，可能是节点不支持 UDP？ 参考 局域网共享网络视频，能代理 VPN 底层流量，只能是网关共享或路由共享（配置系统 socks/http 代理取决于 VPN 软件是否遵守，有可能可以），由于 Windows Clash 不支持网关共享，因此只能路由共享 由于只用一台设备，那么运行 VPN 客户端的要是虚拟的 android/windows 设备，虚拟 android（像下面一样桥接到环回网卡）类似方法 1，下面考虑虚拟 windows 新建环回网卡，将 windows 虚拟机桥接到该网卡，宿主机共享 clash 网卡流量给环回网卡，网卡右键 – 属性 – Internet 连接共享（好像每次系统重启要重新配置一下共享），而且可能要设置虚拟机中网卡的 DNS 1.1.1.1、8.8.8.8 宿主机 clash 配置分流策略，代理校验流量，还要代理 UDP 2153 流量 虚拟机连接 VPN，同时装 clash 开启局域网共享，不开 TUN，策略 DIRECT，仅将 clash 作为 socks/http 服务器把网络共享出去，给宿主机 clash 或局域网设备使用 题外话：多个网卡都配置网关，根据跃点数，选择路由，可以这样改 网卡 IPv4 属性 – 高级 – 取消自动跃点，要是固定 IP 有两处配置，一处网关，一处接口，最终跃点看起来是两者相加，跃点越低优先级越高，通过 route print 查看 4.6 多重代理 链式代理：通过不断添加前置代理，如报文按 A –&gt; B –&gt; C 转发，C 配前置代理为 B，B 配前置代理为 A，报文封装与转发顺序相反，为 CBA。以下几种前置代理方法，按灵活性递减列出 软件内设置，或设置系统代理/环境变量（并被软件使用），如 Tor、浏览器 代理软件内，设置命中转发规则后使用链式代理，如 clash relay、v2ray proxySettings、Proxifier/ProxyChains 中的链式代理 TUN 模式/VPN，成为上层软件的前置代理。用于不支持设置代理或不使用系统代理的软件 宿主机，作为虚拟机的前置代理，网关共享/路由共享/设置系统代理三种模式。好处是网关共享/路由共享时，不会漏掉没代理的流量 路由器作网关，成为局域网设备的前置代理。万能但笨重，可以一直叠加上级路由器作为前置代理 限制：clash 不支持 UDP relay（可用 meta core 的 UoT），代理节点不允许国外 IP 入站，不允许不常用端口出站 典型应用：住宅 IP vmess + socks5 链式代理，测试 clash relay 无法用 http，只能用 socks5，并且配置时要 tls: false, skip-cert-verify: true 有些网站用直连住宅代理可以，但像 Google 就无法直连，必须链式 如只提供 http 代理 不好用的方法 不能用 vmess + http 链式，clash 不通，v2ray 没找到配置的地方，怀疑与 http 代理无法处理 dns (udp) 报文有关 不能用 clash tun + 浏览器代理 临时用 SSH 作 socks5 服务器，clash 配置 socks5 + 住宅 http 链式来用 用 wireguard + 设置系统代理 或 firefox 自带代理设置（HTTP 的用户密码会在访问时弹出提示），wireguard + firefox 也适用于 linux 测试：curl -x socks5://USER:PASS@IP:PORT ipinfo.io socks5 UDP 支持测试 ./brook_linux_amd64 testsocks5 -s=&quot;127.0.0.1:17890&quot; -u=&quot;XXX&quot; -p=&quot;XXX&quot; 测试网站 IP 信息 type:isp 为住宅 欺诈值 https://scamalytics.com/ip https://www.ipqualityscore.com/free-ip-lookup-proxy-vpn-test/lookup/11.22.33.44 伪装度 https://whoer.net/ https://ipfighter.com/ dns 泄露 https://browserleaks.com/webrtc https://ipleak.net/ 5 命令行5.1 msys2 为了使用最新的 gcc，安装一套编译工具。安装时卡在 66% “Updating trust database” ，一定用任务管理器杀掉进程，重新再运行一遍安装 打开 MSYS 命令行 1234567891011# 更新软件数据库和已安装软件pacman -Syu# 安装 mingw-w64 GCCpacman -S --needed base-devel mingw-w64-x86_64-toolchain mingw-w64-x86_64-cmake# 前一条命令会装 python，这里装 pip，似乎只装 mingw 的 pip 就行pacman -S python3-pippacman -S mingw-w64-x86_64-python-pippacman -S vim git# 用 windows 下的 meld 安装包，不用下面的，太大了# windows 下的 meld 只能在 MSYS2 下启动，不能在 mingw64，不清楚原因# pacman -S mingw-w64-x86_64-meld3 编辑 bash.bashrc 12345678910111213141516# 参考 ANSI Escape Sequences https://gist.github.com/fnky/458719343aabd01cfb17a3a4f7296797PS1='\\[\\033]0;\\W\\007\\]' # set window titlePS1=&quot;$PS1&quot;'\\[\\033[32m\\]' # change to greenPS1=&quot;$PS1&quot;'[\\! \\A \\w] ' PS1=&quot;$PS1&quot;'\\[\\033[0m\\]' # change colorexport PS1# 为了使用 Python 包export PYTHONPATH=&quot;D:\\soft\\msys64\\usr\\lib\\python3.9\\site-packages&quot;# 右键启动时使用默认配色，SecureCRT 使用 dircolors.256darkif [ &quot;$TERM_PROGRAM&quot; != &quot;mintty&quot; ]; then eval &quot;$(dircolors -b /etc/dircolors.256dark)&quot;fialias ls='ls --color=auto'alias ll='ls --color=auto -alF'alias vi=vimalias grep=&quot;/bin/grep --color&quot; 设置右键菜单，reg 已放到资源目录 右键菜单Bash.reg cmake-gui 要装 Qt5，太大了，直接用官网的包中的 cmake-gui 替换掉 D:\\soft\\msys64\\mingw64\\bin 中的 以下几条针对 SecureCRT，添加到 login 执行中 123export MSYS2_PATH_TYPE=inheritexport MSYSTEM=MINGW64source /etc/profile 设置为 True Color 允许输入中文，\\msys64\\home\\username\\.inputrc 中 Allow 8-bit input/output 下面 4 行去掉注释，即 set meta-flag on 到 set output-meta on 123456789101112pacman -S package_name #安装软件包pacman -R package_name #删除软件包pacman -Rs package_name #顺便删除软件包相关依赖pacman -Syu #升级系统中的所有包pacman -Ss package #查询软件包pacman -Qs package #查询已安装的包pacman -Qi package #显示查找的包的信息pacman -Ql package #显示你要找的包的文件都安装的位置pacman -Sw package #下载但不安装包pacman -U /path/package.pkg.tar.gz #安装本地包pacman -Scc #清理包缓存，下载的包会在/var/cache 这个目录pacman -Sf pacman #重新安装包 Clion 中指定环境目录为 D:\\soft\\msys64\\mingw64\\ 参考 1 Windows 下正确使用 Vim 的方式 参考 2 MSYS2 和 mintty 打造 Windows 下 Linux 工具体验 5.2 git bashopenssh 方式不论用 cmd 还是 powershell 都没法正确显示长命令，两个办法，git bash (mintty) 或 SecureCRT 的 local shell。不考虑 windows 商店中的 terminal 字体、透明度、主题 dracula 修改 PS1，D:\\MySoftware\\Git\\etc\\profile.d\\git-prompt.sh，与 msys2 的配置相同 查找之前输出 Alt + F3，Shift + Enter / Enter 上一个和下一个匹配 Python 代码中设置标准输出编码，否则为 GBK 12import syssys.stdout.reconfigure(encoding='utf-8') python -u 运行脚本，以便立刻输出到命令行。进入 python -i ，退出 exit() 对于 SecureCRT 集成 git bash，选择 D:\\soft\\Git\\bin\\bash.exe 而非 \\user\\bin\\bash.exe。进入后 source /etc/profile 来设置 locale 的中文和 TERM 变量 如有 SecureCRT，修改 PS1 同上，字体可指定 Jetbrains 的，颜色为 24 位 如有 SecureCRT，配置文件夹颜色，来自 dircolors-solarized 中的 dircolors.256dark，改 /etc/bash.bashrc 靠近文档最后的地方为 eval &quot;$(dircolors -b /etc/dircolors.256dark)&quot; 5.3 shell 使用 powershell，输入 Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser 允许执行脚本 在 F:\\Documents\\WindowsPowerShell\\Microsoft.PowerShell_profile.ps1 中添加，自定义颜色 12345# https://superuser.com/questions/1259900/how-to-colorize-the-powershell-promptfunction prompt() { $ESC = [char]27 &quot;$ESC[35m$(Get-Date -Format &quot;HH:mm&quot;) $($executionContext.SessionState.Path.CurrentLocation)$('&gt;' * ($nestedPromptLevel + 1))$ESC[0m &quot;} 对于 cmd，添加系统变量 PROMPT 值为 $T$H$H$H$H$H$H$S$P$G$S 5.4 openssh参照 Installing SFTP/SSH Server on Windows using OpenSSH，1803 之后用系统直接安装，之前版本步骤如下 下载 OpenSSH for Windows binaries OpenSSH-Win64.zip 解压到 C:\\Program Files\\OpenSSH 管理员权限 powershell powershell.exe -ExecutionPolicy Bypass -File install-sshd.ps1 开启防火墙，管理员权限 powershell New-NetFirewallRule -Name sshd -DisplayName 'OpenSSH SSH Server' -Enabled True -Direction Inbound -Protocol TCP -Action Allow -LocalPort 22 -Program &quot;C:\\Program Files\\OpenSSH\\sshd.exe services.msc 开启 OpenSSH SSH Server 服务 对于 Administrators 用户组用户，将生成的公钥存到 C:\\ProgramData\\ssh\\administrators_authorized_keys 中（原理是 SSH 客户端保存私钥，服务器端放公钥） - 文章中用的 PuTTYgen 来生成公私密钥对，这里用的 SecureCRT 方式 生成，生成格式选的 OpenSSH Key format (new)，将 Identity.pub 的内容放入 administrators_authorized_keys - 这种方式的 Key 用到 WinSCP 上也可以，但会提示转换，新生成 Identity.ppk 进行 SFTP 连接 对于 ssh 客户端，把 key 放到 C:\\Users\\用户名\\.ssh 下，即可连接 6 系统问题6.1 端口占用 cmd 管理员运行，netstat -ano |findstr &quot;PORT&quot; 查看排除端口范围，netsh int ip show excludedportrange protocol=tcp 释放占用范围 net stop winnat &amp;&amp; net start winnat 参考 7 其它7.1 mbr 转 gpt 用 diskgenius 转换分区表 在系统盘前面分出 500MB 空余空间，用 diskgenius 建立 ESP 和 MBR 分区 使用 PE 工具修复引导 7.2 Google Google 搜索可在设置中指定地区，避免结果随 IP 而变化；也可通过 在 URL 指定的方式 如 US，https://www.google.com/search?q=%s&amp;pws=0&amp;gl=us&amp;gws_rd=cr 8 备份与还原 见备份策略文档 9 U 盘系统 使用移动硬盘盒 + 固态硬盘的方案，而非固态 U 盘，因为 固态硬盘以后可以给 PC 用 移动硬盘盒 USB type A 和 type C 只要换线就可支持不同接口，作为 U 盘或随身系统 装系统软件使用 WTG(win to go) 辅助工具，默认选项增加分区配置即可，方法参考 教大家制作 “随身携带” 的 Windows 11 系统 和 萝卜头IT论坛。傲梅也有 WinToGo 工具，可以试试 口袋系统WinToGo。另外按照这个教程，Rufus 也可以","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/2.%20%E5%A4%84%E7%90%86%E5%B9%B3%E5%8F%B0/windows/"},{"title":"Kopia","text":"1 Kopia KopiaUI 程序所在目录新建 repositories，实现 portable、更详细的描述 VSS 先在 repository.config 中 enableActions 改为 true，然后用命令配置全局 profile（因为 gui 目前有 bug） 12345# 命令的前部分从 GUI 里面复制XXX\\kopia.exe --config-file=XXX\\repositories\\repository.config policy set --global --before-snapshot-root-action &quot;powershell D:\\soft\\KopiaUI\\before.ps1&quot;XXX\\kopia.exe --config-file=XXX\\repositories\\repository.config policy set --global --after-snapshot-root-action &quot;powershell D:\\soft\\KopiaUI\\after.ps1&quot;# 要清空配置传空字符串 &quot;&quot;XXX\\kopia.exe --config-file=XXX\\repositories\\repository.config policy set --global --after-snapshot-root-action &quot;&quot; 管理员 powershell，Set-ExecutionPolicy Unrestricted 修改 ps1 关联，用 powershell 运行 before 脚本里有调试信息，放开后可用来确认脚本执行和备份路径 查看和删除 vss，防止 after 脚本没执行，vssadmin list shadows，vssadmin delete shadows 常用命令（软件的路径区分大小写，尽管 Windows 不区分） 1234repository statuspolicy lspolicy show D:\\policy show --global GUI 设置全局 policy，备份 10 个，其它为 0，忽略相同备份，zstd 压缩 .kopiaignore 文件，路径用 / 分隔，且相对路径以 / 起始，如 /pagefile.sys、/Windows/Temp/ 系统盘排除内容可参考 dism++ 配置 ignore 内容少，直接保存到 global 中配置 Ignore Files 列表，不用 .kopiaignore snapshot estimate D:\\ 确认 ignore 生效 创建 snapshot create D:\\，由于只备份一个路径（D:\\），所以用 global profile 即可 确认备份过程是否存在错误，snapshot ls 和 show 前一个命令的 ID，参考 以后，定期确认备份文件是否正确，snap verify --verify-files-percent 1，参考 删除的 snapshot 对应的文件会 延迟 24h 左右删除 diff OLDID NEWID 显示 snap 区别 可手动 snap 然后 pin，pin 的 snap 不计入 Latest Snapshots 的设置中 sync-to 可以暂停后恢复，而直接推送到云端，即 snap create 则不能 推送到云端， repository sync-to rclone --remote-path=alist_local:/阿里云盘/d_backup --rclone-exe=D:\\soft\\KopiaUI\\rclone-alist\\rclone.exe --delete --dry-run，实际用去掉 --dry-run，参考 对阿里云盘，初始版本用官方客户端上传更快，sync-to 速度要慢一倍 对 Onedrive，rclone + alist 的上传速度要好于只用 rclone。同样初始版本选择官方客户端，同步盘手动上传技巧 设置 onedrive 同步路径为 NOBACK 文件夹里 mklink /J &quot;F:\\FNOBACK\\OneDrive - MSFT\\g_backup&quot; &quot;F:\\g_backup&quot; 开启上传 上传后，客户端退出 Onedrive 账户，删除 OneDrive 文件夹 开机同步、关机备份脚本，同步可以并行，备份不能，会出错。此外备份如果添加到组策略中，会要求输入密码 为了将关机的快捷方式固定到任务栏，需要加 cmd /c，如 C:\\Windows\\System32\\cmd.exe /C D:\\shutdown_backup.bat 其它 Kopia 类似工具不适合备份系统，因为即使用了 VSS，甚至用 SYSTEM 用户权限执行，也会出现某些文件没权限读取，比如某些文件只能当前用户可读 SYSTEM 用户执行 使用 PSTools，管理员 powershell，执行 .\\PsExec.exe -sid powershell，获得 SYSTEM 的 shell 可在任务管理器，详细信息中确认进程的用户 如要用 Kopia 备份 linux，我认为可尝试 restic 相关问答 1.1 Alist Rclone kopia 支持 webdav 但效果不好，所以再套一层 rclone 来上传备份 alist alist start 启动，注意关闭命令窗口会自动退出 配置文件 data\\config.json 要改成高位端口，否则起不来，闪退 防火墙要放行，应该自动弹出确认 alist 也可装到 OpenWrt 上，需要添加新的源，ipk 安装，参考 alist 添加 onedrive 文档 rclone rclone.conf 放在同一文件夹，rclone 会 自动使用，也可手动指定 ·--config=CONFIG_FILE rclone config 进行配置向导 使用 remote path 来指定操作对象，remote 是 config 中配置的，path 是里面的路径 如对于 alist 的阿里云盘备份路径为 alist_local:/阿里云盘/d_backup 列出目录rclone ls remote:path # lists a remote 挂载 rclone.exe --cache-dir=rc_cache --temp-dir=rc_temp mount alist_local: Y: --vfs-cache-mode full 这里把 cache 和 temp 指向当前目录，用 rclone.exe config paths 确认当前设置的路径 其它命令见 文档 OneDrive E5 参考 科技lion 申请 用 docker 刷新 docker 开放的是不安全的 http，因此只监听在本地，用 ssh 做中转，类似 ssh -L 功能，参考 1.2 出错 如果错误无法排除，从云端反向同步到本地 kopia 新建个临时配置连接到云端，使用 alist_local，假设为 repository-1691977414632.config 同步 D:\\soft\\KopiaUI\\resources\\server\\kopia.exe --config-file=D:\\soft\\KopiaUI\\repositories\\repository-1691977414632.config repository sync-to filesystem --path E:\\temp --parallel=8","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/4.%20%E5%88%86%E4%BA%AB%E4%B8%8E%E5%A4%87%E4%BB%BD/Kopia/"},{"title":"IDE","text":"1 Clion1.1 linux有两种 linux 远程方式，包含编译的 Full remote mode 和仅调试 Remote debug 模式 Full 模式涉及编译因此要写 CMakeLists.txt Full 模式要在 Deployment 选择 mounted folder，否则每次都要用 SFTP 上传源码，要配置 Folder 和 Mappings cmake 设置选项 -v -- -j 3 打印具体的编译命令 Debug 模式只需要添加一个配置，指定执行文件的目录，设置 Path mappings。用 Remote GDB Server 或 Remote Debug 都可以 1.1.1 相关问题 clangd 内存占用过多，限制成 500MB，Clion clangd, how to limit memory usage 堆内存占用过多和其它性能问题，Help | Change Memory Settings 改成 1000MB cmake 输出引号乱码，参考这个将 Default encoding 改为 UTF-8，Settings / Preferences | Editor | General | Console_ settings 要出现点击函数后卡在 “Resolving References” 上，把 Use navigation via clangd 关了 ubuntu 20.04 remote debug 开启 sudo 运行后无法 debug（18.04 没这个问题，gdb 版本？），程序退出 CPP-23810 和 CPP-25441。暂时通过开始 ssh 的 root 登录绕过 pretty printers 设置失败 中 Andrew Brownsword 的回答 把 Windows clion 下的 bin\\gdb\\renderers 拷到 linux 打开 #com.jetbrains.cidr.execution.debugger 调试，找到 idea.log 中的 WARN python import sys ... sys.path.insert(0, ... 开始的这一行，改为 renders 路径，如 sys.path.insert(0, &quot;/home/zack/code/install/renderers&quot;)。把整个这一行加到 linux 的 gdbinit 文件中，路径在 ~/.gdbinit 或系统配置 /etc/gdb/gdbinit 设置断点后 printf 没有输出，解决方法 是在程序开始处添加 setbuf(stdout, 0); 2 Keil3 QT参考 从清华镜像下载在线安装工具，QT 账号登录，自定义安装，按参考中截图选择 4 VSCode 解压缩 zip 后，创建 data 文件夹，开启 portable mode liveserver 提升端口占用，因为防火墙没放开 下载 gtags，将 bin 路径添加到系统环境变量，要重启 要是工程大为了快速查引用，则关 C/C++ 扩展，开启 C/C++ GNU Global 扩展，扩展选择参考 4.1 快捷键 ctrl+k, ctrl+s 查看、设置快捷键 ctrl + o 当前符号 ctrl + shift + o 模糊全局符号搜索 alt + t 全局符号搜索 alt + f 文件 F1 / ctrl + shift + p 配置命令 ctrl + shift + f8 / shift + f8 高亮 4.2 自定义编译 比如 cool 的编译和运行添加两个 task，一个属于 build group，一个是 test。示例 json 如下 123456789101112131415161718192021222324252627282930313233{ // See https://go.microsoft.com/fwlink/?LinkId=733558 // for the documentation about the tasks.json format &quot;version&quot;: &quot;2.0.0&quot;, &quot;tasks&quot;: [ { &quot;label&quot;: &quot;编译当前目录&quot;, &quot;type&quot;: &quot;shell&quot;, &quot;command&quot;: &quot;coolc&quot;, &quot;args&quot;: [ &quot;${fileDirname}/*.cl&quot;, &quot;-o&quot;, &quot;${fileDirname}/${fileBasenameNoExtension}.s&quot; ], &quot;problemMatcher&quot;: [], &quot;group&quot;: { &quot;kind&quot;: &quot;build&quot;, &quot;isDefault&quot;: true } }, { &quot;label&quot;: &quot;spim 运行&quot;, &quot;type&quot;: &quot;shell&quot;, &quot;command&quot;: &quot;spim&quot;, &quot;args&quot;: [ &quot;${fileDirname}/${fileBasenameNoExtension}.s&quot; ], &quot;problemMatcher&quot;: [], &quot;group&quot;: { &quot;kind&quot;: &quot;test&quot;, &quot;isDefault&quot;: true } } ]} 4.3 远程开发 参考官方文档 设置要连接的设备，连上后要设置远程设备的代理的话（如安装插件），在设置的 remote 中 ，设置好后重连 其它如编译和调试都和本地一样，由 3 个文件管理，看介绍视频更快上手 tasks.json (compiler build settings) launch.json (debugger settings) c_cpp_properties.json (compiler path and IntelliSense settings) 免密码验证，生成 rsa key，C:\\Users\\XXX\\.ssh\\config 文件增加一行 IdentityFile C:\\Users\\XXX\\.ssh\\id_rsa 并把私钥拷贝到这里，公钥放在远程设备的 ~/.ssh/authorized_keys 中（没有新建、有则追加） 参考官方文档 和 stackoverflow 对于改本地 mount 的驱动器，远程执行编译命令的情况，可用 SSH FS 的 ssh-shell task host 指定用的配置文件，workingDirectory 指定目录，command 远程执行的命令，注意只打印 stderr 没有 stdout，可 redirect stdout to stderr &quot;command&quot;: &quot;bash -c \\&quot;/usr/class/cs143/cool/bin/coolc ${fileBasenameNoExtension}.cl -o ${fileBasenameNoExtension}.s &amp;&amp; printf '\\nCompile Success!\\n' \\&quot; &quot;, 5 VIM5.1 安装 源码编译方法可以重新查找，目前参考 Building-Vim-from-source，要额外开启 clipboard 和 xterm_clipboard 特性编译时加 –with-x ， 参考 1234567891011121314151617181920./configure --with-features=huge \\ --enable-multibyte \\ --enable-rubyinterp=yes \\ --enable-pythoninterp=yes \\ --enable-python3interp=yes \\ --with-python3-config-dir=/usr/lib/python3.7/config \\ --enable-perlinterp=yes \\ --enable-luainterp=yes \\ --enable-gui=gtk2 \\ --enable-cscope \\ --with-x \\ --prefix=/usr/localmake VIMRUNTIMEDIR=/usr/local/share/vim/vim81 -j8# 使用 checkinstall 安装sudo checkinstall# 替换默认 viupdate-alternatives --display visudo update-alternatives --install /usr/bin/vi vi /usr/local/bin/vim 51 --slave /usr/share/man/man1/vi.1.gz vi.1.gz /usr/local/share/man/man1/vim.1.gz# 卸载dpkg -r vim 也可 apt 安装 vim-gome，安装前确定一下版本是 vim8 5.2 TAG 数据库5.2.1 内核 tag 生成tag 生成参考 内核代码生成tag、cscope 大型项目用法 参考第一篇使用 make O=. ARCH=arm SUBARCH=exynos COMPILED_SOURCE=1 cscope tags 生成 后续考虑能否生成 gtags 数据库 5.2.2 universal-ctagsubuntu 自带的 ctag 版本太老，源码安装参考 Ubuntu16.04安装配置和使用 universal-ctags 5.2.3 GTags下载源码编译安装 Vim 8 中 C/C++ 符号索引：GTags 篇、LeaderF 支持 GTags 对于需要跳过的目录 修改配置文件 ，参考 man gtags，如 /src_comm/lib/:，然后在 vimrc 中设置 let g:Lf_Gtagsconf = '/home/xxx/.vim/gtags.conf' 5.3 配置 按键 内容 F2 paste toggle F3 set list toggle F4 highlight toggle tab insert 切换到 normal leader + leader noraml 切换窗口 c - k / c - j 上下滚动，set scroll=5 leader + q 关闭窗口 leader + w 删除 buffer leader + e [except]删除自己以外的 buffer leader + r 查找存在定义的引用，不存在定义输命令查 leader + t [tag] 全局 tag leader + o 打开查找结果窗口 leader + p 上一条结果 leader + a [alternative buffer] buffer 切换 leader + s [search]查询字符串 leader + d 查询定义 leader + f [file] 搜索文件 leader + g [tag] 本地 tag leader + j [j 与文件 f 键位对应] 最近打开文件 leader + l [list] 显示 tag 列表 leader + b [buffer] 搜索buffer leader + n 下一条结果 leader + m [max]只留下当前窗口 leader + 1-9 buffer 切换 插件名称 介绍 LeaderF 文件、符号、buffer 模糊查找，需要 python 支持执行 install.sh 提高速度 tagbar 使用 ctag 动态解析 buffer 的 tag，形成 tag 列表，配合 airline 在状态栏显示 vim-airline 状态栏美化，还带很多插件，tabline 用于 buffer 和 tab 管理。需要的字体在 vi.assets 文件夹里，配置 securecrt 即可 vim-airline-themes airline 主题 vim-dirvish 模仿 netrw 不占用侧边栏的文件管理方式，使用当前窗口打开文件 asyncrun 异步执行 shell 命令，输出到 quickfix BufOnly 关闭除当前外其它 buffer 插件以 help 文档及 github 页面为主，其次看别人的典型用法，英文优先。不排除某些插件的功能就是不完善的可能，因此为了将 vi 用的更好，我认为学习编写插件是必须的。vi 的配置与插件以精简和全面熟悉为原则，只选择少数成熟的插件 5.4 配置备份optionally-loaded 的插件需要把 start 文件夹替换为 opt，相关 vim-packages、Using git-submodules to version-control Vim plugins 1234567891011121314151617181920212223242526272829# 配置放到 .vimcdmv .vimrc .vim/vimrcln -s .vim/vimrc .vimrccd .vimgit init# 安装插件git submodule initgit submodule add https://github.com/vim-airline/vim-airline.git pack/plugins/start/vim-airline# 安装完后可能需要生成 help tag:helptags ALL# 备份到远端git commit -m &quot;Initial commit.&quot;# 还原git clone --recurse-submodules -j8 git://github.com/foo/bar.git# 或只还原、更新插件git submodule update --init --recursive --remote# git checkout 时也更新 submodule 的内容git submodule update --recursivegit checkout master --recurse-submodulesgit commit# 删除插件git submodule deinit pack/plugins/start/vim-airlinegit rm pack/plugins/start/vim-airlinerm -Rf pack/plugins/start/vim-airlinegit commit 5.5 修改别人的插件 在 submodule 中新建 branch，并添加自己的 remote。目前使用的是和 vim 配置备份相同的 repo，分支名称以插件名称命名 基于这个 branch 修改，并 push -u 更新插件的 url 和 branch 为自己的，这样 git push 就可以将插件修改推送到自己的 repo 来备份 12345678# 参考 https://stackoverflow.com/questions/913701/how-to-change-the-remote-repository-for-a-git-submodule# 列出目前的git config --file=.gitmodules -l# 改 .gitmodulesgit config --file=.gitmodules submodule.pack/plugins/start/BufOnly.vim.url git@github.com:Jianfeng-Du/vim-config.gitgit config --file=.gitmodules submodule.pack/plugins/start/BufOnly.vim.branch BufOnly# 更新 .git 和 submodule 文件夹中的 configgit submodule sync 要更新远端的修改，就要切换到原来的 branch pull，然后再把这个 branch merge 到自己修改的 branch 中，然后 push 到自己的 repo。更新了插件需要分别在 submodule 和 主目录提交也可以。git push --recurse-submodules=check，git push --recurse-submodules=on-demand 5.6 操作技巧 * 查找指针所在单词的下一个位置，# 查找上一个，配合高亮开关使用 移除行尾空格 :%s/\\s\\+$//e，Search and replace wbef 在行中定位，也有大写版本，0^$ m + 小写字母 buffer 中 mark，大写字母全局 mark。’ 或 ` 加字母跳转到 mark，’’ 恢复到跳转前（只能 buffer 内用） % 转到匹配的条目 滚动首字母 up、down、forward、back、Home、Middle、Last Quick Movement，zz 将光标内容放入总间，zt、zb c-r 是重做，redo c-d、c-t 调整缩进，插入真正的 tab &lt;c-v&gt; &lt;tab&gt; ，Insert tabs in INSERT mode when expandtab is set 获取某项设置的值加 ?，如 set list? 重新载入配置比如 vimrc，:so %，How do you reload your .vimrc file without restarting vim? 操作字符，yl、r、x 在 change list 中跳转，'. g; g,，How to go back to lines edited before the last one in Vim? 输入模式 c-p c-n word completion 5&gt;&gt;.. 缩进，= 自动调整 Shifting blocks visually https://www.google.com/search?hl=en&amp;as_q=vim+site%3Aspringest.io&amp;newwindow=1 5.7 下一步 vi 操作有个闯关游戏可以不断练习，vi 的优势自然是使用键盘，所以打算练习盲打 学习编写插件，进一步精简插件 5.7.1 相关内容 以后可以考虑 动态语法检查、git 修改提示、自动补全，如何在 Linux 下利用 Vim 搭建 C/C++ 开发环境? 说明学习编写 vimscript 的重要，给出推荐资料 如何优雅地使用 Vim？ airline 需要用的中文字体 目前可以使用官方插件了，修改quickfix 5.7.2 系统学习 介绍 git 与 vi - 中文 介绍 vi 操作视频 vim tips","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/IDE/"},{"title":"docker","text":"1 安装 ubuntu 20.04 安装、参考二 避免每次输入 sudo 123456sudo groupadd dockersudo usermod -aG docker $USER# 激活新修改newgrp docker# 提示没权限的话重启docker version compose 安装，这里下载的 github 地址要去 GitHub 看一下来改 1.1 windows-wsl2 wsl –update 用 wsl2 在 resource - proxies 设置代理 按 Configure WSL 2 Data Location 修改文件路径到其它盘 wsl 其它 distro 也可以这样改路径 相关命令 1234567891011# 装 kaliwsl --list --onlinewsl --install -d kali-linuxwsl -s kali-linux# 修改路径wsl --export kali-linux kali-linux.tarwsl --export docker-desktop-data docker-desktop-data.tarwsl --unregister docker-desktop-datawsl --unregister kali-linuxwsl --import kali-linux E:\\wsl\\kali kali-linux.tar --version 2wsl --import docker-desktop-data E:\\wsl\\docker-data docker-desktop-data.tar --version 2 设置 appendWindowsPath = false，需要 wsl --shutdown 2 镜像 拉取镜像，替换源速度没有提升，建议 设置代理，只设置前 http 和 https 两处就可以了 1234docker pull cdrx/pyinstaller-linux# 使用 docker pull ubuntu@sha256:4b114761663a63948fcd36ef36315b31370c52e59546cf32fee60a8fb16aeddfdocker pull --platform linux/arm64 alpine:latest 保存和加载镜像 12docker save -o &lt;path for generated tar file&gt; &lt;image name&gt;docker load -i &lt;path to image tar file&gt; 3 容器 生成容器 12345# 指定容器名字方便操作# -v 是绑定，docker run 见 https://docs.docker.com/engine/reference/commandline/run/docker run --rm -it --name table_bot -v /home/zack/code/table_bot:/src/ cdrx/pyinstaller-linux /bin/bash# 改成豆瓣源pip config set global.index-url https://pypi.tuna.tsinghua.edu.cn/simple 列出容器 12# -s 占用大小，-a 所有，包括停止的容器docker ps -a -s 运行命令 123docker start table_bot# -d: Detached mode: run command in the backgrounddocker exec -d table_bot bash -c '/root/.pyenv/shims/pyinstaller -F bot.py &amp;&amp; cp dist/b .' 进入 docker 123docker start table_bot -i# 如果已启动docker exec -it &lt;mycontainer&gt; /bin/sh 修改端口映射 4 API1234# 用 curl 和 jq 测试# 用法参考 https://stackoverflow.com/questions/41960751/docker-remote-api-filters-filter-out-network-by-name# https://stackoverflow.com/questions/28054203/docker-remote-api-filter-exitedsudo curl -gG -XGET -v -H 'User-Agent:' -H 'Accept:' -s --unix-socket /var/run/docker.sock 'http://localhost/v1.41/containers/json?limit=10' --data-urlencode 'filters={&quot;status&quot;: [&quot;running&quot;]}' | jq '.[] | {Id, Names}' 对于想通过 nginx 的 path 来区分不同应用的，可以这样配置，参考 1234567891011location /app1/ { proxy_set_header X-Real-IP $remote_addr; proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for; proxy_set_header Host $http_host; proxy_redirect off; proxy_pass http://127.0.0.1:3000/;}location /app1 { return 301 /app1/;} 5 制作镜像 如何编出更小的镜像 系列文章 制作镜像 123docker build -t iebs .# 要是网络不通可以试试 --network=hostdocker build --network=host -t iebs . 可以用 静态链接 libc 的方式编出单文件程序，Dockerfile 参考 123FROM scratchCOPY iiot_sdk /CMD [&quot;./iiot_sdk&quot;]","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/2.%20%E5%A4%84%E7%90%86%E5%B9%B3%E5%8F%B0/docker/"},{"title":"linux软件编译、安装、运行","text":"1 编译参考 https://askubuntu.com/questions/466651/how-do-i-use-the-latest-gcc-on-ubuntu 1.1 静态链接 libc 不推荐链接 glibc （如 getaddrinfo）。用 alpine 的 musl，pull 官方 docker 后安装 这些 启动 docker 映射本地的源码，在 docker 中编译 用 -pthread 而非 -lpthread，区别 gcc 链接时使用 -static。一个复杂的 例子 编译后 strip 程序 1.2 交叉编译12345678910111213# gcc 包含文件查询路径echo | gcc -E -Wp,-v -# 加 -Wl,--verbose 来看使用库的路径信息gcc -o test main.o -ltest -L. -Wl,--verbose# 查看 so 名字readelf -a -W elffile | grep SONAME# 查看可执行文件需要的 soreadelf -a -W elffile | grep NEEDED# 查看符号 https://stackoverflow.com/questions/34732/how-do-i-list-the-symbols-in-a-so-fileobjdump -t Lib1.onm -g yourLib.so# 查看 man 文档man -l tcpdump.1 对于 rpath 和 sysroot 可参考 Building and cross-compile tutorial Ubuntu实现树莓派交叉编译（也解释了 build host target） 交叉编译器的命名规则 using-a-shared-library-in-another-shared-library 编译时指定 soname -soname=name，也可用工具修改 so 名字 理清gcc、libc、libstdc++的关系 一张图看懂C/C++核心库 1.3 Windows 编译安装 cygwin，保留安装程序用于后续添加/删除 package gcc 编译器安装包的选择 cygwin32-gcc-g++ is a compiler for 32 bit cygwin gcc-g++ is the basic 64 bit compiler (you probably must install this one). mingw-gcc-g++ is a 32 bit compiler for native 32 bit Windows mingw64-x86_64-gcc-g++ is a 64 bit compiler for native 64 bit Windows mingw64-i686-gcc-g++ is a 64 bit compiler for native 32 bit Windows gcc 编译器名称区别，注意 /usr/bin 下的 gcc 使用的是硬连接，可以用 ls -il /usr/bin/*gcc* 确认 gcc is just a hard link to x86_64-pc-cygwin-gcc x86_64-pc-cygwin-gcc and i686-pc-cygwin-gcc are as you have said the Cygwin compilers, that is to say the compilers that create programs that rely on cygwin1.dll x86_64-w64-mingw32-gcc and i686-w64-mingw32-gcc are compilers provided by the Mingw-w64 project i686-pc-mingw32-gcc is a compiler provided by the MinGW project 编译和运行 依赖 cygwin 的程序要将 /bin/cygwin1.dll (c:\\cygwin\\bin\\cygwin1.dll) 添加到 windows 的 path 中，使用 ming 编译的不需要 切换到 d 盘，cd /cygdrive/d 必要时使用编程解决，下载 mingw-w64 的 x86_64-win32-seh，安装参考 2 安装 安装前备份虚拟机快照 修改的配置进行备份，方便出错恢复 官方安装指南是重点，安装时的提示与安装后的帮助也注意。其它的方法 ./configure –help，README and INSTALL 文档 版本不求新，stable 和 LTS 优先 版本太老可以考虑万能的源码安装，方便可以选择 apt 安装。ppa 也可以考虑 2.1 apt 安装1234567891011121314151617181920212223242526# 通过查找名称和描述找到包，i 表示已安装，也可用 aptapt search &lt;package&gt;aptitude search &lt;package&gt;# 查看包详细信息apt show &lt;package&gt;apt-cache show &lt;package&gt;# 查询已安装和要升级某个软件的版本apt policy fdiskaptitude versions fdisk# 模拟安装和模拟升级apt-get -s install &lt;package&gt;aptitude -V -s install &lt;package&gt;apt-get -V -s upgrade# 指定版本安装sudo apt-get install &lt;package&gt;=&lt;version&gt;# 已安装的软件列表apt list --installed# 已安装包的文件列表dpkg -L &lt;package&gt;# 下载包的源码apt-get source &lt;package&gt;apt-get source &lt;package&gt;=&lt;version&gt;# 为什么安装和为什么没装，从下往上看aptitude why &lt;package&gt;aptitude why-not &lt;package&gt; 2.2 源码安装源码安装典型步骤 The autogen.sh script generates the configure script (from configure.ac, using autoconf) and any files it needs (like creating Makefile.in from Makefile.am using automake). This requires autotools to be installed on your system, and it must be run when checking out the project from source control (if configure isn’t checked in). People who download source tarballs can usually skip this step, because output of this step is included in source tarballs. The configure script generates Makefile and other files needed to build. Typically Makefile.in is used as a template to generate Makefile (and config.h.in to generate config.h). This process happens using only standard tools installed on your system, like sed and awk, and doesn’t require autotools to be installed. The make command builds the software. The make install command installs it. 3 运行 在 64 位 linux 运行 32 位程序 参考 这个 将编译器课程中的 spim 脚本 [${1:0:1} != &quot;-&quot;] 改成两个方括号外加参数判断 [[ $# -ne 0 &amp;&amp; &quot;${1:0:1}&quot; != &quot;-&quot; ]]","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/linux%E8%BD%AF%E4%BB%B6%E7%BC%96%E8%AF%91%E3%80%81%E5%AE%89%E8%A3%85%E3%80%81%E8%BF%90%E8%A1%8C/"},{"title":"下载","text":"1 批量下载 Bulk Rename Utility 处理的中文 pair 文件时要保持成 unicode、utf-16、UCS-2 大小端无所谓 Chrome 扩展 Link Grabber、Simple mass downloader 必要时使用编程解决，下载 mingw-w64 的 x86_64-win32-seh，安装参考 2 视频下载 流媒体是 M3U8 格式，可以使用 ffmepg 命令下载。或使用插件 Stream Video Downloader youtube 1080P 是音视频分离，且可能分别有两种格式。可以用 youtube-dl 命令行方式下载，然后用 ffmpeg 合并音视频（不合并也可以播放）。也可以用在线解析网站 Youtube Download Online 使用更新的 yt-dlp，下面命令注意要指定一个 ffmpeg 路径 对于英文字幕视频、同时按 Chapter 分隔，命令 `yt-dlp.exe –proxy 127.0.0.1:17890 –embed-subs –write-sub –write-auto-subs –sub-langs en –convert-subs srt –split-chapters –ffmpeg-location D:\\soft\\BBDown –merge-output-format mp4/mkv https://www.youtube.com/watch?v=XXX 对于双语字幕视频 yt-dlp.exe --proxy 127.0.0.1:17890 --embed-subs --write-sub --write-auto-subs --sub-langs en,zh-Hans --convert-subs srt --split-chapters --ffmpeg-location D:\\soft\\BBDown --merge-output-format mp4/mkv https://www.youtube.com/watch?v=XXX 要把弄成硬字幕 burn 参考（需要改格式 exec 的格式变了），ffmpeg 命令 参考 pornhub 可以用插件，也可以在线解析 Video DownloadHelper 支持的较好，但免费版可能加水印和有下载次数的限制，暂时没用 详细DMM/FANZA视频破解下载MP4教程","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/1.%20%E6%9D%A5%E6%BA%90%E4%B8%8E%E6%94%B6%E9%9B%86/%E4%B8%8B%E8%BD%BD/"},{"title":"Design for How People Learn","text":"1 Where Do We Start? 学习包含很多方面，不同情景有所不同 最简单的是只提供信息 技能，提供练习的机会 动力，无法直接提供，但可以通过设计流程让学习者更有动力 改变旧习惯 环境和沟通问题 因此关键是正确识别出问题，即学习需要提供上面哪些内容 2 Who are your Leaners? 明确学习者 当前技能水平 动机是什么，动机来着外部的要尽量转化为内部，激发其兴趣（个：让其主动），如通过 与其感兴趣的内容联系 联系实际问题 适当难度的挑战 让学得好的帮助其 如条件允许，为不同水平的人提供不同的指导（个：因材施教） 帮助学习者建立知识架构、路线图、核心内容最重要，这样他们好知道把新知识放在哪里 以问题导向讲解知识 让学习者讲给别人，从而练习组织自己的知识架构 最好用互动教学方式，及时从学习者收到反馈，而非单向传输 用各种手段了解学习者，交流、体验其环境 3 What’s the Goal 比设定目标更重要的是识别出当前的问题，从而找到最优的方式解决问题，而非只关注达成目标 对于目标 分解量化，避免模糊 确定实际中用的上 确定能判断出目标是否达成 确定要掌握的程度，有的能力短期可掌握，有的需要长时间 4 How Do We Remember? 将知识增加更多的联系，编成故事记得牢，因为 故事更吸引人 已包含了组织结构、逻辑关系 放到实际环境中学习效果更好（如飞行模拟器），因为记忆和环境相关 学习与人处理时，附带情景中的情绪也模拟出来 区分要记忆的程度，如果只是能够识别，那么选择题测验是可以的，但如果要能回忆起完整步骤，需要空白的简答题 通过不断重复，记忆得到加深，但简单重复会有枯燥的问题，同时与情景的联系单一 5 How do you Get their Attention 象与骑手的比喻，人们往往高估自己的控制能力. 为了吸引注意力，需要 用故事阐明，并留有悬念 视频、图片解释概念、比喻、统计数字、应用场景 为何学、怎么学 挑战 难度适中的问题 时间限制 应用学到的知识 好的快速的反馈 一起学，竞争与合作 谨慎使用外部奖赏，因为会将内部激励转为外部，从而背离真正的目标 6 Design for Knowledge 利用学习者已有的知识框架 问题驱动教学，让学生感到困惑，从而主动学习自己未知的内容，记得更牢 阐明观点时，给出反例比正确的例子更能说明问题 然后可以让学生自己从反例中总结经验，而非直接给结论 做到既给出具体应用，又讲述理论 7 Design for Skills 掌握技能的两个条件：练习和反馈 练习：分散到长的时间范围内记得更好，小的目标组成大的目标，对应短期、长期目标 难易穿插，给学习者消化的时间， 反馈：快速、频繁、多样 8 Design for Motivation 让学习者认可的人宣传这个学习有用、好学 9 Design for Habits 无反馈或反馈延迟会阻碍习惯的养成 具体化目标，设计不同场景如何应对 让目标容易达成 改进环境，让其适合习惯养成 10 Design Evaluation 要测试课程水平，要请人试学，而非自己，因为对于已经会的人是看不出问题的 问答题比选择题对知识掌握的要求更高，作者建议这种评估方式 但这样提供反馈与选择题相比更复杂，当无法找到专家时，可使用 同伴或相对学得好的 自评 先自己写问答题 再依据一套评价标准（好几项的达标情况）自评 给出几套专家的解答 有经验的课程设计者会先设计评价标准，然后设计课程（个：类似测试驱动开发）","link":"/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/Design%20for%20How%20People%20Learn/"},{"title":"电子书处理","text":"1 制作书1.1 从网页爬取 request + BeautifulSoup + Chrome（或 ChromeHtmlToPdf），selenium 也可生成 PDF 建议用 puppeteer，见 如何将网络教程 (tutorial) 转成 PDF 批量删除 PDF 最后一页 1.2 扫描纸质书参考 asset 中《DIY版简易零边距扫描仪之玻璃夹子方案》 1.2.1 用到的工具下次试试室内灯光，之前的侧光对于不那么白的纸太暗了 玻璃板，超白玻璃 8mm 厚，300 X 250，不要印 3C 标志 俯拍架，不用带补光灯 蓝牙遥控器 ComicEnhancerPro_chn 文件处理 ABBYY FineReader + Foxit 高级 PDF，PDF 制作和 OCR FreePic2Pdf 书签制作 1.2.2 拍摄 不一定要找专门的光源，室内灯光不反光也可 书架第二格，俯拍架足够高，支架手臂与书架平行 开启拍照声音 开启长焦镜头，减少畸变 固定焦距，避免自动对焦模糊 高质量照片模式 开启网格线，保证书的文字不倾斜 增加手机锁屏时间 两个书架的宽度比书脊稍宽，避免位置移动，同时也方便翻页 调整到没有大的反光，另一页的反光可以用白纸遮盖（或调整光源？），手机边缘反光用创可贴遮住 书籍摆放位置划线，避免位置移动 拍摄完先不移动灯光和相机位置，准备对个别不满意的页面补拍 1.2.3 文件处理 文件重命名，同时检查是否漏拍 图像裁剪，随着厚度增加每张会有细微的偏移，因此图片可能要分多个文件夹裁剪多次 图像处理，封面单独处理 彩色 300 DPI 纠斜: 自动_横排, 边缘扩展 照度修正 自动对比1 亮度: 113 表面模糊: 遍数=1, 算法=Photoshop, 半径=5, 阀值=20 USM锐化: 遍数=1, 数量=50, 半径=1.0, 阀值=0 黑白 600 DPI（封面彩色 600 DPI） 纠斜: 自动_横排, 边缘保留 切边: DPI=600 照度修正 自动对比1 USM锐化: 遍数=1, 数量=50, 半径=1.0, 阀值=0 色彩设置: 色彩数=纯黑白, 纯黑白（二值化）选项: 阀值算法=Wolf, 窗口尺寸=50, 去斑直径=2, 去除与边缘接触的黑色区域, 边缘去毛刺 2 PDF 处理2.1 制作 ABBYY FineReader 不开启 MRC 压缩 因为 ABBYY 无法不改变图片，所以只能无损输出后用 Foxit 压缩 图像品质，自定义，不改变颜色、不允许质量损失 Foxit 高级 PDF 优化扫描 PDF，彩色/灰度为 JPEG2000 有损，黑白为 JBIG2 对于大小不一的文档，OCR 识别后，页面大小改变很多。以后考虑先删除大小不一的页面，OCR 后再拼接回去 备选1 福昕PDF编辑器，通过微信签到获得 OCR 一天功能 备选2 Foxit 高级 PDF 破解版 书签 FreePic2Pdf 2.2 去水印 Acrobat DC 2020 + Enfocus pitstop_13 安装 Acrobat DC 运行 setup PitStop 安装后，替换 dll，C:\\Program Files (x86)\\Adobe\\Acrobat DC\\Acrobat\\plug_ins\\Enfocus\\PitStop Pro Resources 运行 Acrobat，编辑 - 首选项 - Enfocus PitStop Pro - 语言 - 取消与 StatusCheck 共享语言，选择 Same as Acrobat 或 English 偶尔弹出中文需要密钥是正常的，改语言为 English 就不弹了 全局更改-移除图形 图片水印 文字水印 指定对象大小移除，包括图片和文字 pitstop subpath 移除 Select inside contour 移除轮廓内的对象 2.3 书签 自动添加书签 用 PDF 补丁丁 根据样式识别标题，然后手动调整，见 作者博客教程 对于识别后出现不规律空格的书签，可以用 claude 来智能移除空格 手动改书签 先提取书签，然后编辑 FreePic2Pdf.itf 和 FreePic2Pdf_bkmk.txt，最后挂书签 目录可从豆瓣或其它 PDF 中提取 用 PdgCntEditor 调整页码偏移量 FreePic2Pdf.itf 设置 BasePage 目录页码基准（一般与 TextPage 相同），ContentsPage 目录绝对页码，TextPage 正文绝对页码，见 FreePic2Pdf 帮助文档中的接口文件格式说明 FreePic2Pdf_bkmk.txt 为书签，tab 控制目录层级，标题与页码间 tab 分隔，页码基准前的页面用负数表示 notepad++ 常用正则，添加二级标题缩进 ^(\\d+.\\d+) 替换为 \\t\\1。添加标题与页码的 tab，\\s+(\\d+)$ 替换为 \\t\\1 软件作者博客 2.4 模糊pdf变清晰 模糊pdf变清晰 先提取一张图片，尝试调整参数，然后再批量处理 2.5 HTML 转 PDF单个 HTML 转 PDF 为了保留书签，另存为 HTML，并用 word 打开 ALT + F9 批量修改超链接指向当前文档而非网址，一般是删除网址部分，只保留标题指向 另存为 PDF，选项中保留书签 3 epub 等阅读器格式处理3.1 转换 格式 azw3，可支持自定义字体，mobi 格式(new、old、both) 都不支持。两种选择 需要书籍、笔记同步功能，但无法显示封面。用 calibre 转换为 mobi both 格式（old 格式会被转为 azw，new 格式不让发送），然后使用邮箱发送。此时 amazon 会转为 azw3，由于是 PDOC 类型所以无法显示封面。如 kindle 下载后用 MobiMetaEditor 改为 EBOK 类型则会导致文档无法同步，参见 为何推送 KF8 标准 MOBI 电子书不显示封面。有趣的是此时 App 端可以显示封面 不需要同步功能，可以显示封面。用 calibre 转换为 azw3，发送到 kindle，实际上是将封面放入 kindle:\\system\\thumbnails\\thumbnail_ASIN_EBOK_portrait.jpg，对于中文书籍还需将拼音文件名改回，参见 两种方法来给 Kindle 设置图书封面 有些书籍打开卡死，重新设置文本编码为 utf-8 calibre 中文书籍处理 首选项–保存图书到磁盘，去掉3个勾选项，分别是：分别保存封面、使用OPF文件保存元数据、将非英语字符转换为对应英语字符 在保存模板中将内容改为： {title}。如果标题不对也需要修改 保存设置，以后使用时选择保存图书到磁盘方式 3.2 移除硬回车 使用 calibre 的启发式处理，“取消换行因子”来移除 使用 amazon 发邮件 convert 方式，转换 pdf 为 azw3（弊端是回车替换为了空格，没有目录），但此时打开会导致 kindle 卡死，需要再用 calibre 设置输入文本编码为 utf-8 更麻烦的方法是，使用正则表达式，转换成 docx 处理完再转回来 3.3 去 DRM Kindle amazon 购买时卡单，先取消订单，然后删除信用卡，重新添加一下 多次重复扣款可联系中文客服 对于日本 amazon，要 clash 开系统代理才能登录，登录选择 co.jp 最新的移除 kindle DRM 方法 相关软件在 DRM 文件夹 装 新版DeDRM_tools 装 KFX Input 插件 装 Kindle_for_PC_v2.3.70840 问题：系统用户名是中文或者裁剪版的 win10 可能无法去 drm，换个系统 calibre 调试方法，查看 log 123Ctrl+R restarts in Normal ModeCtrl+Shift+R restarts in Debug ModeCtrl+Alt+Shift+R restarts in Safe Mode (no optional plugins) 旧方法：两种方法都要用 1.24 的 kindle for pc（安装文件在 windows 环境-不常用中），All DRM Removal 的解释，并找到下载的电子书 我的文档\\My Kindle Content\\ASIN_EBOK All DRM Removal for Windows 终身版，224。感觉这个就是 DeDRM 的图形封装。用 All DRM Removal for Windows 破解版，keygen 会报木马，在沙盒中打开获取注册信息即可，切换到 kindle 进行破解 Google Books，用到 ADE_2.0，装 .net 3.5，Calibre 的 DeDRM 添加 default_key（与 ADE 装在一个系统），拖动下载的 PDF 到 Calibre 自动解密 Kobo 用 AllDRMRemoval （附带注册机）移除 DRM 3.4 繁简转换【Calibre外挂】 简转繁功能大揭密、Calibre 使用教程之电子书繁体字转简体字 Calibre 安装 Chinese Text Conversion 插件，编辑书籍，点击文，台湾繁转简，直排转横排，保存副本后 再用编辑单个书籍，加载 csr 替换文件（见资源目录），前面的 4 个引号替换可以删除 对于带图片的文档（漫画），输出配置选择 tablet，不改变图片质量 步骤 1 要先于 2 因为直接替换直排的文字输出有问题 3.5 生成目录 编辑书籍，工具 – 目录 – 编辑目录，里面有各种生成目录的方式","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/%E7%94%B5%E5%AD%90%E4%B9%A6%E5%A4%84%E7%90%86/"},{"title":"代码分析","text":"1 Call graph分析函数调用关系图 (call graph) 的几种方法 1.1 静态1.1.1 Doxygen + Graphviz + Htmlhelp (windows) 使用 Doxygen + Graphviz + Htmlhelp，Doxygen 配置，再加上下面两图，不要选生成 Chinese，否则 chm 文件乱码 生成前将不用的第三方库代码移走 Doxygen error: failed to run html help compiler on index.hhp 报错似乎不影响 1.1.2 SciTools Understand (windows)C/C++ 项目参考， Buildspy - For gcc/g++ Users 1234567891011121314# 使用 cygwin 的 /x86_64-w64-mingw32-gcc.exe 编译 openssl# buildspy.exe、g++wrapper.exe、gccwrapper.exe 移入上一层目录(\\SciTools\\bin\\pc-win64)，否则找不到 qt 等 dll# 正常配置好项目./Configure --prefix=/cygdrive/d/Desktop/openssl2/openssl-openssl-3.0.0-alpha9/install mingw64make clean# 为了找到 buildspy 和 wrapperexport PATH=&quot;/cygdrive/d/MySoftware/SciTools/bin/pc-win64:$PATH&quot;# 替换编译器export CC=gccwrapperbuildspy.exe -db openssl.udb -verbose -cmd make# 打开 openssl.udbproject -&gt; analyze all filesproject -&gt; improve project accuracy -&gt; missing includes 添加 include 文件 C:\\cygwin64\\usr\\x86_64-w64-mingw32\\sys-root\\mingw\\include 对于 openssl，一处非常奇怪的宏定义字符串导致编译不过问题，原 Makefile 是 -DOPENSSLDIR=”&quot;$(OPENSSLDIR)&quot;，使用 gcc 编译没问题，但使用 gccwrapper 就要改成 -DOPENSSLDIR=’ “$(OPENSSLDIR)”‘，注意单引号与双引号间的空格不能省略。在同一行有 3 处都要改。宏定义问题可以通过 gcc 加 -v 参数来调试 1.1.3 SciTools Understand (linux)123456789101112# 以 openssl 为例make cleanexport PATH=&quot;/home/zack/code/proj/scitools/bin/linux64/buildspy:$PATH&quot;# 配置 CC 要在 ./config 之前export CC=gccwrapper./config# 正确的话应该看到 buildspy 的打印buildspy -db openssl.udb -verbose -cmd make# 打开 openssl.udb# project -&gt; analyze all files，点击结果的 warning 窗口中的 search for missing includes# 把 gcc 的查找路径添加进去 echo | gcc -E -Wp,-v -# 另外手动定义两个宏 __x86_64__ 和 __LP64__ 为了 include 64位的头文件 &lt;gnu/stubs-64.h&gt; 1.1.4 Sourcetrail用 compilation databases 新建项目 linux 下用 bear 生成 全平台使用 cmake 生成，set(CMAKE_EXPORT_COMPILE_COMMANDS ON) 参考这两个https://aul12.me/embedded/2019/05/27/cubemx-cmake.htmlhttps://clang.llvm.org/docs/JSONCompilationDatabase.html stm32 工程使用 cmake，从而生成 compilation databases 使用 stm32 官方 ide 1.2 动态1.2.1 KcacheGrind (linux)tools-to-get-a-pictorial-function-call-graph-of-code 12345678910111213sudo apt install kcachegrind valgrind# Compile the program as usual, no special flags.# 这里的调试信息和优化可以参考 工作-&gt;SDK.md 中对 openssl 的调试选项 export CC=&quot;gcc -g3 -ggdb -gdwarf-4 -fno-inline -O0 -fno-omit-frame-pointer&quot;gcc -ggdb3 -O0 -o main -std=c99 main.c# Generate a callgrind.out.&lt;PID&gt; file.valgrind --tool=callgrind ./main arg1 arg2 ...# 加参数这种更全，没详细研究valgrind --tool=callgrind --dump-instr=yes --collect-jumps=yes ./main arg1 arg2 ...# Open a GUI tool to visualize callgrind data.kcachegrind callgrind.out.1234 可以查看最大开销的调用栈 settings -&gt; sidebars -&gt; call stack ，实际的调用栈猜测是有多条的，还是 gdb 断点看吧 call graph 右键设置好 caller 和 callee depth 后（设小点，防止之后产生的图太大），右键 node cost 可以设置为 no minimum，就可以看到所有的 callee 和 caller 了 要看某函数调的所有函数，除了上面改 cost 的方法，还可以看下面第一栏的 Callees 生成整张调用图（很大）的另一个工具 右键可以导出成 DOT、png、jpg 文件 1.2.2 gcc instrumental (linux) 看 etrace 部分的回答 、instrumental，这两个程序使用查找 elf 程序中符号“地址”与“名称“ map 的方式生成调用关系，通过调试 instrument 附带的 C 代码发现，linux 上 __cyg_profile_func_enter 传入的函数指针地址与符号表中的不同，可能的原因 (这篇文章是通过符号名查地址) 所以基于 instrumental 的代码改进，使用 dladdr 接口获得地址对应的符号名，除了 -finstrument-functions，还要加 -O0 -rdynamic -ldl，不用加 -g 类似的还有 backtrace_symbols 代码见 instrumental 文件夹，目前还不支持多线程，没有锁和分线程统计 1234567gcc -shared -fPIC -Wall inst.c -o inst.so -ldlgcc -rdynamic -finstrument-functions -O0 -o code code.cLD_PRELOAD=/home/inst.so ./code# 以 openssl 为例，openssl 因为有 static 函数，所以效果不太好export CC=&quot;gcc -rdynamic -finstrument-functions -O0 &quot;./config TODO 想支持多线程，把 openssl 的图画出来，把 static 函数批量替换会怎样？可参考 github 上 ftracer 1.3 手绘 xmind 的逻辑图，比起 mindmaster 没有节点数目的限制，可以一个文件创建多个画布，免费导出 svg 2 内存占用valgrind-3.16.1 交叉编译，参考 Supported Platforms，对 kernel 和 glibc 的版本有要求 –prefix 的路径要和最终运行的路径一致 修改 configure armv7*) 改为 armv7*|arm*) ./configure –prefix=/data/update/valgrind –host=arm-linux-gnueabi , make, make install 精简 lib/valgrind 目录下文件 rm callgrind-arm-linux helgrind-arm-linux cachegrind-arm-linux dhat-arm-linux drd-arm-linux lackey-arm-linux exp-bbv-arm-linux，减少占用 要统计的程序使用 -g 编译，-O 优化等级不重要，不会影响堆内存统计 获得最大栈深，根据手册所说栈采样会慢 /data/update/valgrind/bin/valgrind –tool=massif –heap=no –stacks=yes ./sdk 。但这样无法得到最大栈深的调用栈，将线程的栈故意比最大栈深小一些，使用 gdb 调试，得到触发 stackoverflow 的地方。实测，用 ulimit -s 调用栈打不出来 valgrind Massif官方文档 栈统计的几种方法 Properly allocating stacks，这篇文章一共 3 部分、Computing your stack size ，google ”find max stack depth by stack overflow“ 可以看到 keil 和 IAR 的文章，linux 平台上能想到的办法是改 massif 的源码来记录 detailed snapshot 3 调试3.1 gdbhttps://www.linux.com/news/remote-cross-target-debugging-gdb-and-gdbserver/ https://sourceware.org/gdb/wiki/BuildingCrossGDBandGDBserver，包含 host、target 解释 1234567# 记得装这个sudo apt-get install texinfo# 可以创建不同的 build 文件夹来编译# gdb &amp; gdbserver../configure --host=mipsel-openwrt-linux --prefix=/home/zack/code/proj/gdb_install# gdb../configure --with-expat --target=mipsel-openwrt-linux --prefix=/home/zack/code/proj/gdbonly_install 3.1.1 gdbserver 传入环境变量方法 sudo gdbserver –wrapper env ‘LD_LIBRARY_PATH=/lib/libpcap/lib’ – :1234 ./tiny 3.1.2 修改为了编译通过做得修改，ubuntu 18.04 环境。基于 master 分支 ee6d95574b 2019-09-04 (HEAD -&gt; master, origin/master, origin/HEAD) Automatic date update in version.in diff 文件 12# 拷贝到源码目录，使用 patch patch -p1 &lt;patch.diff 3.1.3 调试100 个 gdb技巧 123456789gdbserver &lt;host-ip&gt;:2345 tinyeye ./mipsel-openwrt-linux-gdb tinyeyetarget remote 192.168.37.1:2345continue# 每行打印一个结构体成员set print pretty onp *(struct list_head *)0x469594 segfaults 常见定位方法","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/%E4%BB%A3%E7%A0%81%E5%88%86%E6%9E%90/"},{"title":"office","text":"表格快速添加多个新行，鼠标放在表格外的换行位置，回车添加新行，按 F4 多次重复添加 将表格选中行下移，Alt + Shift + 下","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/office/"},{"title":"词典软件","text":"1 GoldenDict 需要 linux 版翻译时使用 GoldenDict 参考 github GoldenDict 手册 下载64bit QT5 压缩版本 新建 portable 变成便携版，生成的 index 子文件中为词典索引 将指向 Dictionary 文件夹的快捷方式放入 content，除了欧路专用格式，其它与欧路共用。调整词典顺序 虽然可以添加欧路和有道在线词典，但查词会变慢，因此不添加且将维基百科也禁用 新建配置文件调整字体和大小，调整搜索框大小，选择显示哪些面板，关闭不可用的屏幕取词相关功能 修改设置如下，关闭“双击翻译”，查询结果中继续取词通过弹窗的方式，不使用跳转。基本不使用多标签功能。风格调整为白色背景。 设置 AHK 脚本自启动实现双击查词 阅读帮助文档中的快捷键实现高效查词 2 欧路词典 有生词多终端同步需求时，购买欧路。同时也可用来背单词，配合 kindlemate 背生词 欧路词典应用指南 设置字体最大，去掉“取词只显示第一本词典”选项，取词窗口选择固定高度，勾选“划词后直接显示翻译窗口”，去掉每日推荐 手动划词快捷键 Ctrl + F10 词典配置从软件的 欧路词典与配置 文件夹导入 日语 勾选允许对中文查词，因为日语里有中文单词 去掉 搜索列表优先使用在线词典，否则日语查词有问题 调整 PC 和手机端的发音顺序，让日语优先于中文，这样同汉字的日语单词才正确发音 3 词典3.1 选择 欧路词典打磨指南 先柯林斯，然后朗文。一共推荐 5 本字典 知乎常用词典介绍，给出的词典很乱，而且介绍的词典与电子版有差距，电子版的质量可能很差 ESL词典比较和下载，比较了 6 种 ESL 词典，并给出朗文和其它专用词典的下载，从电子版质量来看确实朗文收录的最多最好，其次是 科林斯、牛津，像麦克米伦、韦氏、剑桥的电子版排版和词条数都弱，不使用 3.2 获取 词典论坛，用户名是 e****s，里面的词典需要权限才能下，有名的词典可以通过网上搜索标题的方式获取 340万的简明词典，带词频提示，朗文才 23 万，这个词典简洁且全，故显示排在第一位 3.3 词典列表 双击 mdx 文件，欧路词典可以在导入前查看词典信息，词条数，但词典信息可能没有词条数 GoldenDict 建立索引后可以看到准确的词条数 欧路和 GoldenDict 共用词典 描述 简明英汉增强版-去音标 欧路格式版无法用，用 mdx 格式的。GoldenDict 可以用候选的有音标 CSS 版 新东方词根联想记忆_考研+托福+gre LDOCE 5++ V2.15 朗文，ESL，非母语者 Vocabulary.com 20170103 通俗解释和例句。这个版本不会卡死 OELDV1.51 母语词典 Oxford Collocations Dictionary for students of English 搭配词典 Computer &amp; Network Dicts 计算机专用分组 5 本词典，已删排版和词条过少的词典WhatIsTechTarget 欧路加载不了 新汉英大辞典 汉英 —– 下面是候选词典 —– 简明英汉增强版-CSS 适合 GoldenDict 美化有音标，但欧路用原生格式更快，且不需要音标 LDOCE 5++ V1.35 旧版朗文，在欧路上有空白问题，但色彩比新版丰富些，词条数少了 5万 CollinsV2.30 英英解释较易懂，适合初学者，ESL OALECD，牛津高阶英汉双解词典(第8版) 双解，ESL COCA词频 60000 简明增强词典已包含 COCA 优词词根 18667 较简洁，从背单词角度仅次于 新东方考研、托福、gre词汇词根及联想记忆，但仍有一些词源介绍 Vocabulary.com 20180417 导致欧路和GoldenDict 偶尔卡死 欧路-英语词根词源 词典 英语来源部分目前不需要，只是为了辅助记忆。较专业mdx 版词典可以在 pdawiki 找到 欧路专有词典 描述 常用例句库 与 Vocabulary.com 配合，比原生例句准确些 听力原声例句 与 Vocabulary.com 配合 词组 | 习惯用语 与 Oxford Collocations Dictionary for students of English 配合 有道在线词典 最后手段 在线词典参考 在线权威词典 全文搜索 3.4 日语词典 日语词典单独在“日语文件夹” 3.4.1 Yomichan 给汉字注音扩展，Furiganaize firefox yomibaba（原 firefox 商店的已经过时，所以用这个），词典也从这里下载 与 anki 联动 添加网络音频 Forvo 添加本地音频 Local Audio Server for Yomichan，可以 mklink /J 放到非系统盘 添加日中词典 修改 CSS，在 Appearance 的 Custom CSS 的 Popup CSS 资源 TheMoeWay 词典制作工具介绍 3.5 修改 修改词典内容 用 MdxExport36 解开 mdd、mdx 文件 用 emeditor 编辑 mdx，如正则替换 用工具转换 mdd 中的媒体文件，如 aac 转 spf 用 MdxBuilder 3.0 Beta2 （注意不是官网 4.0 版本）重新打包，mdx 打包参考、mdd 打包参考 相关软件在 欧路词典与配置 里面 修改外部 CSS 注意，改后在欧路词典设置中，要清除缓存来生效","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/%E8%AF%8D%E5%85%B8%E8%BD%AF%E4%BB%B6/"},{"title":"编译工具","text":"跟我一起写Makefile 《嵌入式 Linux C 语言程序设计》，make 1 CMake 推荐 out of source builds，输出不混在一起，git 工具好管理，可以创建多个 build，如 debug/release。build 与 source 同一等级，不在 source 内部 在多个平台测试以避免写出平台相关的 cmake 选择编译器和 Generator，两者不同搭配可有不同的 build 目录，只需指定一次 1cmake -B build -G &quot;MinGW Makefiles&quot; -D CMAKE_MAKE_PROGRAM=&quot;D:/soft/mingw64/bin/mingw32-make.exe&quot; 生成和编译始终在源码根目录 123456789101112131415# 生成 build systemcmake -B build# 编译cmake --build build# verbose and N parallel buildcmake --build build -v -j N# 列出 targetcmake --build build -t help# 编译 targetcmake --build build -t Tutorialcmake --build /pathTo/build --config Debug --target MyApp# 列出可设置的选项cmake -LH build# 设置选项- 调试 CMake 12# 用 --trace 打印太多了，所以一般 --trace-source 指定源码根目录的 CMakeLists.txtcmake -B build --trace-source=&quot;CMakeLists.txt&quot; -DUSE_MYMATH:BOOL=OFF target 可以是虚拟的 变量都是字符串类型，值有空格要加引号，多个值用分号连起来。未定义的变量是空字符串。${} 可以嵌套引用，可作为变量名 unset(myVar) / set(myVar) 用来 unset 变量 ENV{varName} 修改环境变量，环境变量只影响这次 cmake 执行 cache 和普通变量同名，普通变量会掩盖 cache 变量，但在一些情况 P26 会相反，cache 变量会被使用。正因为有同名情况，所以要给一个变量明确置空 set(foo “”) 而非使用 unset(foo) cache 变量的修改需要 force 关键字 命令行定义 cache 变量，建议指定类型；-U 取消定义 cmake-gui 一直 （配置 + 点 Configure） 直到没有红色然后点 Generate 给 cache 变量一个下划线结尾的前缀方便 cmake-gui 分组，项目相关的也用前缀方便以后给其它项目使用 文件的 IS_NEWER_THAN 要用 NOT 方式使用，因为 P44 不使用加引号的字符串，避免 3.1 以下版本解释为变量，进行变量替换 函数传参，引号分割的字符串会被当作不同的参数，要注意何时用引号括起来 尽量用函数而非宏来更好隔离 ubuntu 安装最新 cmake 2 介绍 编译、链接、库 等原理 三要素，目标、依赖、命令，依赖比目标或目标不存在新就执行命令。找到关系树的末端再从末端进行判断，末端比根旧则什么都不做，新则执行命令。 不要用环境变量 MAKEFILES Makefile 的组成 显示规则，我们写的 隐含规则，.o 自动生成 .c 依赖的关系 和 编译命令 变量定义 文件指示 include &lt;filename&gt; #if 多行命令 注释，# 转义 3 规则 规则中可以用通配符 变量中的通配符不会展开，除非 1234# 文件夹下所有的 .cobjects := $(wildcard *.c)# 文件夹下所有的 .oobjects := $(patsubst %.c,%.o,$(wildcard *.c)) 用 vpath 指定多个搜索目录 伪目标两个作用 1. clean 2. 一次生成多个目标 静态模式与多目标 %，具体看参考 依赖的头文件自动生成的方法，具体看参考 4 命令 @ 可以不显示这条命令 语句前加 - 可以忽略错误继续执行 嵌套执行 makefile $(MAKE) -C subdir export variable = value 或者 unexport 或者 export 导出所有变量到下级 MAKEFLAGS 和 SHELL 永远被传递给下级，除非见参考文档 常用命令可以定义成命令包 5 变量建议小写作为变量名，大写作为控制隐含规则和用户重载命令选项时使用 递归展开，无法追加 VAR=var 简单展开 VAR:=var ?= 被定义过什么都不做，没定义则赋值 变量使用 $(VAR) 预定义变量，比如 CC、RM、CFLAGS 自动变量，比如 $@、$&lt;、$^ make 启动时自动创建与系统相同数值的环境变量 6 make有一些 GNU 约定好的目标表示名称，可以作为写 makefile 的参考，比如 install 用来调试 makefile 参数 作用 -n dry run -t 只更新(touch)目标的时间，假装编译 -q 看看某个目标在 makefile 中存在吗 –debug 打印调试 -w 打印目录，用来调试嵌套 make 调用 其它参数见 man 或者 上面的参考文档 7 隐含规则 C程序隐含规则，$(CC) –c $(CPPFLAGS) $(CFLAGS)，其它程序规则见参考文档 隐含规则使用的变量，如 CC、CFLAGS 具体见文档 模式规则 %，与自动化变量。if 判断中不能使用自动化变量","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/%E7%BC%96%E8%AF%91%E5%B7%A5%E5%85%B7/"},{"title":"Ever17","text":"人工岛","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/Ever17/"},{"title":"妙妙","text":"狐猴 Lemur LeMU 吉祥物 里面是个女人？","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E4%BA%BA%E7%89%A9/%E5%A6%99%E5%A6%99/"},{"title":"音视频学习与娱乐","text":"1 应对禁止录屏 添加虚拟显示器，将视频传送给另一端后，用另一端的软件录屏 HDMI 欺骗器 spacedesk 视频采集卡 用 QQ 远程协助、远程桌面、虚拟机也是这个思路，即绕过软件层面的检测 也可找没被检测到的录屏软件 保险起见，每天录屏时间不要超过一个合理时间，如 8h Potplayer 录屏没声音时，打开 - 设备设置 - 摄像头 - 音频录制设备 - 数字音频接口。视频 –&gt; 录制视频(ALT + C)，保持默认MPEG-4编码，勾选开启高质量视频压缩，然后把播放器静音，最小化 2 视频笔记 用 media extended 插件 配合 Templater 和 QuickAdd 实现 自动移动光标到末尾 timestamp offset 设为 5，避免添加晚了 目前版本不支持（v3 支持）live preview，所以采用 3 分窗口的方法 针对视频笔记利用 frontmatter cssclass 添加禁止点击链接跳转 相关 CSS 字幕功能有问题，只能把视频与字幕压在一起了 无法支持本地文件，正好用 http server，避免依赖绝对路径 影片截图用 snipaste 配合 obsidian-paste-image-rename 和 Obsidian-fast-image-cleaner 3 手机控制 PC spacedesk 作为扩展显示器 4 PC 控制手机 用 Scrcpy 的“熄屏”控制，可以用于 App 开发 5 内录声音 静音内录某个软件的声音 装虚拟声卡 Virtual Audio Cable(VAC) 在“音量合成器”中，将要被录音的软件输出给声卡一端 录音软件录制虚拟声卡的另一端 如果不静音，要同时听到声音，在声音 – 录制 – CABLE Output 中勾选侦听此设备，选择播放设备 “立体声混音”也能做到内录系统声音，但有的系统没有 6 音频实时翻译（同传） 参考，阿虚“无字幕视频实时翻译” 手机系统自带，小米、华为 AI 字幕。可通过上面的“PC 控制手机”，将同传翻译画面传给 PC 翻译 App，有道翻译官（唯一支持日语的）、Google 翻译、百度翻译、腾讯翻译官 飞书，会议功能，字幕和翻译（支持日语）。声音输入可用两种方法 用蓝牙耳机的麦克风，放在音箱前 用上面介绍的“内录声音”的方法 也可识别出字幕后，用 OCR 翻译 7 转文字 借助视频软件 剪映 生成字幕后，用 字幕提取工具、剪映工具箱 必剪 也有免费的语言识别，用工具导出 Pr 有语言识别，但盗版可能无法用 借助会议记录软件 飞书妙记 免费 100G 容量，不够时可以删掉，导入视频，导出 SRT 钉钉闪记也类似 调云服务 API 字幕组机翻小助手 能用的 API 接口多，但免费版有 10h/月 额度 autosub 可用 Google、百度、讯飞 pyTranscriber，要开全局代理，速度一般，只有 Google Youtube 为视频自动生成字幕，先将音频转为视频才能上传 ffmpeg -f lavfi -i color=c=black:s=1280x720:r=5 -i audio.mp3 -crf 0 -c:a copy -shortest output.mp4 不支持中文 其它思路 小宇宙 studio 工具 只能用在 PC 查看，不是 SRT 字幕 手机、office、chrome 实时语言识别或录音转文字，然后利用 youtube 自动对齐时间，生成字幕 用播客，喜马拉雅、微信听书 总结 对播客，选支持播客的 app 对知识学习，严肃类 对中文，用飞书妙记或免费的剪辑软件 对英文，传到 youtube 保存，并自动生成字幕，如为了字幕可只传音频 对小语种、方言，用机翻助手里的免费额度 步骤，下载、转写文字、划分框架、记录笔记、备份保存 统一保存为 youtube 私有视频，并在视频描述中附上时间轴章节、笔记 飞书妙记也可考虑，100G 空间 8 听音乐 指标 目的 指标权重 Youtube listen1 MusicTools Spotify QQ 音乐 歌曲数量 找旧歌 3 3 2 1 2 音乐推荐 找新歌 3 3 1 2 2 音质 体验 2 2 1 3 3 离线播放 省流量 1 0 0 3 3 下载 备份防删除 1 0 0 0 0 界面、跨终端同步 易用 2 3 2 3 2 优势 歌曲全且可自己扩展 可跨平台听国内的歌 可下载高品质导入到 Youtube 对没有的国内音乐或想收藏的音乐，用 Listen1（跨平台搜索工具） 找到想要的，用 MusicTools（无损下载） 等工具下 320K MP3/256K AAC，传到 Google Drive（备份） 和 Youtube Music（方便在线听） 各一份 国内外平台都存在版权限制导致歌曲不全的问题，次要问题是无法下载收藏某首歌。Youtube 开放的平台配合搜索、下载工具来解决 Youtube music 歌词插件 Spotify Lyrics","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/%E9%9F%B3%E8%A7%86%E9%A2%91%E5%AD%A6%E4%B9%A0%E4%B8%8E%E5%A8%B1%E4%B9%90/"},{"title":"可可","text":"八神可可 中三 粉色短发 狗，皮皮 开朗","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E4%BA%BA%E7%89%A9/%E5%8F%AF%E5%8F%AF/"},{"title":"少年","text":"棕色短发 失忆少年，不知道为何来这里 寻找校服少女 金鱼记忆，很快就忘","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E4%BA%BA%E7%89%A9/%E5%B0%91%E5%B9%B4/"},{"title":"校服少女","text":"少年的寻找对象","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E4%BA%BA%E7%89%A9/%E6%A0%A1%E6%9C%8D%E5%B0%91%E5%A5%B3/"},{"title":"职员-优","text":"田中优（美青春香菜），黄发职员 大一，18 岁 开朗 父亲曾在 LeMU 开发部门，为了找父亲才来这里，1 岁时，父亲失踪","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E4%BA%BA%E7%89%A9/%E8%81%8C%E5%91%98-%E4%BC%98/"},{"title":"职员-空","text":"茜崎空，棕色长发，旗袍 LeMU 系统工程师，代理主任，AI 程序 投影在人的眼球上，声音通过耳机实现 沉稳","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E4%BA%BA%E7%89%A9/%E8%81%8C%E5%91%98-%E7%A9%BA/"},{"title":"blog","text":"1 部署 安装 git、node.js，参考 hexo 官网，windows、linux 有区别。git 设置 sock5 代理，见 git github 创建 username.github.io 仓库，实测要用官方的流程设置一下主题才能开通。添加 ssh 密钥 安装 hexo 、主题、插件，主题可根据star 排名来选择 123456789101112npm install hexonpx hexo init blogcd blognpm i hexo-theme-icarus hexo-generator-sitemap hexo-relative-link hexo-mermaid-lastest hexo-filename-title# 要在 config 中添加配置npm i hexo-auto-category hexo-feed hexo-extract-excerpt hexo-deployer-git# source 目录下，关联笔记mklink /J _posts D:\\Documents\\Dropbox\\notes\\blog# 还有一个 footnote 插件从 hexo-theme-fluid 移植过来# 还有 add_assets_url.js 添加下载图标# 所有插件可通过 hexo --debug 选项看到 1.1 Google 收录 先创建 Google Analytics，添加 tracking_id 到主题配置文件，注意广告拦截和浏览器拦截 再创建 Google Search Console，用 Google Analytics 验证所有权 在 Google Analytics 选择媒体资源，Search Console 关联，进行两个产品的关联 在 Search Console 中提交站点地图 sitemap.xml 2 使用 原则是避免手动配置 front-matter，尽量自动生成，保持界面简洁易用 常用命令123456789101112# 启动 server 预览npx hexo clean &amp;&amp; npx hexo s --p 10000# 生成（只在确认生成文件时会用到）npx hexo g# 部署# 不加 --generate 会导致修改不推送# 下划线 _ 开头的文件永远不会被推送# 此外对于 exclude 的文件，clean 后首次不推送，再执行一次就可以推送了# 所以保险起见每次执行两次这个命令npx hexo deploy --generate# 可清除博客的更新历史记录，会导致全量部署rm -rf .deploy_git 后期，如果流量大，图片和 asset 放到 github 其它 repo 上，避免超过 github pages 流量 100G/月 的限制 2.1 编写插件 插件的 优先级 值越低越先处理原始 md 文件，因此低优先级可避免被其它插件的处理结果影响 3 维护 备份：hexo 目录下所有内容（文章除外） git 记录修改，push 到 github 上 还原： 装 git、node node 用 ppa 装最新版本 18.x 从 github clone，linux 环境要卸载原 hexo，重新安装（不清楚为何不跨平台），其它插件看起来没问题 db.json 报错：手动创建 blog\\node_modules\\mime-db\\db.json，文件内容空 object{}` 这个 linux 环境作为 linux branch push 到 github 来备份 更新博客 通过 rclone 挂载 GoogleDrive，再 ln -s 创建软链接到 source/_posts rclone 从官网下载 arm 版本，配置按照官网和向导走就可以，很全面 sudo apt install fuse3，rclone mount 需要 rclone 退出而没自动 umount 的情况（文件被占用），手动 sudo umount 一下 按 rclone config 提示，获得 GoogleDrive API 相关参数 创建 gd 文件夹，只读挂载 ./rclone --cache-dir=rc_cache --temp-dir=rc_temp mount gd: gd --vfs-cache-mode full --read-only rclone 放到 screen 里面运行，.zshrc 添加 screen -x，登录后就恢复上次的环境 配置 cron 每两小时自动 npx hexo deploy --generate 更新博客 在某些频繁写入的场景下，需要在本地保留一份，然后利用 rsync 和 cron 来周期同步 rsync -av --update --log-file=/home/ubuntu/sync_log.txt /home/ubuntu/blivedm/rooms/ /home/ubuntu/rclone-linux/gd-db/rooms/","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/4.%20%E5%88%86%E4%BA%AB%E4%B8%8E%E5%A4%87%E4%BB%BD/blog/"},{"title":"鸠","text":"紫发少女 冷酷 23 岁，1993.7 出生 体力好，力量大 了解 LeMU 12 年前，2005 年，12 岁感染病毒，5 年后细胞全部更新一遍，病毒提高了身体的代谢、免疫能力，同时不会变老，永远 17 她的宠物老鼠也感染了 好友，茱莉亚 医院，少年，看见未来 出车祸，8 年在医院中度过，被做实验","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E4%BA%BA%E7%89%A9/%E9%B8%A0/"},{"title":"人工岛","text":"LeMU 巨蛋，海洋主题公园 经营公司 Leiblich 制药 LeMU 来源于 LEMURIA 基于饱和潜水原理，内部 6 个大气压，比外部稍大，保证安全 气压原因，需要声音转换器 海底火山热能供电 4 层结构，由上至下，地上 1 层，地下 3 层 Insel null，地上人工岛 Erste boden Zweite stock，医疗室，仓库，警备室 Dritte stock，控制室，休息区 楼层间隔 17m，最深 17 * 3 = 51m 下方 119m IBF，研究深海之蓝 Tief Blau 病毒","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E5%9C%B0%E7%82%B9/%E4%BA%BA%E5%B7%A5%E5%B2%9B/"},{"title":"5.1","text":"门票上写的 2017 年 妙妙与少年换装，之后少年晕倒 少年似乎就是少女？要完成某个任务 武与鸠从电梯中逃出，外面没人，很多通道人关闭了，似乎被困住了？ 空对他们说，赶快离开，Level…Data…Tief…Blau 玻璃破裂，海水涌入，无法从上层逃出，地下 2 层 事故 12.45 停电，紧急避难警报 12.54 人员撤离，引发气压变低 15.55 低气压导致玻璃破裂，启动防水闸门 6 人到地下三层，控制室，目前状况 1 层完全进水，2、3 层第 3 区块进水 无法与外部通讯 一个大气压 武提议转一转，确认周围环境 男孩留意到，监控室的生命数字在 5、6、7 之间跳动，提议去 2 层找人 空在警备室做着什么，不希望被人打扰 武在医疗室下面的房间，发现可可好像在和谁说话 事故 2、3 层更多区域被淹没 大家与可可一起去医疗室治疗减压症 鸠说无法与大家待在一起，到了别处 疑问： 谁把他们困在这里 6 人中各自的背景是什么 少年为何失忆 鸠为何总是独自行动 多出来的人是谁","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E5%9C%BA%E6%99%AF/5.1/"},{"title":"武","text":"仓成武，大三，20 岁 找 3 人123【武】「一个是高５．１尺，体重大约６３公斤，戴着不太合适的太阳眼镜，手不太灵活但脚程还颇快的丑男……」【武】「另一个是穿着西装但没打领带，理平头，穿了三个耳洞、一个鼻洞，喜欢编织的男生……」【武】「最后是唯一的女生，穿着一大堆华丽荷叶边装饰的碎花洋装……」","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E4%BA%BA%E7%89%A9/%E6%AD%A6/"},{"title":"5.2","text":"墙壁承受压力的极限时间到 5.7 4:30 误差 12h 停电，空失踪，寻找空，得知空为 AI 去发电室查看电力问题 鸠通过漏水让电梯下降 捉迷藏，不知道谁踢了罐子，是还没被发现的那个人吗？","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E5%9C%BA%E6%99%AF/5.2/"},{"title":"5.3-5.6","text":"5.3 修理仓库破损管道 武救出受伤的鸠 空给武讲了一个，在更高维度上观察多个自己，Y 分叉的自己的道理 休息区 4 个雕像 面向东方 向南方伸手 向天花板伸手 两手在胸前，闭眼 5.4 鸠醒来与武讨论生命，鸠认为生命是污秽的，武不这样认为，鸠认为武是伪善者 鸠失踪，电脑被砸坏 找到鸠，鸠伤势恢复了，仍然不配合武的问话 帮鸠抓逃跑的老鼠 5.5 武与鸠玩水母游览船 Qualle，把肉体比作硬件，“我”比作硬件上的资料，两人关系变好 优知道了，父亲资料的存放位置，试图破解 少年奔溃，鸠再次与武谈话，告知过去身世 5.6 鸠感染的 Leiblich 制药的 cure 病毒 鸠认为 3 层下面还有空间，与空争吵，要逃过去 可可吐血，感染 Tief Blau 2017 深海之蓝病毒，暂时用药缓解 通过 HIMEL 去往 IBF 来治疗可可，门从里面被人打开，遇到研究员 IBF 很多关闭的门，惨死的研究员 可可拜访过 IBF 中的父亲 TY","link":"/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E5%9C%BA%E6%99%AF/5.3-5.6/"},{"title":"LFS","text":"书的由来：按自己的喜好搭建，写自己的软件，有一个自己的系统。这本书还可用来理解系统 定制化，尤其是小型嵌入式系统 安全","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/2.%20%E5%A4%84%E7%90%86%E5%B9%B3%E5%8F%B0/LFS/"},{"title":"GPT工具","text":"1 Prompt 学习 两种模型 Base LLM Instruction Tuned LLM，要讲的内容 两个原则 清晰具体的指令 使用分隔符明确输入 12345\\`\\`\\`'''---&lt;&gt;&lt;tag&gt;&lt;/tag&gt; 提供 If 判断条件，不同情况不同输出 给出回答的例子，让其模仿 输出 指定输出格式，html、json、表格 输出内容括起来，output format: &lt;Name of company&gt;, &lt;Number of Employees&gt; 限定字数、句子数目 限定结果，几选一 给模型思考时间 复杂任务，分步骤 判断答案是否准确时，明确指定自己计算一遍，然后再和结果比较 补充，通过 SYSTEM，给模型一个 CONTEXT，扮演一个角色 Role 模型限制 不懂的内容也会编造出来，缓解办法是，分步骤，先找出相关信息，然后回答并给出来源 使用一个输入 case 逐步微调 prompt 直到满意，之后可以用多个 case 来验证调整 Zero, One and Few Shot Prompting 也就是 ChatGPT-Next-Web 的面具 参考 ChatGPT Prompt Engineering for Developers、Prompt Engineering with GPT-4 继续学习 learnprompting、Prompt Engineering Guide 2 工具2.1 ChatGPT Next Web 文档 参考1、参考2 2.2 代码 Codeium vs. Copilot","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/GPT%E5%B7%A5%E5%85%B7/"},{"title":"自建 RSS","text":"1 RSSHub docker 部署，参考，docker run -d --name rsshub -p 1200:1200 -e CACHE_EXPIRE=30 diygod/rsshub 注意 cache_expire 为 30s，则 30s 以后 RSS 客户端再去请求就会从源站拉取内容 CACHE_EXPIRE 和 CACHE_CONTENT_EXPIRE 的区别解释，来源 tg 群 123注意第一個是 (文章列表+文章) 的緩存，就算你不斷 F5 ，只要是在這個時間內都不會請求源站比如說第一次請求到甲站的文章列表有ABC三篇文章, 這時緩存裡記著甲站有ABC及ABC的內容, 只要沒過期你怎樣F5就不會再請求甲站, 都只是緩存返回甲站有ABC過期後(5分鐘)再一次請求甲站, 發現甲站的文章列表有BCD, 由於CACHE_CONTENT_EXPIRE(1小時)沒過期, 緩存裡有ABC文章自身的內容, 就不會重複請求BC文章, 只會請求D文 2 miniflux Docker Compose 部署，参考1、参考2 注意 POLLING_FREQUENCY 为刷新频率 1min，这里大于 RSSHub 的 cache_expire 保证每分钟都会触发 RSSHub 的重新查询，即不使用缓存 ADMIN_USERNAME 和 ADMIN_PASSWORD 设置用户密码 ports 改成了一个高位端口 18080 BASE_URL 设置的域名 保存成 docker-compose.yml，然后 docker-compose up -d 1234567891011121314151617181920212223242526272829services: miniflux: image: miniflux/miniflux:latest ports: - &quot;18080:8080&quot; depends_on: db: condition: service_healthy environment: - POLLING_FREQUENCY=1 - DATABASE_URL=postgres://miniflux:secret@db/miniflux?sslmode=disable - RUN_MIGRATIONS=1 - CREATE_ADMIN=1 - ADMIN_USERNAME=用户名 - ADMIN_PASSWORD=密码 - BASE_URL=https://你的域名 db: image: postgres:15 environment: - POSTGRES_USER=miniflux - POSTGRES_PASSWORD=secret volumes: - miniflux-db:/var/lib/postgresql/data healthcheck: test: [&quot;CMD&quot;, &quot;pg_isready&quot;, &quot;-U&quot;, &quot;miniflux&quot;] interval: 10s start_period: 30svolumes: miniflux-db: postgres docker 创建例子，docker run --name my-postgres -e 'POSTGRES_USER=xxxxx' -e 'POSTGRES_PASSWORD=xxxxx' -e POSTGRES_DB=xxxx -d -p 5432:5432 postgres，目前用这种方法 + miniflux 配置文件的方式，方便更新和调整 3 nginx acme.sh 申请证书并安装 apt 装 nginx 该配置文件，只是简单的将 http 转成 https 12345678910111213141516171819202122232425262728293031323334353637383940414243444546user www-data;worker_processes auto;pid /run/nginx.pid;include /etc/nginx/modules-enabled/*.conf;events { worker_connections 1024;}http { sendfile on; tcp_nopush on; tcp_nodelay on; keepalive_timeout 65; types_hash_max_size 2048; include /etc/nginx/mime.types; default_type application/octet-stream; gzip on; server { listen 443 ssl http2; server_name 你的域名; ssl_certificate ; #证书位置 ssl_certificate_key ; #私钥位置 ssl_session_timeout 1d; ssl_session_cache shared:MozSSL:10m; ssl_session_tickets off; ssl_protocols TLSv1.2 TLSv1.3; ssl_prefer_server_ciphers off; location / { proxy_pass http://127.0.0.1:18080; # 对应 miniflux 的端口 proxy_redirect off; proxy_set_header Host $host; proxy_set_header X-Forwarded-Host $host; proxy_set_header X-Real-IP $remote_addr; proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for; proxy_set_header X-Forwarded-Proto $scheme; proxy_set_header Upgrade $http_upgrade; proxy_set_header Connection &quot;upgrade&quot;; proxy_http_version 1.1; } }} 4 发送通知 telegram bot 创建 参考 qq bot NapCatQQ 用 docker 安装，主动 WebSocket 方式 12345678910docker run -d \\-e ACCOUNT=&lt;机器人qq&gt; \\-e WS_ENABLE=true \\-e NAPCAT_GID=$(id -g) \\-e NAPCAT_UID=$(id -u) \\-p 3001:3001 \\-p 6099:6099 \\--name napcat \\--restart=always \\mlikiowa/napcat-docker:latest Overflow 使用 方法一 官网一键打包整合包，填入 主动 WebSocket 地址 参考 starbot 文档 装 java 环境和 mirai-api-http 插件 后台运行 nohup bash start.sh &gt; overflow-output.log 2&gt;&amp;1 &lt; /dev/null &amp; 参考 starbot 文档 装 starbot，装 python 和 redis 5 配置和使用 miniflux 取消自动将条目标记为已读 firefox tracking protection 对 rss 阅读器网站要关闭，否则 twitter 不显示图片 添加订阅时，以 twitter 为例 http://本地ip:1200/twitter/user/用户名/showEmojiForRetweetAndReply=1，本地 ip 不能是 127.0.0.1，那样会指向 miniflux docker 内部 更新 docker，以 rsshub 为例 123456789docker pull diygod/rsshubdocker image lsdocker psdocker stop old_container_iddocker rm old_container_iddocker run -d --name rsshub -p 1200:1200 -e CACHE_EXPIRE=30 diygod/rsshubdocker ps# 删掉旧的 imagedocker image prune 更新 docker-compose，即 miniflux，参考 123docker-compose pulldocker-compose up --detachdocker image prune 6 抓取 Twitter6.1 模拟浏览器获取通知 开发 Beginners guide to Web Push Notifications using Service Workers Web Workers API 测试 简单通知类型的 Selenium 抓取方式 两种通知类型的 Selenium 抓取方式 在 Chrome devtools 左上角切换到 Service Worker sw.js 来进行 js 的调试 arm arm 版 Selenium Grid Server 代码里 webdriver.Chrome() 改成 webdriver.Remote()，见 Selenium Grid 使用","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/%E8%87%AA%E5%BB%BA%20RSS/"},{"title":"日语","text":"1 初级上1.1 入门 学习方式（建议） 目标 最快 3、4 天一课 单词、课文背下来 抄写日本汉字时，把每个汉字对应的假名写在上面 每天背 20 个单词，分在每天两个时段 课后题和练习册全写 复习，默写课文，听写单词 顺序 单词 - 语法 - 背单词 - 背课文 - 课后练习 - 同步练习册 记笔记 背单词 汉字单词，先记字，然后记每个字的读音 固有词 汉字，但含义与中文不同 纯假名 汉字 + 假名 外来词，大部分英文单词，会读，意思能猜出来 写汉字还是假名 参考 常用漢字表.pdf 发音 注意 う 的读音，嘴收回来 我开桑塔纳，蛤蟆也来玩 平假名、片假名，相当于英文大小写 假名，假：假借，名：汉字 平假名，平常使用 片假名，外来词 高低音不同含义不同 3 种记忆方法 第几个位置出现 高 -&gt; 低 就是几型，除了 1 型以外都是第 1 个音低，即第 1 个和第 2 个的高低永远不同 出现降音就不会升回去 2 个字有 0 型和 2 型区分，本身都是低高，但影响后面第 3 个字的音高低 低高，我哥，拼音 3 声 – 拼音 1 声 高低，哥哥，拼音 1 声 – 拼音 1 声轻声 低高低，我哥哥 低高高低，美滋滋的 唇形变化比汉语小，发音时口形和声调的高低始终不变 ふ fu 与中文 fu 不同，只是稍微用力吹气 よ yo 读出去还要收回来的感觉 浊音，KG、SZ、TD、HB，其中 ZD 的第 2、3 为 ji、zi じず 和 ぢづ 都读 ji zi 半浊音，HP 长音 あ 段假名（包括浊音） + あ い 段假名（包括浊音） + い う 段假名（包括浊音） + う え 段假名（包括浊音） + え / い お 段假名（包括浊音） + お / う 长音高 –&gt; 低，类似 4 声拉长 长音低 –&gt; 高，类似 2 声拉长 片假名直接用长音符号 ー U+30FC 表示，不需要记忆 促音，小写 っ 占一拍，即一个假名的停顿时间 拗音，两个假名当成一个假名来读 い 段（包括浊音）+ やゆよ 拗音也适用于长音规则 特别读音 送气音和不送气，か、た、ぱ 位于词中、词末念不送气，主要是 か たてと，容易听成浊音 鼻浊音，g 行发音 Gboard Godan 输入法 使用方式 左右两手输入更方便，左手元音，右手辅音 下滑为数字，右滑为浊音，左滑半浊音 上滑补充剩下的字母，K -&gt; Q（ka 与 qa 相似）S -&gt; J （si -&gt; ji 浊音变化） T -&gt; C （ti 也写成 chi）H -&gt; F （hu 也写成 fu） L 下一个字母 M，X 下一个字母 Y，V 下一个字母 W 左右还有常见符号，R 键上下左右对应标点符号 小写 あいうえおつやゆよ ，用日语中不会用到的 x 或 l 加罗马音 外来词专用音节为了避免与现有冲突，ti di wo 加 h，变成 thi dhi who，tu du 加 w 变成 twu dwu ツァtsa ファfa ウィwi ティti フィfi ディdi，ti di 加 h，变成 thi dhi トゥtu ドゥdu デュdyu，tu du 加 w 变成 twu dwu，dyu 变成 dhu ウェwe シェshe チェche ツェtse フェfe ジェje ウォwo ツォtso フォfo，wo 加 h，变成 who 罗马音输入法主要参考 JIS X 4063:2000 标准 外来词 ti ティ 写出 thi 的讨论 ヘボン式 VS 訓令式 日语词典 1.2 第 1 课 58:49 语法 01:14:14 人称 01:14:54 第一人称 01:15:14 第二人称 01:15:44 第三人称 01:16:14 对他人称呼 さん、ちゃん 00:02 自我介绍 00:09 不同时间段问好 01:30 完整的介绍 02:03 基本课文 02:37 自己回答时不加 さん 03:54 应用课文 练习 1 通过重复熟悉 Name Size Date Modified JP 06（1）.mp4 205.0 MiB 2023/8/29 19:31:37 JP 06（2）.mp4 31.5 MiB 2023/8/29 19:31:26 JP 07.mp4 223.2 MiB 2023/8/29 19:31:22 JP 08.mp4 154.4 MiB 2023/8/29 19:31:11 JP 09.mp4 157.6 MiB 2023/8/29 19:31:04 JP 10.mp4 199.9 MiB 2023/8/29 19:30:55 JP 11.mp4 178.6 MiB 2023/8/29 19:30:45 JP 12.mp4 193.2 MiB 2023/8/29 19:30:37 JP 13.mp4 158.1 MiB 2023/8/29 19:30:27 JP 14.mp4 168.1 MiB 2023/8/29 19:30:20 JP 15.mp4 168.5 MiB 2023/8/29 19:30:13 JP 16.mp4 155.1 MiB 2023/8/29 19:30:04 JP 17.mp4 241.7 MiB 2023/8/29 19:29:57 JP 18.mp4 210.8 MiB 2023/8/29 19:29:36 JP 19.mp4 248.1 MiB 2023/8/29 19:29:26 JP 20.mp4 192.1 MiB 2023/8/29 19:29:15 JP 21.mp4 177.4 MiB 2023/8/29 19:29:06 JP 22.mp4 189.6 MiB 2023/8/29 19:28:57 JP 23.mp4 132.4 MiB 2023/8/29 19:28:49 JP 24.mp4 180.6 MiB 2023/8/29 19:28:40 JP 25.mp4 155.4 MiB 2023/8/29 19:28:32 JP 26.mp4 153.7 MiB 2023/8/29 19:28:25 JP 27.mp4 120.0 MiB 2023/8/29 19:28:18 JP 28.mp4 121.6 MiB 2023/8/29 19:28:10 JP 29.mp4 173.9 MiB 2023/8/29 19:28:03","link":"/%E7%88%B1%E5%A5%BD/%E6%97%A5%E8%AF%AD/"},{"title":"区块链","text":"来源 李永乐1、李永乐2、白皮书解读 记账奖励，货币产生 手续费 打包奖励，逐渐降低 以谁为准？ 第一个做出数学题 包含前块信息的 hash 值前 n 位为 0 如何防伪？ 身份认证，电子签名 钱不够或支付多次？ 双重支付，钱不够或支付多次，余额检查。从链上检查 如何防止篡改 最长链原则，链出现分叉后，以最长为准 当自己的算力超过其他所有人时（超过 50%），成为最长链，可修改了记录。然而如果算力这么强大，他就会选择挖矿赚钱","link":"/%E7%88%B1%E5%A5%BD/%E8%A7%86%E9%A2%91%E7%AC%94%E8%AE%B0/%E5%8C%BA%E5%9D%97%E9%93%BE/"},{"title":"如何将网络教程 (tutorial) 转成 PDF","text":"1 概述这篇文章是这个 repo 的 README 内容 1.1 问题由来 最近在用 BookxNote Pro （类似 margin note）做笔记，很多网络教程 (tutorial) 没有提供 PDF 版本，如果看过的内容没有立刻应用，就容易遗忘，而对网页做笔记不太容易（虽然有插件），所以在研究怎样批量存成 PDF，并且可以有目录（书签/菜单），同时去除无用元素 发现 puppeteer 非常适合，之前不太了解 js，一直忽略了它，它配合 puppeteer-cluster 可以实现并行抓取 1.2 基本使用和测试 安装 nodejs、puppeteer、puppeteer-cluster 修改 index.js 修改 puppeteerOptions 中的 userDataDir 路径，用于存放浏览器数据 修改 puppeteerOptions.args 中的 --proxy-server 一行的代理设置，没有代理则去掉 运行 node index.js 会在当前目录生成 test 文件夹，抓取正常的话会生成 1.1.1 Async iteration and generators.pdf 修改 index.js 最后的， await cluster('configs\\\\test.txt'); 注释掉，使用下面的 await cluster('configs\\\\The Modern JavaScript Tutorial.txt');，即可生成 PDF 在 The Modern JavaScript Tutorial 文件夹下，最后可选择用 PDF 编辑器（如福昕pdf编辑器） 合并 PDF为一个文件 如想了解对网络教程生成 PDF 的通用方法，或想生成 The Modern JavaScript Tutorial 的 PDF 书签更精细可以向下阅读 1.3 通用方法 通用的转换方法分为 4 步 获取菜单，可手动填写，也可以通过辅助脚本 make_menu.js 生成。最终构造一个每行包含“下载 url”、“要保存的文件名”、“等级”（行首 tab 缩进个数表示当前文章在教程的等级）所组成的配置文件。已经写好的一些在 configs 文件夹下，可供参考 使用 index.js 运行 puppeteer 根据前面的配置文件，将每个页面保存成单独的 PDF 在运行前，一般需要修改配置文件，加入抓取前要运行的 JS 代码，代码的目的一般是操作 DOM 移除无用的元素，调用 click 展开折叠的内容，设置 CSS 样式等，相当于生成 PDF 前的预处理。这部分 JS 代码，在配置文件中以 ! 开头。配置文件的详细格式可见 configs 下面的示例说明 使用 PDF 编辑器（如福昕pdf编辑器），合并 PDF为一个文件 在合并前，如有某个等级的内容缺少，需要生成占位的 PDF，如 The Modern JavaScript Tutorial 教程就只有 2、3 级有对应页面，而 1 级没有对应页面，那么就需要生成 3 个 1 级 PDF，1. The JavaScript language.pdf、2. Browser꞉ Document, Events, Interfaces.pdf、3. Additional articles.pdf，将这 3 个 PDF 放入前面抓取保存 PDF 的文件夹中，一起进行合并 在合并后，会发现所有菜单（书签）都是 1 级，这时要用 FreePic2Pdf 提取书签生成 FreePic2Pdf_bkmk.txt， 调用 correctBkmk.js 对菜单等级进行修正，再将修改后的 FreePic2Pdf_bkmk_corrected.txt 挂回到原来的 PDF 中 （可选）添加页面内部等级，如按以上步骤生成的 The Modern JavaScript Tutorial 是 3 级菜单，但抓取时每个页面内部也是有标题的，页面内的标题可以构成第 4 级菜单 用 PDF补丁丁 选择要作为 4 级的内容来自动生成书签，生成前勾选保留原有书签（即原来已经存在的前 3 级书签），保存改后的 PDF 再用 FreePic2Pdf 提取改后的 PDF 书签生成 FreePic2Pdf_bkmk.txt，手动修正 FreePic2Pdf_bkmk.txt 中末尾 4 级书签的前几项 （PDF补丁丁生成的前几项的缩进是错的，要加 tab） 最后调用 sortBkmk.js，将 4 级书签按照页码顺序拆入到之前生成的前 3 级书签中，生成 FreePic2Pdf_bkmk_sorted.txt 将 FreePic2Pdf_bkmk_sorted.txt 挂回到原来的 PDF 中，至此，一个包含 4 级菜单（书签）的 PDF 制作完成 针对不同的网络教程转 PDF 时，多数流程可以复用，每次需要改变的是 第 1 步中 make_menu.js 的 CSS selector 或选择手动构造配置文件也行 第 2 步中用于生成 PDF 前的预处理 JS 代码 index.js 中，调整并发数目、延时、如有 iframe 则需要等待 frame 加载完，等少量修改 如有某个等级的内容缺少，需要生成占位的 PDF 2 步骤详细说明以下步骤以 The Modern JavaScript Tutorial 为例进行说明 2.1 获取菜单，构造配置文件 在 devtools 的 sources 中新建 snippet，粘贴 make_menu.js 代码 首先通过 chrome devtools 观察网页结构，确定 make_menu.js 中 selectors 数组的内容 selectors 是二维数组，第 1 维度表明不同的级数，比如这个网页有 3 级菜单，那么第 1 维就有 3 个元素 第 2 维度可有 2-4 个元素，依次如下 items_selector，选择这一级菜单集合的 selector，原理是 这一级元素集合 = 上一级元素.querySelectorAll(items_selector) item_title，选择这一级菜单标题的 selector，原理是 forEach 这一级元素集合 { 标题 = 其中某一元素.querySelector(item_title) } item_url 同 item_title，只不过有的等级没有对应的 url，只有标题时，则这一项不填 item_action，有的菜单需要点击后才会展开，才能获取到下一级菜单，如需点击则为 ‘click’，点击 item_url 后，再继续获取下一级菜单，不需要则不填 多次调试确定好 selectors 后，运行 make_menu 会打印获取到的菜单，右键 save 将其存为 log 使用带列块编辑的文本编辑器，如 notepad++，删除 log 前无用内容 将 log 文件改名成 xxx.txt 放入 configs 文件夹，xxx 一般是教程的名字 对于不复杂、内容不多的教程，可手动填写配置文件，格式见 configs 文件夹下的例子 注意配置文件换行是 linux 文件格式 \\n 作为换行符，不是 windows 格式 2.2 设置 JS 代码，下载 PDF 修改 index.js 最后使用的配置文件为前面构造的，用 node index.js 测试 一般来说需要设置 JS 来将无用元素删除掉，这样生成的 PDF 更干净 比如不想包含页面最上面这个工具栏，通过 devtools 确定 class 后，使用 querySelector 删除掉 反复测试，确定好最终要执行的 JS，将其写入到配置文件中，JS 代码以 ! 开头，注释以 * 开头。如 The Modern JavaScript Tutorial 的最终 JS 代码如下 最后用 node index.js 下载 PDF 2.3 完善 PDF 生成的 PDF 有可能某个等级的 PDF 缺失，比如 The Modern JavaScript Tutorial 就是第 1 级缺失，需要生成占位的 PDF，对于 The Modern JavaScript Tutorial 就是 3 个 PDF 推荐编写 HTML 然后用 chrome 打开，按 A4 大小输出成 PDF 将生成的 PDF 放入前面步骤存放抓取 PDF 的同一目录，使用 PDF 编辑器（如福昕pdf编辑器）合并成一个 PDF 生成的 PDF 目录等级都是 1 级，所以需要修正 用 FreePic2Pdf 选 “从 PDF 取书签”，生成 FreePic2Pdf_bkmk.txt，拷贝到 correctBkmk.js 所在目录 用 correctBkmk.js 修正 FreePic2Pdf_bkmk.txt 将修正后的 FreePic2Pdf_bkmk_corrected.txt 粘贴到原 FreePic2Pdf_bkmk.txt 用 FreePic2Pdf 选 “往 PDF 挂书签”，将改后书签挂回 2.4 （可选）添加页面内部等级 如按以上步骤生成的 The Modern JavaScript Tutorial 是 3 级菜单，但抓取时每个页面内部也是有标题的，页面内的标题可以构成第 4 级菜单 使用 PDF 补丁丁，在要作为 4 级标题的内容上右键，在生成书签时一定要勾选“保留原有书签”，最后保存 PDF 用 FreePic2Pdf 选 “从 PDF 取书签”，生成 FreePic2Pdf_bkmk.txt，操作方法参考前一步骤 手动修正 FreePic2Pdf_bkmk.txt 中末尾 4 级书签的前几项 ，PDF补丁丁生成的前几项的缩进是错的，要加 tab 将 FreePic2Pdf_bkmk.txt，拷贝到 sortBkmk.js 所在目录，将 4 级书签按照页码顺序拆入到之前生成的前 3 级书签中，生成 FreePic2Pdf_bkmk_sorted.txt 将修正后的 FreePic2Pdf_bkmk_sorted.txt 粘贴到原 FreePic2Pdf_bkmk.txt 用 FreePic2Pdf 选 “往 PDF 挂书签”，将改后书签挂回，操作方法参考前一步骤 3 最终效果 至此便成功生成了 The Modern JavaScript Tutorial 的具备 disqus 评论、4 级书签的 PDF 文件 由于 The Modern JavaScript Tutorial 的 PDF 版本是收费的，所以不提供最终的 PDF，请按教程自行下载 用到的 FreePic2Pdf 和 PDF 补丁丁 在 bin 目录内，也可自行搜索最新版 可按照这个方法将其它网络教程 (tutorial) 转成 PDF","link":"/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3.%20%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/%E5%A6%82%E4%BD%95%E5%B0%86%E7%BD%91%E7%BB%9C%E6%95%99%E7%A8%8B%20(tutorial)%20%E8%BD%AC%E6%88%90%20PDF/"}],"tags":[],"categories":[{"name":"专业","slug":"专业","link":"/categories/%E4%B8%93%E4%B8%9A/"},{"name":"物理环境","slug":"物理环境","link":"/categories/%E7%89%A9%E7%90%86%E7%8E%AF%E5%A2%83/"},{"name":"爱好","slug":"爱好","link":"/categories/%E7%88%B1%E5%A5%BD/"},{"name":"读书笔记","slug":"爱好/读书笔记","link":"/categories/%E7%88%B1%E5%A5%BD/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"},{"name":"虚拟环境","slug":"虚拟环境","link":"/categories/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/"},{"name":"2. 处理平台","slug":"虚拟环境/2-处理平台","link":"/categories/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/2-%E5%A4%84%E7%90%86%E5%B9%B3%E5%8F%B0/"},{"name":"4. 分享与备份","slug":"虚拟环境/4-分享与备份","link":"/categories/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/4-%E5%88%86%E4%BA%AB%E4%B8%8E%E5%A4%87%E4%BB%BD/"},{"name":"3. 处理工具","slug":"虚拟环境/3-处理工具","link":"/categories/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/3-%E5%A4%84%E7%90%86%E5%B7%A5%E5%85%B7/"},{"name":"1. 来源与收集","slug":"虚拟环境/1-来源与收集","link":"/categories/%E8%99%9A%E6%8B%9F%E7%8E%AF%E5%A2%83/1-%E6%9D%A5%E6%BA%90%E4%B8%8E%E6%94%B6%E9%9B%86/"},{"name":"Galgame","slug":"爱好/Galgame","link":"/categories/%E7%88%B1%E5%A5%BD/Galgame/"},{"name":"Ever17","slug":"爱好/Galgame/Ever17","link":"/categories/%E7%88%B1%E5%A5%BD/Galgame/Ever17/"},{"name":"人物","slug":"爱好/Galgame/Ever17/人物","link":"/categories/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E4%BA%BA%E7%89%A9/"},{"name":"地点","slug":"爱好/Galgame/Ever17/地点","link":"/categories/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E5%9C%B0%E7%82%B9/"},{"name":"场景","slug":"爱好/Galgame/Ever17/场景","link":"/categories/%E7%88%B1%E5%A5%BD/Galgame/Ever17/%E5%9C%BA%E6%99%AF/"}],"pages":[]}